{
    "New item": {
        "chapters": [
            {
                "chapter_id": 1,
                "chapter_name": "1. MINISTRY OF AGRICULTURE &\nFARMERS WELFARE",
                "chapter_path": "./screenshots-images-2/chapter_1",
                "sections": [
                    {
                        "section_id": 1.1,
                        "section_name": "1. MINISTRY OF AGRICULTURE &\nFARMERS WELFARE",
                        "section_path": "./screenshots-images-2/chapter_1/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_1/section_1/06a5335a-6645-4a84-a257-99b42b999e29.png",
                            "./screenshots-images-2/chapter_1/section_1/3efd4d36-4b05-4bd2-9423-062cbfc6fef6.png",
                            "./screenshots-images-2/chapter_1/section_1/e341e876-2d08-4707-8583-593f06891881.png",
                            "./screenshots-images-2/chapter_1/section_1/26d1e157-ccfe-40e6-bda4-4fc82f21ad63.png",
                            "./screenshots-images-2/chapter_1/section_1/f0f2e766-0e0d-4484-a9be-f3ae1ee48930.png",
                            "./screenshots-images-2/chapter_1/section_1/8fb18420-529f-4c45-949b-b09a04cba7d6.png",
                            "./screenshots-images-2/chapter_1/section_1/dd1ee2e8-7e06-41d0-b7a2-31b5d820e505.png",
                            "./screenshots-images-2/chapter_1/section_1/bc056aa2-b46b-4496-b6c1-1db53470f840.png",
                            "./screenshots-images-2/chapter_1/section_1/8dfd1d3e-ea06-4853-9509-1fa620e6964f.png",
                            "./screenshots-images-2/chapter_1/section_1/12f269d0-5984-4d81-8999-99b9d125ccec.png",
                            "./screenshots-images-2/chapter_1/section_1/8ec796e5-3031-445f-b249-d8a4a836e9e9.png",
                            "./screenshots-images-2/chapter_1/section_1/c8da963b-a317-489d-8320-c928d0dfb984.png",
                            "./screenshots-images-2/chapter_1/section_1/c70c2c89-d79f-430b-8289-2c0e11d4b126.png",
                            "./screenshots-images-2/chapter_1/section_1/f978f125-a8c0-4af7-8d80-ccd2291567b2.png",
                            "./screenshots-images-2/chapter_1/section_1/6b6b8a4b-3085-46e1-a7f5-f626ba2d6dbb.png",
                            "./screenshots-images-2/chapter_1/section_1/1ad354aa-ed3a-4687-8edb-f42ca2cb710e.png",
                            "./screenshots-images-2/chapter_1/section_1/4da77678-5973-48d2-981e-359e28ab1b99.png",
                            "./screenshots-images-2/chapter_1/section_1/f726b40d-bee5-458d-9513-7b626649de5d.png",
                            "./screenshots-images-2/chapter_1/section_1/bc9a266d-a77a-4e15-8193-0bf11e074192.png",
                            "./screenshots-images-2/chapter_1/section_1/c1e3928f-8c47-4c71-98c8-f9bb2fff2fe5.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "Quick Facts\n\n:\no\n2\na\nCc\nc\ntJ\nm\ni\nn\nrad\nPd\nav\n“4\nwn\na\nm\nun\nCc\nz\ni]\n=\n3\n\nType: Central Sector Scheme\n\nove ©\n\nTenure: Upto 2032- 33\n\nObjective\n\ni\n\nTo mobilize a medium to long term debt financing facility for investment in viable projects for post-harvest\n\nmanagement Infrastructure and community farming assets.\n\nSalient Features\n\n|\n\n°\n\nBackground: AIF was launched as part of\n\nthe Atmanirbhar Bharat Abhiyan (Self-\n\nReliant India Campaign) announced by\n\nthe Centre in May 2020.\n\nFinancial assistance\n\n+ Provision of Rs. 1 Lakh Crore by banks\nand financial institutions as loans with\ninterest subvention of 3% per annum\nand\n\n« Credits guarantee coverage under\nCredit Guarantee Fund Trust for Micro\nand Small Enterprises (CGTMSE) for\nloans up to Rs. 2 Crores.\n\nEligible community assets project\n\n*\n\n*\n\n* Projects identified for providing supply chain infrastructure for clusters of crops including export\n\nclusters.\n\nSome key\nBeneficiaries\n\nFarmers\n\nPrimary\n\n»\n\nAgricultural) -——— \\\nCredit Societies / / aia\n(pacs) / Farmer\n/ Producers\n\nwe, / Organisations \\\n\n\\_(fPos)_J\n\nPurpose: To address the existing infrastructure gaps and mobilize investmentin agriculture infrastructure.\n\nImplementing Agency: NABARD (National Bank for Agriculture and Rural Development)\n\nSelf Help\nGroups\n(sHG)\n1g]\nState\nAgencies/\nAPMCs\n\n« Projects promoted by Central/State/Local Governments or their agencies under PPP.\n\n* Organic inputs production; Bio stimulant production units; Infrastructure for smart and precision\n\nagriculture.\n\n* Management and monitoring\n+ Through an online Management Information System (MIS) platform.\n\n+ National, State and District level Monitoring Committees will ensure real-time monitoring and effective\nfeedback.\n\n* BHARAT campaign: Banks Heralding Accelerated Rural & Agriculture Transformation (BHARAT) campaign\nwas launched to:\n\n+ Provide maximum benefits to the people\n\n+ Create a competitive spirit among the Banks and lending institutions to mobilize agriculture\ninfrastructure projects loan at a faster pace.\n\n1.2. FORMATION AND PROMOTION OF 10,000 NEW\nFARMER PRODUCER ORGANIZATIONS (FPOS)\n\n@) Quick Facts\n\n* Type: Central Sector Scheme\nPurpose: Leveraging economies of scale and improving market access for members\n\n© Beneficiaries: FPO with a minimum farmer-members’ size of 300 (in plains) and 100 in (North-Eastern and\nHilly areas)\n\nImplementing Agencies (IAs): 9 IAs will help forming FPOs\n\nTo form and promote 10,000 new FPOs till\n2027-28.\n\nSmall Farmers Agri-\n> Salient Features & Business Consortium ‘i\n(sFac) North Eastern Regional\n\nAgricultural Marketing\nCorporation Limited\n(NERAMAC)\n\n* FPO: FPO is a generic name, which\nmeans and includes FPOs incorporated/\nregistered either under Companies Act or > Foundation for\nunder Co-operative Societies Act of the Development of Rural Value\nconcerned cates nates ronan iT] @ Chains (FDRVC)- Ministry of\n. \\griculture and Rural Rural Development (MoRD)\n\nDevelopment\n(NABARD)\n\nge, National Cooperative\n\n‘@w Development\nb& Corporation (NCDC)\n\n+ They are formed for the purpose\nof leveraging collectives through\neconomies of scale in production and National Agricultural\n\nmarketing of agricultural and allied 5 3a, Cooperative\nsector. \"9 9 Os Marketing Federation\n\nWatershed Development\nDepartment (WDD)-\nKarnataka\n\nof India (NAFED)\n\n\n°\n\n1.3. PRADHAN MANTRI KISAN SAMMAN NIDHI\nSCHEME (PM-KISAN)\n\nApproach: The formation and promotion of FPO is based on Produce Cluster Area approach and\n\nspecialized commodity-based approach.\n\n« While adopting cluster-based approach, formation of FPOs will be focused on “One District One\nProduct” for development of product specialization.\n\nFinancial assistance to the FPOs: FPOs will be provided:\n\n+ Financial assistance upto Rs 18.00 lakh per FPO for a period of 3 years.\n\n* matching equity grant upto Rs. 2,000 per farmer member of FPO with a limit of Rs. 15.00 lakh per FPO\nand\n\n* a credit guarantee facility upto Rs. 2 crore of project loan per FPO from eligible lending institution to\nensure institutional credit accessibility to FPOs.\nHandholding to the FPOs\n\n+ Implementing Agencies (As) will engage Cluster Based Business Organizations (CBBOs) to aggregate,\nregister & provide professional handholding support to each FPO for a period of 5 years.\n\nTraining & skill development of FPOs\n\n+ Key organizations chosen as the lead training institutes for capacity development & trainings of FPOs:\n¢ Bankers Institute of Rural Development (BIRD), Lucknow.\n\nLaxmanrao Inamdar National Academy for Co-operative Research & Development (LINAC), Gurugram.\n\ninstitutional framework\n\n* National Project Management Agency (NPMA): for providing overall project guidance, coordination,\ncompilation of information relating to FPOs, maintenance of MIS and monitoring purpose.\n\n* District Level Monitoring Committee (D-MC): Under the Chairmanship of District Collector/ CEO/ Zila\nParishad for overall coordination & monitoring the implementation of scheme in the district\n\n@ Quick Facts\n\nPurpose: To supplement the financial needs of all landholding farmers’ families in procuring various\ninputs and also domestic needs\n\nType: Central Sector Scheme\nBeneficiaries: All the landholding farmers, subject to certain exclusions\nBenefits: 26,000 per year in three equal instalments of 2 2,000 each every four months\n\nTo provide income support to all land-holding eligible farmer families (families include husband, wife and\nminor children).\n\nSalient Features\n\n© Land records mandatory: However, exception\n\nfor forest dwellers, North-eastern states and Former and\nJharkhand which has separate provisions for tepeionzea/\nland records is made. Formas ones erarvatens\n- Prosar yar Central/state All person who\n* Identification of beneficiary: Responsibility of corporations/ Paid income\nstate/UT government. Chairpersons of assessment\n\n© Self-registration Mechanism: Through mobile\napp, PM KISAN portal and Common Service\nCenters (CSC). /\n\n® Kisan Credit Cards (KCC): To be given to rDigers of “ie acters\nAll PM-KISAN beneficiaries to provide them | \\ consttutonat \".\nshort-term loans for crop and animal/fish\nrearing at a maximum interest of 4% on\ntimely repayment.\n\nPrevention of diversion of funds: Physical Atinssnationel raed tiers\nVerification Module (of 5% beneficiary every or PSE\nyear), Aadhar authentication and Income Tax weeeneionie ©\npayee verification. Rs. 10,000/~\n\nor more\n\n* Project Management Unit (PMU): Established\nat the Central level, PMU is responsible for\noverall monitoring of the scheme. State Governments may also consider setting up a dedicated PMU.\n\n* Grievance redressal: Any grievances received by the Grievance Redressal Committee should be\npreferably disposed of within two weeks.\n\ne &xclusion: Beneficiaries of higher economic status shall not be eligible.\n\n1.4. PRADHAN MANTRI FASAL BIMA YOJANA (PMFB .\n\n@) Quick Facts\n\n* Purpose: Comprehensive crop insurance from pre-sowing to post-harvest period\n® Type: Central Sector Scheme\n\n* Nature: Demand driven scheme and is voluntary for the States as well as farmers\n® Beneficiaries: All farmers including sharecroppers and tenant farmers\n\ne Financial support to farmers suffering crop loss/damage, stabilizing their income and ensuring flow of\ncredit to the agriculture sector.\n\nAdoption of innovative & modern agricultural practices and crop diversification.\n\neZ\n\nnt Features\n\nBackground: PMFBY replaced the National Agricultural Insurance Scheme (NAIS) and Modified NAIS.\n+ However, the Restructured Weather-Based Crop Insurance Scheme (RWBCIS) is still continued.\n+ RWBCIS uses weather parameters as “proxy for crop yields in compensating the cultivators for\n\ndeemed crop losses.\n\nCrops covered for rabi and kharif: All cereals, millets, pulses, and Oilseeds.\nPremium to be paid: Premium is paid as % of the sum assured or Actuarial Premium Rate (APR), whichever\n\nis less.\n\n+ APR is the premium rate set by insurance companies.\n\n(@) Premium tobe pail\n\nPremium\nby farmers\n\n'5% for commercial) (2.0% for Kharit\nhorticultural crops. crops\n\n15% for Rabi\ncorps\nInsured sum of crops:\n\n* Crops with MSP: States/UTs can either choose a\nscale of finance or district-level value of notional\naverage yield at MSP.\n\n+ Crops without MSP: Farm gate price will be\nconsidered.\n\nCoverage of risk and exclusion\n\n* Basic Coverage (mandatory): Yield losses\n(sowing to harvesting) due to non-preventable\nrisks like drought, dry spells, flood, inundation,\netc.\n\n« Add-On Coverage (Discretion of states):\nCoverage for Prevented Sowing/Planting/\nGermination Risk, etc.\n\n* General Exclusions: Losses arising out of war\nand nuclear risks, malicious damage, and other\npreventable risks.\n\nSteps taken to Increase Coverage\nincrease in tenure to 3 years for selection of insurance company through bidding process;\n\nIntroduction of three alternative risk models viz. Profit and Loss Sharing, Cup and Cap (60-130), Cup and\nCap (80-110) under which if no claim is made then a portion of the premium paid by the state will go into\n\n.\n\nthe state treasury itself;\n\ni Premium by the government\n(shared between Centre and State)\n\nIn the ratio 50:50 (for rest of\n90:10: (for NER) the states).\n\ng\n\nArea Approach basis\nie, all the farmers in\n‘Insurance Unit\n(lu) face\nsimilar\n\nOther\nprovisions\n\nStates can set up\ntheir own insurance,\ncompanies\n\nCROPIC (Collection of Real Time Observations and Photo of Crops)\n\nAllocation of business\nto Insurance\nCompanies to be\ndone for 3 years\n\n\nOther Key Initiatives under PMFBY:\n\nDigiClaim: Under DigiClaim all the claims are worked out through National Crop Insurance Portal (NCIP)\n\ninstead of by insurance company and paid to farmers accounts using Public Finance Management\n\nSystem (PFMS), which can be monitored by Central and State Government.\n\n* Farmers do not operate the DigiClaim module and only Gol & State Government functionaries have\naccess to it.\n\n» However, on settlement of claims, a SMS with a link is sent to the farmer from which farmer can track\nthe status of payment of claims.\n\nWeather Information Network Data Systems (WINDS) portal: A centralized platform processes hyper-\n\nlocal weather data from Automatic Weather Stations and Rain Gauges at various levels, improving risk\n\nassessment and decision-making.\n\nYield Estimation System, based on Technology (YES-TECH) Manual: A tech-driven yield estimation\n\nsystem providing methods, best practices, and integration insights for precise yield assessments at the\n\nGram Panchayat level.\n\nDoor to Door enrollment app AIDE/Sahayak: Aims to enhance the accessibility of the scheme.\n\nForecasting Agricultural output using Space, Agro- meteorology and Land based observations (FASAL)\n\nproject.\n\nNational e-Governance Plan in Agriculture (NeGPA) for timely access to agriculture related information\n\nthrough ICT use.\n\nNational Agricultural Drought Assessment and Monitoring System (NADAMS) for Agricultural drought\n\nassessment.\n\nISRO’s Geo-platform, Bhuvan, provides data on plantation, pest surveillance and weather.\n\n1.5. PRADHAN MANTRI KISAN MAAN-DHAN\nYOJANA (PM-KM\n\noO Quick Facts\n\noe ee\n\nType: Central Sector Scheme\n\nPurpose: Old age protection and social security of Small and Marginal Farmers (SMF)\nEligibility: Land upto 2 ha and age between 18 to 40 years\n\nFund manager: Life Insurance Corporation (LIC)\n\nTo provide social security to Small and Marginal Farmers in their old age when they have no means of\nlivelihood and minimal or no savings to take care of their expenses.\n\n> Salient Features\n« Benefit\n\nAssured pension of Rs. 3000/- month\non attaining the age of 60 years.\n\nVoluntary and Contributory former and present, Merors sormer and present\nof Municipal corporations,\n+ Monthly contribution by farmer Cheitpersons of istrict || } cone eget\nranges between Rs.55 to 200 to the Ponchayats Pt \\ Post\n\nFamily pension\n\n.\n\nProvisions for disability\n\nPension Fund, depending on the age =\nof entry into the Scheme.\n\nMatching contribution is made by @s a 2\n‘security\n\nthe Central government. Former and present\n\n© tegistatures/ ministers at\nExclusion Central/state Govt\n\nIf the subscriber dies, the spouse P -\n\nshall be entitled to receive only 50% f -\n\nof the pension received by subscriber. | “ ge\nAll Persons who\n\npaid income Taxin last\n\nIf the subscriber becomes disabled | Pifscuainsiuitt Tosing\nassessment year\n\nbefore attaining the age of 60 years: Stott Levees tv/Group D\n\n@ Spouse shall be entitled to “\ncontinue with the scheme\nsubsequently.\n\n© Spouse may exit the Scheme with the subscriber's share of contribution with savings bank rate\nof interest or accumulated interest as actually earned by the Pension Fund, whichever is higher\n\nExit provisions\n\nPremature exit\n\n¢ Exit within ten years from the date of joining the Scheme: Subscribers will get his/her share of\ncontribution with savings bank rate of interest\n\nExit after 10 years from the date of joining but before the age of 60: Subscribers will get his/her share\n\nof contribution with savings bank rate of interest or accumulated interest as actually earned by the\n\nPension Fund, whichever is higher\n\n1.6. NATIONAL MISSION ON EDIBLE OILS -\n\nOIL PALM (NME\n\nP)\n\noo) Quick Facts\n\nType: Centrally Sponsored Scheme\n\nPurpose: To reduce dependence on edible oil imports\n\nSpecial focus regions: North east and Andaman and Nicobar Islands\nTenure: Upto 2025-26\n\neet\n\nTo enhance the edible oilseeds production by harnessing Oil Palm area expansion.\n\n> Salient Features\n\nBackground: The mission was launched in 2021, and the oil palm development programme of National\n\nFood Security Mission (NFSM- Oil palm programme) was also subsumed under this scheme.\n\n+ Oil Palm, originated from West Africa is comparatively a new crop in India and has highest vegetable\noil yielding capability per ha.\n\n+ It produces two distinct oils, ie. palm oil and palm kernel oil, which are used for culinary as well as\nindustrial purposes. India imports 57% of the total edible oil.\n\nTarget\n\n« Till 2025-26:\n\ne To increase area of oil palm to 10 lakh hectares by adding additional 6.50 lakh ha (3.22 lakh\nhectares for general state and 3.28 lakh ha in North Eastern states).\n¢ Increase in Crude Palm Oil production to 11.20 lakh tonnes\n\n+ Increase consumer awareness to maintain consumption level of 19.00 kg/person/ annum.\n\nAssistance is provided for: Planting material, inputs for intercropping upto gestation period of 4 years\n\nand for maintenance, establishment of seed gardens, nurseries, bore well/pump set/water harvesting\n\nstructure, etc.\n\nEfficient water management: Emphasis has been given to promote micro irrigation and water\n\nconservation in oil palm.\n\nRegions for cultivation: ICAR- Indian Institute of Oil Palm Research (IIOPR) 2020 has assessed around 28\n\nlakh hectares potential for oil palm cultivation.\n\n+ Potential states and districts of Andhra Pradesh, Chhattisgarh, Goa, Gujarat, Maharashtra, Madhya\nPradesh, Mizoram, Karnataka, Kerala, Odisha, Tamil Nadu, Telangana, Arunachal Pradesh, Assam,\nBihar, Manipur, Meghalaya, Nagaland, Tripura, Uttar Pradesh, West Bengal and Andaman & Nicobar\nislands.\n\n1.7. MISSION FOR INTEGRATED DEVELOPMENT ™g\nOF HORTICULTURE (MIDH)\n\n@) Quick Facts\n\nType: Centrally Sponsored Scheme\n\nPurpose: Holistic development of horticulture in the country\n\nAssistance: Financial & technical assistance is provided to States/UTs for key interventions\nCoverage: All the States/UTs are covered\n\n* Adopt an end-to-end holistic approach covering production, post-harvest management, processing\nand marketing to assure appropriate returns to growers/ producers.\n\nPromote R&D technologies for production, post-harvest management and processing.\n\nEnhance acreage, coverage, and productivity through diversification (from traditional crops to\nplantations, orchards, vineyards, etc.) and extension of appropriate technology to farmers.\n\nAdopt a coordinated approach and promote partnership, convergence and synergy.\n\nEnhance horticulture production and productivity, encourage aggregation of farmers and support their\nskill development.\n\n> Salient Features\n\n* Background: Scheme is being\nimplemented from 2014-15.\n\n* Crops covered: Fruits,\nvegetables, root & tuber crops,\nmushrooms, spices, flowers,\naromatic plants, coconut,\ncashew, cocoa and bamboo.\n\n7?\n\na, Major interventions financed under MIDH\n\nSetting up of nurseries,\ntissue culture units for\nproduction of quality seed\nand planting material Creation of water resources\nstructures and watershed\n\n* Fund sharing\n\nSubsidy is shared between\nthe Central Government\nand State Governments in\nthe ratio of 60:40 in all the\nstates other than North\nEastern and Himalayan\nstates, where the pattern\nof assistance is shared in\nthe ratio of 90:10.\n\nIn case of NHB, CDB, CIH,\n\nArea expansion ie.\nEstablishment of new\norchards and gardens for\nfruits, vegetables, and flowers.\n\nRejuvenation of unproductive,\nold, and senile orchards\n\n&\ngrow off season high value\n“_~_ vegetables and flowers\n\nand the National Level\nAgencies (NLA), the Centre\nic farmit id\ncontributes 100%. Organic farr ng on\n® Sub-schemes\n+ National Horticulture\n\nProtected cultivation, ie. poly-)\nhouse, green-house, etc, to\nimprove the productivity &\n\nmanagement\n\nCreation of Post Harvest\nManagement and Marketing\ninfrastructure\n\nHorticulture Mechanization\n\n8ee-keeping for pollination\n\nMission (NHM): To promote holistic growth of horticulture sector through an area based regionally\ndifferentiated strategies\n\nHorticulture Mission for North East & Himalayan States (HMNEH): It is a technology mission which\nfocuses on production of quality planting material, organic farming, efficient water management, etc.\nNational Horticulture Board (NHB): NHB is implementing various schemes under MIDH in all States and\nUTs\n\nCoconut Development Board (CDB): CDB is implementing various schemes under MIDH in all Coconut\ngrowing states in the country\n\n+ Central institute for Horticulture (CIH), Nagaland: Established for providing technical support through\ncapacity building and training of farmers and Field functionaries in the North Eastern Region.\n\n® Monitoring: Executive Committee headed by Secretary (DAC&FW) monitors the progress of Mission.\nOther initiatives under MIDH\n* CHAMAN (Coordinated Horticulture Assessment and Management using geoiNformatics)\n\n+ Area assessment and production forecasting of 7 major horticultural crops in selected districts of\nmajor states (12 states, 185 Districts).\n\n« Key crops include: Mango, Banana, Citrus, Potato, Onion, Chilli & Tomato\n* Use of GIS (Geographical Information System) and remote sensing data for generating action plans.\n@ HORTNET\n\n« HORTNET project is a web enabled work flow-based system for providing financial assistance under\nMIDH.\n\n«  Itis a unique intervention to accomplish e-Governance in NHM wherein total transparency has been\nenvisaged in all the processes of workflow i.e, online application filing, authentication, processing and\nonline payment to the beneficiary's bank account through DBT.\n\nKISAN CREDIT CARD (KCC) a\n\nQuick Facts\n\nPurpose: To meet the financial requirements of farmers at various stages of farming.\nImplementing agency: Commercial Banks, RRBs, Small Finance Banks and Cooperatives.\n\nEligibility: Farmers - individual/joint borrowers who are owner cultivators; Tenant farmers, oral lessees\n& share croppers; Self Help Groups (SHGs) or Joint Liability Groups (JLGs) of farmers including tenant\nfarmers, share croppers etc.\n\nAllied sectors coverage: Animal husbandry and fishery related\n\nAdequate and timely credit support from the banking system under a single window with flexible and\nsimplified procedure for meeting:\n\n« short term credit requirements for cultivation of crops,\n\n« Post-harvest expenses,\n\n«Produce marketing loan,\n\n+ Consumption requirements of Farmer Household,\n\n* Working Capital for maintenance of farm assets,\n\n+ Investment credit requirement for agriculture and allied activities.\n\n°\n\nSalient Features\n\n© Short-term credit\n\n+ Collateral free loan up to Rs. 1.6 lakh\n\n+ No processing fee\n\n+ Interest Subvention: 3% p.a. interest subvention for prompt borrowers up to Rs. 3.00 lakhs.\n\n+ Premium borne by both the bank and borrower (in 2:1 ratio respectively).\n* longterm credit\n\n+ Long term credit limit portion: Investment credit requirement for agriculture and allied activities.\n® Risk coverage\n\n+ Death or permanent disability resulting from accidents caused by external, violent and visible means\nto KCC holder.\n\n® Other facilities\n\ni hig\n\nAll PM~KISAN ATM enabled Any number of One-time\nbeneficiaries RuPay Card withdrawals documentation\nare given the KCC within the limit\n\n1.9. RASHTRIYA KRISHI VIKAS YOJANA (RKVY) \"Sg\nAFETARIA SCHEME\n\nQuick Facts\n\nPurpose: Incentivizes States to increase public investment in Agriculture & allied sector\nType: Centrally Sponsored Scheme\nCoverage: All States / UTs shall be eligible for funding under RKVYRAFTAAR\n\nFlexibilities to states: States can select projects and programmes under the scheme as per their need,\npriorities and agro-climate requirements\n\nTo strengthen the farmers’ efforts through creation of required pre and postharvest agri-infrastructure\nthat increases access to quality inputs, storage, market facilities etc.\n\nTo provide autonomy, flexibility to States to plan and execute schemes as per local/ farmers needs\n\nTo promote value chain addition linked production models that will help farmers increase their income\nas well as encourage production/ productivity\n\nTo mitigate risk of farmers with focus on additional income generation activities\nTo attend national priorities through several sub-schemes.\n\nTo empower youth through skill development, innovation and agrientrepreneurship based agribusiness\nmodels that attract them to agriculture.\n\n> Salient Features\n\n°\n\nBackground: RKVY was initiated in 2007\n\nas an umbrella scheme for holistic\n\ndevelopment of agriculture and allied\n\nsectors.\n\n+ In 2017 the RKVY was rechristened\ninto Remunerative Approaches\nfor Agriculture and Allied sector\n\nRejuvenation (RKVY-RAFTAAR). ;\nNational institute of\n\n* Re-structured as RKVY Cafeteria Agricultural Extension Neteericueural bd\nScheme from 2022-23 onwards MQwagaco, Marketing (NIM)\nmerging some schemes of Department Hyderabad Joipur\nof Agriculture & Farmers Welfare.\n\nFund sharing:\n\n. Suowensiry\n»* 90:10 between Centre and States in SS\n\nrespect of North Eastern and Himalayan\nStates (aR!) Pusa, Science, Dharwad,\nNew Delhi Karnatak\n+ 60:40 between Centre and States for all en anne\nother states\n\nIndian Agricultural University of Assam Agriculture\nResearch Institute Agriculture University, Jorhat,\n\nAssam\n\n«The allocation for UTs will be 100% grant\n\nState Level Sanctioning Committee Meeting (SLSC): The funds are released to the State Governments/\nUTs on the basis of projects approved in the SLSC headed by the Chief Secretary of the concerned State.\n\nObligations for the states: States are mandated to fulfill certain conditions like\n* no deviation from the components/guidelines\n* Allocation and monitoring of resources for SC/ST/Women beneficiaries and maintaining database.\nInnovation & Agri-Entrepreneurship programme:\n+ Financial support is provided to entrepreneurs in the field of agriculture & allied sector to set up their\nstartups.\n@ Rs. 5.00 lakh is provided at the idea/pre seed stage and Rs. 25 lakh at the seed stage as grant-\nin-aid under the programme.\n© $0 far, more than 1500 Agri-Startups have been supported under this programme during FY\n2019-20 to 2023-24.\n+ DA&FW has selected 5 Knowledge Partners (KPs) as Centre of Excellence and 24 RKVYRAFTAAR\nAgribusiness Incubators (R-ABIs) from across the country to support agri-startups throughout the\ncountry.\n\nMajor schemes merged under RKVY cafeteria scheme\n\nSoil Health & Fertility: To promote soil test based Integrated Nutrient Management (INM) through\nconjunctive use of chemical fertilizers, organic fertilizers and bio-fertilizers.\n\nRainfed Area Development: Aims at promoting Integrated Farming System (IFS) with emphasis on multi\n\ncropping, rotational cropping, inter cropping, mix cropping\n\nParamparagat Krishi Vikas Yojana (PKVY):\n\n+ Financial support: States/UTs of the country are provided financial assistance of Rs. 50000/ha for 3\nyears.\n© Of this, Rs. 31000/ha/3 years is provided directly to farmers through DBT for on-farm and off-farm\n\norganic inputs.\n\n+ Participatory Guarantee System (PGS) Certification: To help commercial production of organic\nproducts, farmers are provided assistance for online PGS Certification.\n¢ National Centre for Organic and Natural Farming (NCONF) has a dedicated PGS secretariat to\n\nlook after authorization of Regional Councils (RCs) for facilitating the local groups to take up PGS-\nIndia certification.\n+ Bharatiya Prakritik Krishi Paddhati (BPKP): To promote natural farming and involve farmers on a\nlarger scale to undertake chemical free farming.\n© Itis proposed to cover 7.5 lakh ha. area by developing 15000 clusters across the country during\n2023-2024 to 2025-2026.\n\n© It is also proposed to establish 10,000 Bio-input Resource Center (BRC) across the country for\ncontinuous supply of cow dung and cow urine based bio-inputs like Jeevaamrit, Beejaamrit and\nGhanajeevaamrit etc.\n\nPer Drop More Crop: Focuses on enhancing water use efficiency at farm level through Micro Irrigation,\n\nnamely, Drip and Sprinkler Irrigation systems.\n\n+ Financial Assistance @ 55% for Small & Marginal farmers and @ 45% for other farmers is provided by\nthe Government for installation of Micro Irrigation.\n\n+ Further, 25% higher unit cost is taken into consideration for calculation of subsidy for the North Eastern\nand Himalayan states and 15% higher for States with low penetration of Micro Irrigation for larger\nadoption of Micro Irrigation systems by the farmers.\n\nAgroforestry: It is the rechristened version of the erstwhile Centrally Sponsored Scheme of Sub-Mission on\n\nAgro forestry (SMAF).\n\n+ Tenure: 2021-22 to 2025-26\n\n* Special focus: On production of certified Quality Planting Material (QPM).\n\n+ ICAR-Central Agro forestry Research Institute (CAFRI) is the nodal agency for providing technical\nsupport, capacity building, setting up of nurseries, production of QPM etc.\n\nAgriculture Mechanization (including Promotion of Agricultural Mechanization and Management of Crop\n\nResidue (CRM).\n\nCrop Diversification Programme: To divert the area of water intensive paddy crop to alternative crops like\n\npulses, oilseeds, coarse cereals, nutri cereals, cotton etc.\n\nVillage Haats & GRAAMS\n\n1.9.1. SOIL HEALTH CARD SCHEME\n\n1 Quick Facts\n\nPurpose: To facilitate farmers for better understanding of soil and Integrated Nutrient Management (INM)\nSubcomponent of: RKVY cafeteria scheme (Soil Health & Fertility component)\n\nSoil Health card (SHC): A printed report card issued to farmers once in three years indicating the status\nof his soil in terms of 12 parameters\n\nSHC Portal: Facilitates generation of SHCs in a uniform and standardized format.\n\nTo assist State Governments to issue soil health cards to all farmers in the country, so as to provide a\nbasis to address nutrient.\n\nTo develop and promote soil test based nutrient management in the districts for enhancing nutrient use\nefficiency.\n\nTo strengthen functioning of Soil Testing Laboratories (STLs) through capacity building, involvement of\nagriculture students and effective linkage with Indian Council of Agricultural Research (ICAR).\n\ngS} Salient Features\n\nBackground: SHC scheme was launched\n\n,\n\nJ\n\nin 2014-15 as a component of: National %.\nMission for Sustainable Agriculture (NMSA). 6 Micro - nvarlente: Zink 1 Secondary- nutrient:\nHowever, from 2022-23 the scheme is (2), iron (Fe), Copper Sulphur (s)\nmerged in Rashtriya Krishi Vikas Yojana (Cu), Manganese (Mn),\n(RKVY) cafeteria scheme. Boron (8)\n® Soil Health card (SHC): it indicates the status\nof soil in terms of 12 parameters (refer to the ny .\ninfographics). 3 Macro- nutrients: ° \"pr (Sot reocton,\n\n+ It is also accompanied by an advice Nitrogen (N), Acidity / Alkalinity),\non the various fertilizers and other soil Prosherou ‘Srgenic Carbon (oc)\namendments he is supposed to make.\n\n* It can be printed in various major\nlanguages and Dialects.\n\n® Soil Testing: Soil samples are tested as\n\nper the approved standards for all the 12\n\nparameters at:\n\n« $TLowned by the Department of Agriculture and by their own staff or by an outsourced agency.\n\n+  ICAR Institutions including KVKs and SAUs.\n\n+ laboratories of the Science Colleges/Universities by the students under supervision of a Professor/\nScientist.\n\n\nEnsuring quality of soil test: State Government is mandated to refer 1% of all the samples in a year to a\n‘Referral Laboratory’ to analyse and certify on the results of Primary Laboratory.\n« The State Government is also required to support the establishment of Referral Laboratories.\n\n* Village Level Soil testing Labs or Mini labs: Mini labs at village level is required to promote location and\ncrop specific sustainable soil health management.\n\n« They can be set up by individual entrepreneurs i.e, rural youth and community-based entrepreneurs\nie, SHGs, Farmers Producers Organisation (FPO), Schools, Agriculture Universities etc.\n\n* District level empowered committee (DLEC) is responsible to select beneficiaries/ entrepreneurs to\nrun Mini labs with the support from government\n\n« Payment Per Sample: Centre provides a sum of Rs. 190 per soil sample to State Governments to cover the\ncost of collection of soil sample, its test, generation and distribution of SHC to the farmer.\n+ There is no burden on farmer to generate Soil health card.\n® Technological interventions\n+ SHC Portal: It has been revamped and integrated with a Geographic Information System (GIS) system\nso that all the test results are captured and seen on a map.\n\n* Mobile Application: To ensure authenticity of sample collection and correctness of the information,\nSample tracking and alerts to farmers through SMS.\n\n1.10. OTHER SCHEMES/MISCELLANEOUS INITIATIV ‘\n\nNational ® eNAM is a_ pan-india\nAgriculture electronic trading portal C POP Dashboard\nMarket (e-NAM) which networks the existing\n\nAgricultural Produce\n\nMarket Committee @) Trading\n\n(APMC) mandis to create a\n\nunified national market for\n\nagricultural commodities.\n* Type: Central Sector\n\nscheme\n® Source of funding: Agri-\n\n—\nTech Infrastructure Fund\n(ATIF)\n® Nodal Implementing Warehousing\nagency: Small Farmers\n\nAgribusiness Consortium\n(SFAC)\n\nHp )roten\n® Platform of Platforms\n\n(Pop):\n\n+ It is an integration of fe\nAgri Advisory\nplatforms of various &)\n\nservice providers. (refer\nto the infographic)\n\n\nIntegrated\nScheme for\nAgricultural\nMarketing\nschemes\n(AGMARKNET)\nportal\n\nNational Mission\non Agricultural\nExtension and\nTechnology\n(NMAET)\n\n+ It facilitates farmers to sell the produce outside their state borders.\n\nFacilitates trade through e-NWR (Negotiable Warehouse Receipt)\n\nType: Central Sector Schemes\n\nObjectives: To develop agricultural marketing infrastructure for effectively\n\nmanaging marketable surplus of agriculture including horticulture and of allied\n\nsectors\n\nIt is a G2C e-governance portal for providing agricultural marketing related\n\ninformation from a single window.\n\nIt facilitates web- based information flow, of the daily arrivals and prices of\n\ncommodities in the agricultural produce markets spread across the country.\n\n5 components under two implementing agencies:\n\n« Directorate of Marketing & Inspection or DMI (a division of the ministry)\n¢ Agricultural Marketing Infrastructure (AMI) a sub scheme of Integrated\n\nScheme for Agricultural Marketing (ISAM)\n¢ Marketing Information Network (MRIN)\n® Strengthening of Agmark Grading Facilities (SAGF)\n\n+ SmallFarmers Agribusiness ConsortiumorSFAC (anautonomousorganization)\n\n¢  Agri-Business Development (ABD) through Venture Capital Assistance\n(VCA) and Project Development Facility (PDF)\n\n¢ Choudhary Charan Singh National Institute of Agriculture Marketing\n(NiAM)\n\nType: Centrally Sponsored Scheme\n\nObjective: To make the extension system farmer-driven and farmer-accountable\n\nby way of new institutional arrangements for technology dissemination.\n\nIt was introduced under the umbrella of Agriculture Technology Management\n\nAgency (ATMA).\n\nItinvolves a judicious mix of\n\n* extensive physical outreach and interactive methods of information\ndissemination, use of ICT, institution strengthening to promote mechanisation,\nand\n\n* Encourage aggregation of Farmers into Interest Groups (FIGs) to form Farmer\nProducer Organizations (FPOs).\n\nKey components\n\n* Sub Mission on Agricultural Extension (SMAE): It focuses on awareness creation\nand enhanced use of appropriate technologies in agriculture & allied sectors\n\n+ Sub Mission on Agricultural Mechanization (SMAM): Financial assistance is\nprovided for establishing ‘Custom Hiring Centres (CHCs)’ and ‘Hi-tech Hubs of\nHigh-Value Machines’.\n\n* Sub Mission on Seed and Planting Material (SMSP): To produce and supply\nquality seeds to farmers through Seed Village Programme, Establishment of\nSeed Processing- cum- Seed Storage Godowns, National Seed Reserve, etc.\n\n* Sub Mission on Plant Protection and Plant Quarantine (SMPP): Regulatory,\n\nsurveillance and capacity building functions to shield our bio-security from the\nincursion and spread of alien species\n\n\nFARMS-app * To help the individual farmers, rent their agricultural machinery & equipment and\n(Farm Machinery also facilitates sell and purchase of old agriculture machinery to farmers.\nSolutions-app)\n\nPradhan Mantri | «* Aim: To provide remunerative price to the farmers\n\nAnnadata Aay ® There are 3 components in the scheme. (Price Support Scheme, Private\n\nSanrakshan Procurement & Stockist Scheme (PPPS) and Price Deficiency Payment System)\n\nAbhiyan (PM-\n\nAASHA) PRICE SUPPORT SCHEME (PSS) ~\nPhysical procurement of pulses, oilseeds & Copra by Centre Nodal Agencies, Central Government to bear\nprocurement expenditure and loses due to procurement\n\nPRICE DEFICIENCY PAYMENT SCHEME (PDPS)\nTo cover all ollseeds for which MSP is notified. Farmers to get direct payment to the difference between MSP\n& selling price\nPILOT OF PRIVATE PROCUREMENT & STOCKIST SCHEME (PPPS)\nPrivate sector participations in procurement operation to be piloted. For ollseeds, states have the option to\ntoll out PPPS on pilot basis\n® States/UTs have an option to implement either PSS or PDPS with respect to\nparticular notified oilseeds in a given procurement season for the entire State.\nNOTE: Recently, Centre has removed the procurement ceiling of 40% on three pulses\n-tur, urad and masur- under the PSS for the 2023-24 in order to boost domestic\nproduction.\n* Thedecision assures the procurement of these pulses from farmers at MSP without\nceilings.\n\nNational ® Launched by: Indian Council of Agricultural Research (ICAR)\n\nInnovations on « Aim: to enhance resilience of Indian agriculture to climate change and climate\n\nClimate Resilient vulnerability through strategic research and technology demonstration.\n\nAgriculture\n\n(nrena)\n\nce\n[ mee mer | ( xeon ) ( Capacity Building ) (rmmmtcren|\nDern Grants\n\nAttracting and\nRetaining of Youth\nin Agriculture\n(ARYA)\n\n@ Toattractandempower the Youthin Rural Areas to take up various Agriculture, allied\nand service sector enterprises for sustainable income and gainful employment in\nselected districts.\n\nImplemented through Krishi Vigyan Kendra in one district from each State.\nAgricultural Universities and ICAR Institutes as Technology Partners.\n\n* In each district, 200-300 rural youths are identified for their skill development in\nentrepreneurial activities and establishment of related micro-enterprise units.\n\n*\n\n\nKrishi Vigyan KVK, is an integral part of the National Agricultural Research System (NARS).\nKendra (KVK) It is aimed at assessment of location specific technology modules in agriculture\nKnowledge and allied enterprises.\nNetwork The KVK scheme is 100% financed by Govt. of India and the KVKs are sanctioned\nto Agricultural Universities, ICAR institutes, related Government Departments and\nNon-Government Organizations (NGOs) working in Agriculture.\nActivities undertaken by KVKs\n+ On-farm testing of agricultural technologies\n« Frontline demonstrations\n+ Capacity development of farmers and extension personnel\n* To work as Knowledge and Resource Centre of agricultural technologies\n+ Provide farm advisories using ICT and other media means\nNational Aim: To develop resources and\nAgricultural mechanism for supporting\nHigher Education infrastructure, faculty and Support to Agricultural\nProject (NAHEP) student advancement, and\n\nFarmer\nFIRST (FARM,\nInnovations,\nResources,\nScience and\n\nTechnology)\n\nMera Gaon Mera\nGaurav\n\nproviding means for better =\n\nInvestments in ICAR for\ngovernance and management Leadership in Agricultural\nof agricultural universities. Higher Education\nExternal support: The project is\nproposed on 50:50 cost sharing Project Management\nbasis between the World Bank and Learning\n\nand the Government of India.\nImplemented at the Education\nDivision, ICAR.\n\nLaunched by: ICAR\n\nAim: Enhancing farmer-scientist interface for technology development and\napplication.\n\nIt will be achieved with focus on innovations, technology, feedback, multiple\nstakeholder's participation, multiple realities, multi method approaches, and\nvulnerability and livelihood interventions.\n\nLaunched by: ICAR-NAARM and IIM-A’s incubator centers\n\nAim: To scale-up Food & Agribusiness start-ups through rigorous mentoring &\ntraining of rural youth, industry networking and Investor pitching.\n\nAim: to promote the direct interface of scientists with the farmers to hasten the lab\nto land process.\n\nICAR has identified fifteen villages\n\nScientists of the ICAR and state agricultural universities provide information to\nthe farmers of selected villages on technical and other related aspects in a time\nframe.\n\n\nAgri-Market\nInfrastructure\nFund (AMIF)\n\nFund with a corpus of Rs. 2000 crore for developing and upgrading agricultural\nmarketing infrastructure in the 22000 Gramin Agricultural Markets (GrAMs) and\n\n585 Agricultural Produce Market Committees (APMCs).\n\n+ In these GrAMs, physical infrastructure is strengthened using MGNREGS and\nother Government Schemes.\n\n+ There is also a provision to link GrAMs with e~NAM and exempt them from APMC\nregulations.\n\n« GrAMs are expected to provide farmers facility to make direct sale to consumers\nand bulk purchasers with National Bank for Agriculture and Rural Development\n(NABARD).\n\nSince it is a demand driven scheme from the States/UTs, there is no State-wise and\n\nyear-wise allocation of the fund.\n\nStates may also access AMIF for innovative integrated market infrastructure\n\nprojects including Hub and Spoke mode and in Public Private Partnership mode.\n\nE-Krishi Samvad\n\nitis an online interface through which farmers and other stakeholders can directly\napproach ICAR (with their problems for effective solutions).\n\nThey can also upload photographs of crop diseases, animals or fishes for\ndiagnostics and remedial measures instantly from the specialists. Appropriate\nsolutions from specialists will be provided via SMS or through web.\n\ne-Rashtriya\nKishan Agri Mandi\n(e-RAKAM)\n\nHortinet - Farmer\nConnect App\n\nItis joint initiative of MSTC Ltd. (a Mini Ratna PSU under the administrative control of\nthe Ministry of Steel) and Central Railside Warehousing Company.\n\nitis an auction platform to help farmers get reasonable price for the produce and\nnot fall prey to middlemen.\n\nThe farmers are paid directly into their bank accounts.\n\nItis an integrated traceability system.\n\nDeveloped by: Agricultural and Processed Food Products Export Development\nAuthority (APEDA)\n\nDeveloped for: facilitating farm registration, testing and certification of Grape,\nPomegranate and Vegetables for export from India to the European Union in\ncompliance with standards\n\nMeghdoot app\n\nLaunched by: Ministry Agriculture in association with the Ministry of Earth Sciences\nDeveloped by:\n\n* India Meteorological Department\n\n« Indian Institute of Tropical Meteorology\n\n« Indian Council of Agricultural Research\n\nFunction: Provide location, crop and livestock-specific weather-based agro\nadvisories to farmers in local languages.\n\nThe information is not based on real time but updated twice a week.\n\nPandit Deen\nDayal Upadhyay\nUnnat Krishi\nShiksha Yojana\n(PpDuUKsSY)\n\nAim: to develop human resource in organic farming, natural farming and cow\nbased economy for environmental sustenance and soil health.\n\nTraining programmes for the farmers in the field of organic farming, natural\nfarming and other related latest technologies are organized.\n\n\nCentralized\n\nAim: To improve services of farm machinery testing institutions and bringing out\n\nFarm Machinery transparency in the entire process of testing and evaluation of machines.\nPerformance This portal facilitates manufacturers in applying, communicating and monitoring\nTesting Portal the progress of testing of their machines in a seamless manner.\n\nHorticulture Scheme: Central Sector Scheme\n\nCluster Aim: To improve exports of targeted crops by about 20% and create cluster-\nDevelopment specific brands to enhance the competitiveness of cluster crops.\n\nProgramme\n\nImplementing agency: National Horticulture Board (NHB)\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 2,
                "chapter_name": "2. MINISTRY OF AYUSH",
                "chapter_path": "./screenshots-images-2/chapter_2",
                "sections": [
                    {
                        "section_id": 2.1,
                        "section_name": "2. MINISTRY OF AYUSH",
                        "section_path": "./screenshots-images-2/chapter_2/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_2/section_1/e60a6638-ea02-4ba2-b9da-3048669c652b.png",
                            "./screenshots-images-2/chapter_2/section_1/85b646ac-307f-4fa9-85be-5eaff00ff6a5.png",
                            "./screenshots-images-2/chapter_2/section_1/29e32f66-490f-463e-af8d-a4041356409d.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "2.1. NATIONAL AYUSH MISSION (NAM) .\n\nQuick Facts\n\nType: Centrally Sponsored Scheme\n\nPurpose: Holistic wellness and “self-care” to reduce the disease burden\n\nAYUSH: Ayurveda, Yoga & Naturopathy, Unani, Siddha & Sowa-Rigpa and Homoeopathy.\nTenure: From 2015 to 2025- 2026\n\nove ©\n\nObjective\n\ni\n\nCost effective Ayush Services and support to cultivation of medicinal plants\n\nSetting up of clusters and development of infrastructure for entrepreneurs\n\nTo establish a holistic wellness model through AYUSH Health and Wellness Centres to reduce the out of\npocket expenditure.\n\nTo provide informed choice to the needy public through co-location of AYUSH facilities at PHCs, CHCs\nand DHs resulting in medical pluralism.\n\nTo emphasize the role of AYUSH in Public Health as per NHP 2017.\n\n> Sal\n\n® Ayush: It is an integral part of India’s rich cultural and healthcare\nheritage. These systems offer unique perspectives on health and\nwell-being, drawing from ancient wisdom and practices.\n\n® Background: Before the launch of NAM in 2014, initiatives to promote\nAyush were integrated with the National Rural Health Mission (NRHM).\n\n® Mandatory Components:\n« AYUSH Services: Providing cost effective AYUSH Services by\n\n® upgrading AYUSH Hospitals and Dispensaries,\n\n¢ Co-location of AYUSH facilities at Primary Health Centres\n(PHCs), Community Health Centres (CHCs), District Hospitals\n(DHs), and\n\n° setting up of 10 bedded/ 30 bedded/ 50 bedded Integrated\nAYUSH Hospitals,\n\n*\n\nnt Features\n\n\n¢ Operationalizing a network of AYUSH Health & Wellness Centres to provide services based on\nholistic wellness model embedded in AYUSH principles.\n\n» 12,500 AYUSH Health and = (A\n| Key activities funded under Flexible components )\n. 7\n\nWellness Centres (now named\nas Ayushman Arogya Mandir)\ncomponent of AYUSHMAN\nBHARAT will be implemented\nthrough NAM for a period of 5 Yoga Wellness Centres: Eligible | Tele-medicine, Sports Medicine\n\nfor Rs. LOO Lakh as one time through AYUSH, IEC activities,\nyears upto 2023-24, assistance for initial furnishing Incentive to trontine workers ot\n« AYUSH Educational institutions: and recurring assistance of AYUSH, Accreditation of AYUSH\nRs.6.00 Lakhs per annum for Healthcare facilities, etc.\n° To upgrade Government/ manpower, maintenance etc.\n\nGovernment Aided = AYUSH\nUG as well as PG Educational\nInstitutions.\n¢ To provide financial assistance to the states for establishment of new AYUSH colleges in the\nStates where availability of AYUSH teaching institutions is inadequate in Government Sector,\n* Flexible Component: Out of the total State envelop available, 25% of funds will be earmarked for flexible\nfunds.\n* Performance-based budgeting: 20% of total allocation of Flexipool budget may be allocated to good\nperforming States/UTs in the same proportion in which main budget of NAM is allocated.\n® Monitoring and Evaluation:\n« NAM web portal for submission of the State Annual Action Plans (SAAPs), Physical and financial\nprogress reports of approved activities, submission of UCs, etc.\n* States/UTs are required to report the physical and financial progress on monthly, quarterly and yearly\nbasis to the Ministry of Ayush.\n\n2.2. OTHER SCHEMES/INTIATIVE :\n\nScheme for Aim: Documentation of adverse effects and monitoring of safety and surveillance\npromoting of misleading advertisements of AYUSH drugs.\n\npharmacovigilance | type: Central Sector Scheme\nof AYUSH drugs\n\nFacilitate the establishment of three-tier network of Pharmacovigilance Centre\n(Pvcc) at national, intermediary, and peripheral level.\n\n+ All India Institute of Ayurveda, New Delhi, an autonomous body under the\nMinistry of AYUSH, has been designated as NPvCC.\n\n\nNational AYUSH\nGrid Project\n\nAim: Digitisation of service\ndelivery across the six\nfunctional areas.\n\nAyush Grid follows relevant\ndesign principles of\n\nIndia Enterprise\nArchitecture (IndEA) 2.0\nAyushman Bharat Digital\nMission (ABDM)\n\nNational Digital Health\nBlueprint (NDHB)\n\nKey projects undertaken so\nfar:\n\nMobile apps: Ayush\nSanjivani, Yoga locator\nCustomised IT courses: For\nAyush Professionals\n\nEducation and\nResearch\n\nDrug\n‘Administration\n\n4\n\nMedicinal\nPlants,\n\nAYUSH next: For information exchange with career guidance, interactive\n\nforum, quizzes, etc.\n\nAyush Clinical Case\nRepository (CCR)\nportal\n\nAim: To portray the strengths of AYUSH systems for treatment of various disease\nconditions.\n\nitis a portal to support both AYUSH practitioners and the public.\n\nThis portal facilitates posting of success stories/successfully treated cases by\nAyush practitioners.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 3,
                "chapter_name": "3. MINISTRY OF CHEMICALS &\nFERTILIZERS",
                "chapter_path": "./screenshots-images-2/chapter_3",
                "sections": [
                    {
                        "section_id": 3.1,
                        "section_name": "3. MINISTRY OF CHEMICALS &\nFERTILIZERS",
                        "section_path": "./screenshots-images-2/chapter_3/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_3/section_1/e87d231d-bdf0-4e8b-b2ff-a4aeede08ebc.png",
                            "./screenshots-images-2/chapter_3/section_1/91d45184-98fa-411f-a283-3dfcaa9cd0e0.png",
                            "./screenshots-images-2/chapter_3/section_1/bcbe5acb-6f76-4473-8f9e-c685232b6644.png",
                            "./screenshots-images-2/chapter_3/section_1/5e4c796c-caed-4923-9463-88aae1132f17.png",
                            "./screenshots-images-2/chapter_3/section_1/b7eff158-4b73-4aa2-a89e-1d23291fe648.png",
                            "./screenshots-images-2/chapter_3/section_1/e8802dcd-34f3-455a-88c6-0f64be19860d.png",
                            "./screenshots-images-2/chapter_3/section_1/fc5a2065-f896-4830-baf0-7bfa14e1fd69.png",
                            "./screenshots-images-2/chapter_3/section_1/3dcc7338-3137-4620-9b50-2450219573f0.png",
                            "./screenshots-images-2/chapter_3/section_1/5c885aa9-77f7-4de7-8c73-88852c91fd75.png",
                            "./screenshots-images-2/chapter_3/section_1/3fbdb00c-ef88-4826-9b0e-c0abbda98bcd.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "z\nc\n=|\ni\nm\nz\nS\ni]\n>\n\nQuick Facts\n\nSUBSIDY (NBS) SCHEME\n\nPurpose: To provide fertilizers to the farmers at the subsidized prices.\n\nType: Central Sector scheme\n\nInter- Ministerial Committee (IMC): Recommends per nutrient subsidy for ‘N’, '\n\nof the financial year.\n\n,\n\nfertilizers by rail and road is also provided\n\nObjective\n\ni\n\nFreight concession: In addition to NBS, freight for the movement and distribution of the decontrolled\n\nEnsuring Nation's food security, improving agricultural productivity and ensuring the balanced application\n\nof fertilizers.\n\nSalient Features\n\n|\n\nBackground: In 1992, Centre deregulated Phosphatic\nand Potassic (P&K) fertilizers, causing their prices to\nsurge.\n\n+ Consequently, farmers tended to overuse Nitrogen\n(N), whose price was still controlled. This created\nimbalance in soil nutrients (N, P, and K) leading to\nreduced soil productivity.\n\n+ To address this, the Department of Agriculture &\nCooperation introduced the Concession Scheme\nfor decontrolled P&K fertilizers on an ad-hoc basis\n(from 1992 to 2010).\n\n* In 2010, the Government introduced NBS scheme.\n\nNBS meaning: Instead of providing subsidies on\n\nfertilizers as a whole, subsidy is provided based on the\n\ncontents of the nutrients like nitrogen, phosphorus,\npotash, and sulphur, which are critical for plant growth.\n\nimproves soil Rotionalizes\nfertility and fertilizer use, and \\,\n\nenhances crop reduces fertilizer\nproductivity subsidy burden\n\ney\nBenefits of\nNBS scheme\n\nPromotes Reduces the\nsustainable overuse of certain\nagricultural fertilizers that can\npractices lead to\nenvironmental ,\ndegradation\n\nand ‘S’ before the start\n\n* NBS subsidy payment\n+ AnlInter- Ministerial Committee (IMC) recommends subsidy before the start of the financial year.\n* NBSis paid annually on each nutrient namely, ‘N’, ‘P’, ‘K’ and ‘S’ based on the recommendation of IMC.\n* The IMC also recommends a per tonne additional subsidy on fortified subsidized fertilizers carrying\n\nsecondary (other than ’s’) and micro-nutrients.\n\n* Subsidy for customized fertilizers: Manufacturers of customized fertilizers and mixture fertilizers are\neligible to source subsidized fertilizers from the manufacturers/ importers.\n+ There is no separate subsidy on sale of customized fertilizers and mixture fertilizers.\n\n© Direct Benefit Transfer (DBT): Subsidy is transferred to fertilizer companies through DBT, which is then\npassed on to farmers through reduced retail prices.\n\n© Integrated Fertilizer Monitoring System (iFMS): It captures end to end details of Fertilizer in terms of\nProduction, Movement, availability, requirement, Sale, Subsidy Bill Generation to Subsidy payment to\nfertilizer companies.\n\ncompanies under NBS\n|\n4 $\n\nies Obligations for The fertilizer\n|\n\nThey are required to print Maximum Companies are also mandated to _ ‘The companies shall also report\nRetail Price (MRP) along with submit the certified costdatain | | MRPs of P&K fertilizers regularly\napplicable subsidy on the fertilizer order to examine the | to Department of fertilizer.\nbags clearly. Any sale above the reasonableness of MRPs of P&K\nprinted MRP is punishable under the fertilizers.\nEssential Commodities Act, 1955.\n\n3.2. PRODUCTION LINKED INCENTIVE (PLI) \"Sg\nSCHEME FOR PHARMACEUTICALS\n\nQuick Facts\n\nType: Central Sector Scheme\n\nPurpose: To enhance India’s manufacturing capabilities in the pharmaceutical sector\nProject Management Agency: Small Industries Development Bank of India (SIDB!)\nTenure: FY 2020-21 to FY 2028-29\n\nTo create global champions out of India and thereby penetrate the global value chains.\n\nrf? ©\n\nSalient Features\n\n* Applicant: Both MSMEs as well as Non-MSMEs are covered under:\n* Proprietary Firm\n«Partnership Firm\n+ Limited Liability Partnership (LLP)\n\n- Eligible\n* Company registered in India Investment:\n® Product categories Expenditure\n* Category 1:  Biopharmaceuticals; % incurred on\nComplex generic drugs; Patented New plant, Construction\ndrugs; Orphan drugs; etc. pment of building\n+ Category 2: Active Pharmaceutical\nIngredients (APIs)/ Key Starting [7\nmaterials (KSM)/ Drug Intermediates Research and / /\n(Dis) except those covered under PLI covaaent// eas\n\nscheme for APis/KSMs and Dis\n\n» Category 3: Drugs not covered under\n\nCategory 1 and Category 2 including\ndrugs not manufactured in India\n\ne Financial incentive\n«+ It will be provided on the incremental sales over Base Year (FY 2019-20).\n* Tenure of incentive payment: Maximum 6 years\n© Rate of incentive:\n* Category 1 and 2: 10% initially, and to be successively reduced to 6%\n* Category 3: 5% initially, and to be successively reduced to 3%\n\n“Teenmology\n\nTransfer of\n{ __ (ToT)\n\n3.3. PL SCHEME FOR PROMOTION OF DOMESTIC MANUFACTURING OF\nCRITICAL KEY STARTING MATERIALS (KSMS), DRUG INTERMEDIATES\n(DIS) AND ACTIVE PHARMACEUTICAL INGREDIENTS (APIS)\n\nType: Central Sector Scheme\n\nPurpose: To attain self-reliance and reduce import dependence of critical KSMs/DIs/APIs\nProject Management Agency: Industrial Finance Corporation of India (IFC!) Ltd\n\nTenure: FY 2020-21 to FY 2029-30\n\nvee\n\nTo boost domestic manufacturing of identified KSMs, Dis and APIs by attracting large investments in the\nsector and reducing India’s dependence on import of key APIs.\n\nSalient Features\n\n|\n\n*\n\nBulk Drug or API: It is the chemical molecule in a pharmaceutical\nproduct that lends the product the claimed therapeutic effect.\nExample, penicillin.\n\n+ India imports around 70% of total imports of bulk drugs from |/{ | Fermentation Chemical\nbased products: | | synthesis based\nChina. Key products; products: Key\n\nNiche product Chemical; Other\nChemical\n\n°\n\nScope: Setting up of green field plants with minimum domestic\nvalue addition of 90% in four different target segments.\n\nEligible Investment: Expenditure incurred on new plant, machinery,\nequipment; Research and Development (R&D); Transfer of Technology (ToT); Product registration;\nConstruction of building.\nProduct categories: 41 products in four categories which cover all the identified 53 APIs.\nFinancial incentive\n+ It will be provided on the incremental sales over Base Year (FY 2019-20).\n+ Tenure of incentive payment: Maximum 6 years\n+ Rate of incentive:\n° For fermentation based products: 20% and initially, and to be successively reduced 5%.\n* For chemical synthesis based products: 10%.\n\n3.4. PLI SCHEME FOR PROMOTION OF DOMESTIC\nMANUFACTURING OF MEDICAL DEVICES\n\nQuick Facts\n\n® Type: Central Sector Scheme\n\n© Purpose: To ensure a level playing field for the domestic manufacturers of medical devices\n® Applicant: Any company registered in India committed for investment in a Greenfield Project\n@ Tenure: FY 2020-21 to FY 2027-28\n\nTo boost domestic manufacturing, attract large investment in the Medical Device Sector.\n\nSalient Features\n\nEligible investment: Expenditure incurred on\n\n+ New plant, machinery, equipment\n\n* Research and Development (R&D)\n\n+ Transfer of Technology (ToT)\n\n* Construction of building\n\nFinancial incentive\n\n+ Tenure of incentive payment: Maximum 5 years\n+ 5% of incremental sales over base year 2019-20.\n\n| Eligible Product: Four Target Segment|\n\no © 2\n\nCancer care/ Radiology & Imaging Anaesthetics & All Implants including\n\nRadiotherapy medical || medical devices and Cardio-Respiratory implantable\ndevices Nuclear Imaging medical devices electronic devices\ndevices\n\nTRENGTHENING PHARMACEUTICALS INDUSTRY (SPI) _=#\n\nQuick Facts\n\nINE\n\neee\n\nPurpose: To make India a global leader in Pharma Sector\n\nProject Management Consultant: SIDB! (Small Industries Development Bank of India)\nTenure: FY 21-22 to FY 25-26\n\nApproval of projects: By Scheme Steering Committee (SSC) chaired by the Secretary, DoP\n\n°\n\nTo strengthen the existing infrastructure facilities by provding financial assistance to pharma clusters\nfor creation of Common Facilities.\n\nTo upgrade the production facilities of Pharma units to meet up to date regulatory standards, by providing\nsubsidy on reimbursement basis, which will enable them to obtain revised Schedule M and WHO-GMP\ncertifications.\n\nTo promote knowledge and awareness in and about the Pharmaceutical and Medical Devices Industry\nby taking up studies, building databases and bringing industry leaders, academia and policy makers\ntogether.\n\nSalient Features\n\n.\n\nBackground: The Indian pharmaceutical industry is the world’s 3rd largest by volume and I4th largest in\nterms of value.\n\n« India has the second-highest number of US FDA approved plants outside the US.\n\nCommon facilities: All facilities intended for the shared use. Eg.: Common Testing Centres; Training\nCentres; R&D Centres; etc.\n\nComponents of the scheme\n\n°\n\nAssistance to Pharmaceutical Industry for Common Facilities (API-CF): To strengthen the existing\npharmaceutical clusters’ capacity for their sustained growth by creating common facilities.\n+ Beneficiaries:\n¢ Pharmaceutical manufacturing units in a cluster who have come together to form a Special\nPurpose Vehicle (SPV) to execute the project of developing common facility. There shall be a\nminimum of 5 pharma units as members of (SPV).\n\n¢ Pharma clusters promoted by the State Governments.\n\n+» Assistance: up to 70% of the approved project cost (90% for Himalayan and north-east region) or Rs\n20 crore, whichever is less.\n\nRevamped Pharmaceutical Technology Upgradation Assistance Scheme (RPTUAS): To facilitate existing\nPharma units to meet national and international regulatory standards including the Revised Schedule-M\n& WHO-GMP standards\n\n* Schedule-M of the Drugs and Cosmetics Rule, 1945 provides good manufacturing practices (GMP)\nfor pharmaceutical products.\n\n* Eligibility Criteria: Any pharmaceutical manufacturing unit that requires technology and quality\nupgradation and fulfils turnover criteria (refer to table on the next page).\n\n° Preference remains for MSMEs. Earlier the scheme covered only MSME pharmaceuticals.\n\nTurnover of the last three years Incentives\n\nLess than Rs 50 crore 20% of investment under eligible activities\n\nFrom Rs 50 crore to less than Rs 500 crore 15% of investment under eligible activities\nFrom Rs 50 crore to less than Rs 250 crore 10% of investment under eligible activities\n\n+ Eligible activities: Activities eligible for incentive include, water and steam utilities, testing laboratories,\nstability chambers waste management, etc.\n\n+ Flexible Financing Options: Emphasizes on a reimbursement basis subsidy over a traditional credit-\nlinked approach.\n\n* Allows integration with state government scheme: This provision will enable units to benefit from\nadditional top-up assistance.\n\n+ Enhanced Verification: Verification through a Project Management Agency for ensuring transparency,\naccountability and the efficient allocation of resources.\n\nPharmaceutical & Medical Devices Promotion and Development Scheme (PMPDS): To facilitate growth\n\nand development of Pharmaceutical and Medical Devices Sectors through study/survey reports,\n\nawareness programs, creation of database, and promotion of industry.\n\n\nSSISTANCE TO MEDICAL DEVICE CLUSTERS\n\nFOR COMMON FACILITIES (AMD-CF) SCHEME\n\noO Quick Facts\n\nPurpose: Promotes self-reliance in manufacturing of medical devices.\n\nTenure: 2023-24 to 2026-27\n\nComponents: Assistance for Common Facilities and Assistance for Testing Facilities\nProject Management Agency: SIDBI\n\nStrengthen Medical Device clusters by providing financial assistance and to strengthen and establish more\nTesting Laboratories for Medical Devices.\n\n> Salient Features\n\nTwo Components\n\nAssistance for Common Facilities: For Creating Common Infrastructure Facilities.\n+ Incentive\n© — Limit of support will be 70% of the approved project cost or Rs. 20 cr., whichever is less.\n\n¢ For Himalayan and North East Region States, grant-in-aid would be Rs. 20 Crore per Cluster or\n90% of the project cost, whichever is less.\n\n* Special Purpose Vehicle (SPV) to be formed by the Medical Devices manufacturing units in a cluster\nto execute the project.\n\n¢ There shall be a minimum of 5 Medical Device manufacturing units as members of SPV.\n° $tate Government can also promote a cluster.\n\n* Individual manufacturing unit cannot hold more than 40% in the SPV. Medical Devices enterprises\nshall hold at least 51% equity of the SPV.\n\nAssistance for Testing Facilities: To strengthen availability of more Medical Device Testing Laboratories\nin order to boost manufacturing of quality medical devices.\n\n+ Incentive\n¢ Limit of support will be 70% of the approved Testing Facilities project cost or Rs. 5 cr., whichever\nis less.\n\n© For Himalayan and North East Region States, grant-in-aid would be Rs. 5 Crore per Cluster or 90%\nof the project cost, whichever is less.\n\n+ Any National or State level Government or Private institutions interested to establish or strengthen\ntesting facilities for testing of Class A, B, C and D medical devices including in-vitro diagnostic medical\ndevices under MDR, 2017 are eligible.\n¢ Such legal entity under the Indian law will open a separate account for the funds to be utilized for\n\nthe projects assisted under the sub-scheme.\n\nNational Medical Devices Policy, 2023\n\nVision Strategy\nAccelerated growth path with a patient-centric | Regulatory Streamlining, Enabling\napproach. Infrastructure, Facilitating R&D and Innovation,\n\n® To emerge as the global leader in the| Attracting Investments in the Sector, Human\nmanufacturing and innovation of medical! Resources Development, Brand Positioning\ndevices by achieving, 10-12% shares in the| | and Awareness Creation.\nexpanding global market over the next 25\nyears.\n\ne To help the Medical Devices Sector grow from\npresent $11 Bn to $50 Bn by 2030.\n\nPRADHAN MANTRI BHARATIYA JAN ‘.\nAUSHADHI PARIYOJANA (PMBJP) SCHEME\n\nQuick Facts\n\nPurpose: To provide quality generic medicines at affordable prices to the masses\nType: Central Sector Scheme\n\nRetail outlet: PMBJP Kendra to sell affordable generic medicines to all citizens.\nImplementing Agency: Pharmaceuticals & Medical Devices Bureau of India (PMBI)\n\neer? @\n\nObjective\n\ni\n\n*\n\nExtend coverage of quality generic medicines so as to reduce the out-of-pocket expenditure on medicines\nand thereby redefine the unit cost of treatment per person.\n\nCreate awareness about generic medicines through education and publicity to counter the perception\nthat quality is synonymous with high price.\n\nGenerate employment by engaging individual entrepreneurs in opening of PMBJP Kendras.\n\n°\n\nalient Features\n\n|\n\n® Background: In 2015, the ‘Jan Aushadhi Scheme’ was revamped as ‘Pradhan Mantri Jan Aushadhi Yojana’\n(PMJAY) which was again renamed as PMBJP in 2016.\n® Incentive to the PMBJP Kendra owners\n+ Rs. 5 Lakh, to be given @ 15% of monthly purchases made, subject to a ceiling of Rs. 15,000/- per\nmonth, w.e.f. April 2021\n\n« Additional one-time special grant of up to Rs. 2 lakh for Furniture & IT Equipment to PMBJP Kendras for\nwomen, Divyang, SC/ST and Areas notified by NITI Aayog (North-Eastern States, Himalayan Region,\nIsland Territories, Aspirational Districts).\n\n® Product basket of PMBJP\n\n+ It comprises various Ayurvedic products for immunity boosting medicines and surgical devices\ncovering all major therapeutic groups such as Cardiovascular, Anti-cancer, Anti-diabetics, Anti-\ninfective, Anti-allergic etc.\n\nEnsuring quality:\n\n* Medicines are procured only from World Health Organization - Good Manufacturing Practices (WHO-\nGMP), Food Safety and Standards Authority of India (FSSAI) and CE Certified suppliers.\n\n* Drug is accredited by ‘National Accreditation Board for Testing and Calibration Laboratories’ (NABL).\n* Regular comparison with popular branded medicines in terms of assay & solubility etc.\n+ SAP based Inventory Management and Forecasting System.\n* System of Blacklisting/Debarring Vendors/ Suppliers/ Manufacturers for failure in supply, also penalty\nis imposed for late delivery.\n® PMBI: It is set up by pharma PSUs as an independent society under the Societies Registration Act, 1860.\nKey Initiatives under the scheme\n* Janaushadhi ‘Suvidha’ Sanitary Napkins: Napkins are provided @ Rs. I/- per pad and aims to achieve\n“Clean India & Green India’, as these pads are oxo-biodegradable and environment friendly.\n\n«* Jan Aushadhi Sugam App: Facilitates locate nearby Jan Aushadhi Kendra through Google map, search\nJan Aushadhi generic medicines, etc.\neeceo\n\n3.8. OTHER SCHEMES/MISCELLANEOUS INITIATIVE\n\nPromotion of Bulk Aim: To develop 3 mega Bulk Drug parks in India in partnership with States.\n\nDrug Parks © Type: Central Sector Scheme\n\nIn-principle approval has been granted to Himachal Pradesh, Gujarat and Andhra\nPradesh for setting up bulk drug park.\n\n® Such parks will provide Common Infrastructure Facilities (CIF)at one place thereby\ncreating a robust ecosystem for manufacturing.\n\nTenure: From FY 2020-2021 to FY 2024-2025.\n\nFinancial assistance:\n\n* 70% of the project cost in Gujarat and Andhra Pradesh\n\n+ 90% of the project cost in Himachal Pradesh\n\n+ Maximum assistance for one Park would be limited to Rs. 1000 crores.\n\nPromotion of Aim: Creation of world class common infrastructure facilities for increased\nMedical Device competitiveness and optimization of resources and economies of scale.\n\nParks * Type: Central Sector Scheme\n\nTenure: FY 2020-2021 to FY 2024-2025\n\nApproval for financial assistance has been given to Uttar Pradesh, Tamil Nadu,\nMadhya Pradesh and Himachal Pradesh for establishing Medical Device Parks.\n\n\nUrea Subsidy\n\n® Such parks will provide Common Infrastructure Facilities (CIF) at one place thereby\ncreating a robust ecosystem for manufacturing.\n\nFinancial assistance:\n+ 70% of the project cost in Uttar Pradesh, Tamil Nadu, Madhya Pradesh\n* 90% of the project cost in Himachal Pradesh\n* Maximum assistance for one Park would be limited to Rs. 100 crores.\nAim: To ensure timely and easy availability of urea fertilizers at affordable prices.\nType: Central Sector Scheme\n\nSubsidised Urea: Farmers are provided subsidized urea at a statutorily notified\nMaximum Retail Price (MRP).\n\nFreight cost: Subsidy also incorporates cost of freight movement across the\ncountry.\n\nDirect Benefit Transfer (DBT): Only upon the sale getting registered on the e-Urvarak\nDBT portal a company claim subsidy.\n\nAuthentication of beneficiaries: Either Aadhaar or Kisan Credit Card number is\nmandatory\n\nNew Schemes of\nPetrochemicals\n\nPM Programme for Restoration, Awareness Generation, Nourishment and\nAmelioration of Mother — Earth (PM-PRANAM) was announced in the 2023-24\nBudget.\nKey highlights\n* Goal: To address a pressing issue — the excessive use of chemical fertilizers\nand pesticides in agriculture.\nObjective: To incentivize States/ UTs to promote alternate fertilizers and\nbalanced use of chemical fertilizers.\n\nTenure: 3 years (FY. 2023-24 to FY 2025-26)\n\nIncentive to state: 50% of the fertilizer subsidy saved by a State/UT ina particular\nfinancial year by way of reduction in consumption of chemical fertilizers (Urea,\nDAP, NPK, MOP) compared to previous 3 years’ average consumption, will be\npassed on to that State/UT as Grant.\n\nKey initiatives under the scheme include\n\n® Setting up of dedicated Plastic Parks in the field of petrochemicals and setting up\nof Centres of Excellence (CoE) in Polymer Technology.\nChemical Promotion and Development Scheme (CPDS) will be subsumed under\nthe NPS from FY 2023-24.\n« The scheme envisages creating awareness and dissemination of information\nfor promotion and development of chemical and petrochemical industry.\n\nPharma Jan\nSamadhan\n\nA web enabled system for redressal of consumers’ grievances relating to pricing\nand availability of medicines.\n\nFacilitates effective implementation of the Drugs (Price Control) Order 2013.\n\n‘Pharma\nSahiDaam’ Mobile\nApp\n\nIt shows the MRP fixed by National Pharmaceutical Pricing Authority (NPPA) for\nvarious scheduled drugs on real time basis.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 4,
                "chapter_name": "4. MINISTRY OF CIVIL\nAVIATION",
                "chapter_path": "./screenshots-images-2/chapter_4",
                "sections": [
                    {
                        "section_id": 4.1,
                        "section_name": "4. MINISTRY OF CIVIL\nAVIATION",
                        "section_path": "./screenshots-images-2/chapter_4/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_4/section_1/296ddcd8-ff48-499b-bcff-7240a07df016.png",
                            "./screenshots-images-2/chapter_4/section_1/9e090633-5eae-4283-b9db-66f4990538c8.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "4.1. UDE DESH KA AAM NAAGRIK (UDAN)/ ™g\nREGIONAL CONNECTIVITY SCHEME (RCS)\noo Quick Facts\n\n© Purpose: To enable air operations on underserved / unserved routes, promote balanced regional growth\nand make flying affordable for masses\n\nType: Central Sector Scheme\nSupport to airlines: In the form of Concessions and Viability Gap Funding (VGF)\nTenure: 10 years\n\nTo fulfil the aspirations of the common citizen with an enhanced aviation infrastructure and air connectivity\nin tier Il and tier Ill cities.\n\nSalient Features\n\nBackground: Launched under National Civil Aviation Policy (NCAP) 2016.\n\n* NCAP envisaged Regional Connectivity Scheme (RCS) to enhance regional air connectivity through\nfiscal support and infrastructure development.\n\nSubsidised seats\n\n+ Airfare is capped at Rs. 2500 for a distance of 500 km to 600 km per seat. However, the capping is\nsubject to indexation as per the formula specified in the UDAN Scheme document.\n\n+ Airlines have to provide 50% of the seats (9- 40 Seats) at subsidized rates.\n\nRegional Connectivity Fund (RCF): It facilitates the self-financing mechanism of the scheme by funding\nthe VGF through a levy on certain domestic flights.\nDemand and market-based model:\n\n@\n\ne\n\n*\n\n+ RCSis available only in States and at airports/aerodromes/helipads which provide concessions.\n\n* State governments have to provide free security & fire service, utilities at concessional rates, free\nland for RCS airports etc.\n\nSupport to airlines: Centre shares 80% of the VGF, and rest 20% comes from the respective state\n\ngovernments (NE states, UK, HP and UTs will contribute 10%).\n\nFlexibility for identification of Routes: Airline operators propose the regional routes that they are interested\n\nto operate and seek VGF.\n\nLifeline UDAN\nWith the advent of COVID-19, Lifeline UDAN was\nconceptualized to aid India in its fight against the\n\nKrishi UDAN\nSt. To assist farmers in transporting agricultural\n\nInitiatives products so that t improves ther’ Value realization’,\nunder UDAN especially in the north-east and tribal districts.\n\nInternational Air Connectivity Scheme (IACS)\n\nPh a MoCA developed the IACS to address State\nGovernments’ requests for assistance in establishing\ninternational airport connectivity.\n\nDigi YATRA © It facilitates paperless travel and avoids identity checks at multiple points in an\nproject airport.\n® Each passenger would get a unique Digi Yatra ID.\nItis voluntary in nature.\n© Digi Yatra Foundation (DYF) has been set up as a joint venture company for\ncreating the Digi Yatra Central Ecosystem.\nNABH (Nextgen Aim: to establish about 100 airports in 10-15 years\nAirports for PPP: A large percentage of the investment is to come from the private sector.\n\nBharat)\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 5,
                "chapter_name": "5. MINISTRY OF COAL",
                "chapter_path": "./screenshots-images-2/chapter_5",
                "sections": [
                    {
                        "section_id": 5.1,
                        "section_name": "5. MINISTRY OF COAL",
                        "section_path": "./screenshots-images-2/chapter_5/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_5/section_1/d4b71702-f7d4-4477-8c54-49ac883d3ad9.png",
                            "./screenshots-images-2/chapter_5/section_1/b0ea6651-1d90-49ef-b734-6f623fe53817.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "SHAKTI (Scheme\nfor Harnessing\nand Allocating\nKoyala\nTransparently in\nIndia) Policy\n\n1. OTHER SCHEMES/INITIATIVES _@\n\nAim: To ensure the availability of coal to all the thermal power Plant in transparent\nmanner and transfer the benefits of linkage coal to the end consumers.\n\n© Phase out erstwhile Letter of Assurance (LoA)-Fuel Supply Agreement (FSA) regime.\n\nProvides for coal linkages or coal allocation through auctions to the power plants\nwhich do not have linkage or lack FSAs through coal auctions.\n\n@ Helps the generators to get cheaper coal and thereby reduction in cost of\ngeneration.\n\nCoal Distribution Policy (NCDP), 2007 governs Coal linkage to the power sector.\nKey beneficiaries and benefits:\n\n* Power companies (assured coal supply)\n\n« Consumers (reduced cost of power)\n\n* Indigenous Coal Sector (reduction in Imported coal)\n\n+ Banking Sector (reduced NPAs)\n\nUTTAM (Unlocking\nTransparency By\nThird\n\nParty Assessment\nOf Mined Coal)\nApp\nCoal Mine\nSurveillance and\nManagement\nSystem (CMSMS)\n\nKhan Prahahri\n\n© Developed by the Ministry of Coal and Coal India Limited (CiL).\nEnables citizens and coal consumers to monitor the process of Third-Party\nSampling of coal across CIL subsidiaries.\n\n® It has interactive map-based view to provide holistic coverage of coal quality\nacross subsidiaries.\n\nitis a web-based GIS application through which location of sites for unauthorised\nmining can be detected.\n\nThe basic platform used in the system is of Ministry of Electronics & Information\nTechnology's (MeiTY) map which provides village level information.\n\nitis a tool for reporting any activity taking place related to illegal coal mining like\nrat hole mining, pilferage, etc.\n\n* One can upload geo-tagged photographs of the incident along with textual\ninformation directly to the system.\n\nThe identity of the complainant shall not be revealed.\n\nPRAKASH (Power\nRail Koyla\nAvailability\nthrough Supply\nHarmony)\n\nAim: Bringing better coordination for coal supplies among all stakeholders viz -\nMinistry of Power, Ministry of Coal, Coal India, Railways and power utilities.\n\n* Help in mapping and monitoring entire coal supply chain for power plants, viz:\n* Coal Stock at supply end (mines)\n+ Coal quantities/ rakes planned\n\n\n+ Coal quantity in transit and\n+ Coal availability at power generating station\n\nExploration of\nCoal and Lignite\nscheme\n\nThe Cabinet approved the continuation of the Central Sector Scheme “Exploration\nof Coal and Lignite scheme”\n\n+ It will run from 2021-22 to 2025-26.\nAbout Exploration of Coal and Lignite Scheme\n\n« €xploration for Coal and Lignite is conducted in two broad stages: Promotional\n(Regional) Exploration and Detailed Exploration in Non-Coal India Limited\nblocks.\n\n«Importance: It proves and gives estimated coal resources available in the\ncountry which helps in preparing detailed project report to start coal mining.\n\n* TheGeological reports prepared through these exploration is used for auctioning\nnew coal blocks.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 6,
                "chapter_name": "6. MINISTRY OF\nCOMMERCE & INDUSTRY",
                "chapter_path": "./screenshots-images-2/chapter_6",
                "sections": [
                    {
                        "section_id": 6.1,
                        "section_name": "6. MINISTRY OF\nCOMMERCE & INDUSTRY",
                        "section_path": "./screenshots-images-2/chapter_6/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_6/section_1/f345824d-d41f-4ad0-a830-3503a04dcf07.png",
                            "./screenshots-images-2/chapter_6/section_1/dabef478-da3a-4601-b830-cb0dbef0da1b.png",
                            "./screenshots-images-2/chapter_6/section_1/ec3110cc-4f3f-48bc-aee7-f96d15efdc48.png",
                            "./screenshots-images-2/chapter_6/section_1/d3660d10-0f1b-4648-802a-9c353c65d737.png",
                            "./screenshots-images-2/chapter_6/section_1/162e7a36-96e0-49a1-9706-235a3b4b069b.png",
                            "./screenshots-images-2/chapter_6/section_1/e2558abd-6f4f-4036-aaf7-e5ff468e3233.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "PLI FOR WHITE GOODS (AIR CONDITIONERS .\nAND LED LIGHTS) MANUFACTURERS IN INDIA\n\no Quick Facts\n\nType: Central Sector Scheme\n\nPurpose: To attain self-reliance and reduce import dependence of white goods\nImplementing Agency: Department for Promotion of Industry and Internal Trade (DPIIT)\nTenure: FY 2021-22 to FY 2028-29\n\nBoost domestic manufacturing and attract large investments, removing sectoral disabilities, creating\neconomies of scale, enhancing exports in white goods.\n\n> Salient Features\n\n* Scope\n* Companies making brown field or green field Investments for manufacturing in target Companies.\n\nee @\n\n{ Eligible Investment\n\nTarget segments under || Target segments under Mere assembly of\n\n‘AC: Air conditioners; High || LED:LED lighting products; || finished goods shall not\nvalue intermediates and and Components of LED be incentivizer\n\nLow value intermediates _} | lighting products\n\n* Financial incentive\n+ Anincentive of 4% to 6% on incremental sales (net of taxes) over the base year 2019-20.\n+ Tenure of the incentive: 5 years subsequent to the base year and one year of gestation period.\n\n* Scheme is Fund Limited i.e. the total pay-out of incentives would be capped at the amount approved\nby Cabinet.\n\n* Monitoring: By the Empowered Group of Secretaries (EGoS) chaired by Cabinet Secretary.\n\n\nSTARTUP INDIA —_%\n\n® Type: Central Sector Scheme\n\n® Purpose: Nurturing innovation and startups\n\n© Implementing agency: Department for Promotion of Industry and Internal trade (DPIIT)\n* Exclusion: An entity formed by splitting up or reconstruction of an existing business.\n\nTo catalyse startup culture and build a strong and inclusive ecosystem for innovation and entrepreneurship\nin India.\n\nSalient Features\n\nEligibility for start up\n\n» Registered as Private » Turnover: Less than Rs. » Function: innovation/ » Exclusion: An entity\nLimited Company or 100 Crores in any of the improvement of existing formed by splitting up\n@ Partnership firm or a previous financial year products, services and ‘of reconstruction of an\nLimited Liability Partnership || » Age: Up to 10 years from the|| processes and should have || existing business shall not\n(uP) date of its incorporation the potential to generate be considered a “Startup”\nemployment/ create wealth\n\n® Benefits to startups: Tax incentives\nincluding capital gains tax exemption, Funding & Incentives\nGovernments’ assistance in funding,\nprioritisation of startups in public\nprocurement, etc.\n\n© Key Pillars of Support for Start up Exemptions on Fund of Funds witha || Credit Guarantee\n+ Self-certificate to reduce the | | eligible startups SIDBI.\nregulatory burden\n« Easier compliance, easier exit process for failed startups, legal support, fast tracking of patent\napplications\n+ Awebsite to reduce information asymmetry\nIncubation & Industry-Academia Partnerships\n+ Creation of numerous incubators and innovation labs, events, competitions and grants.\n\n* Launch of Atal Innovation Mission (AIM) with Self Employment and Talent Utilization (SETU) Program of\nNITI Aayog\n\n\nNOTE: Fund of Funds means government participates in the capital of SEBI registered Alternate Investment\nFunds (AIFs), known as daughter funds, who in turn invest in Indian startups through equity/equity-linked\n\ninstruments.\n\n6.3. OTHER SCHEMES/INITIATIVE\n\nStartup India .\nSeed Fund .\nScheme (SISFS)\n\n.\n\nLaunched in: 2021\nIt provides financial assistance to eligible startups through eligible incubators\n* Start-ups can avail up to 270 lakh\n\n* Incubators can avail up to #5 crore\n\nFinancial assistance is provided for Proof of concept; Prototype development;\nProduct trials; Market entry; and Commercialization\n\nEligibility for Startups Eligibility for Incubators\nRecognised by the DPIIT. e Alegalentity (asociety,a trust, private\nNot more than 2 years old. limited company, or a statutory\n\nbody).\n\nMust not have received more than\nRs 10 lakh of monetary support|* Operational for at least 2 years.\n(excluding prize money) from the Must have facilities to seat at least 25\ncentral/ state governments. individuals.\n* Must have at least 5 startups\nundergoing incubation physically.\n\n°\n\nPreferred sectors: Social impact, waste management, water management,\nfinancial inclusion, etc.\n\nBenefits: Enables start-ups to raise investments from angel investors or venture\ncapitalists, or seek loans.\n\nOne DistrictOne |e\nProduct (ODOP) |,\n\nAim: foster balanced regional development across all districts of country.\n\nTo select, brand, and promote One Product from each District of country for\nenabling holistic socio-economic growth across all regions.\n\n+ DOP was first launched in Uttar Pradesh to create product- specific traditional\nindustrial hubs across 75 districts of the state.\n\nRecently, digital version of ODOP gift catalogue was launched.\n\nTrade\nInfrastructure for |,\nExport Scheme\n\n(TIES) e\n\n°\n\nType: Central Sector Scheme\n\nAim: Assisting Central and State Government agencies in the creation of appropriate\ninfrastructure for growth of exports.\n\nTenure: FY 2021-22 to FY 2025-26\n\nScope: Up-gradation of infrastructure projects with overwhelming export linkages\nlike the Border Haats, Land customs stations, quality testing, etc.\n\nExclusion: Projects which are covered under sector specific schemes like textiles.\nFinancial assistance: The Central Government assistance for infrastructure\ncreation will be in the form of grant-in-aid subject to a ceiling of Rs 20 Cr for each\ninfrastructure project.\n\nChampion © Type: Central Sector Scheme\nServices Sector | im: To support initiatives for sectoral Action Plans of the Champion Sectors.\nScheme (csss) * A dedicated fund of Rs. 5000 crores have been approved to support initiatives of\nthe Champion Sectors.\n* It facilitates addressing cross cutting issues including domestic regulatory\nreforms.\nG\nServices yy)\nInformation\nTechnology (IT) & IT\nenabled Services\nI2identified Css\nFinance Services\n‘Construction and\nAudio Visual Servic Related Engineering\nServices\n‘Communication\n* 5 pillars for identifying new\ninitiatives for the scheme\n« Newprocesses: For improving Ease of Doing Business (EoDB)\n« Newinfrastructure: For strengthening physical and digital connectivity\n* Newsectors: Sectors with untapped potential\n* New mindset: From issuing/approval authority to partnership in business\n+ New standards: For shaping global trade in services\nNiryat Bandhu * Itwas launched to reach out to the new and potential exporters including exporters\nScheme from MSMEs and mentor them through orientation programmes, counselling\n\nNational\nIntellectual\nProperty\nAwareness\nMission (NIPAM)\n\nsessions, individual facilitation, etc.\nImplementing Agency: Intellectual Property Office, the Office of Controller General\nof Patents, Designs and Trade Marks (CGPDTM)\n\nIt has achieved target of imparting Intellectual Property (IP) awareness and basic\ntraining to 1 million students a month ahead of deadline which was August 2022.\n\n“SWAYATT’\n\ninitiative\n\nSWAYATT is an initiative to promote Start-ups, Women and Youth Advantage\nThrough eTransactions (SWAYATT) on Government e Marketplace (GeM).\n\nNorth-East\nIndustrial\n\nDevelopment\nScheme (NEIDS)\n\nAim:To promote industrialization in NE States and to boost employment and income\ngeneration.\n\nSectors covered: Manufacturing and Services\nUse of Technology: To process and approve proposals and release of\n\n\nCentral Capital\nInvestment incentive\nfor access to credit\n\nwomen incentive Central interest\n\n@e\n\nIncentive (Cll)\n\nKey Benefits ; =\nEmployment underNEIDS | Comprehensive\n\nIncentive (E1) Insurance incentive\n(con) }\n\n| Goods and Services Income Tax ((T) |\n\nTax (GST) Reimbursement\nReimbursement\n\nTransport and\nMarketing\nAssistance (TMA)\nfor specified\nagriculture\nproducts scheme\n\nIndian Footwear\nand Leather\nDevelopment\nProgramme\n(IFLDP)\n\nRemission of\nDuties and Taxes\non Exported\nProducts\n(RoDTEP) Scheme\n\n* Aim: To provide assistance for the international component of freight and\nmarketing of agricultural produce and to promote brand recognition.\n\n* Expected benefit: Mitigation of disadvantage of higher cost of transportation due\nto trans-shipment.\n\nCoverage: All exporters duly registered with relevant Export Promotion Council.\n\nType: Central Sector Scheme\nTenure: Upto 2026\n\n%)\n\nSustainable integrated Mega Leather vena of || Establishment of\nTechnology and Development of Footwear and rorraman Design Studios institution\nEnvironmental Leather Sector Accessories Facilities (EF)\nPromotion (STEP) (ices) Cluster\n\nDevelopment\n(waFAcD)\n\nRoDTEP aims to reimburse the taxes and duties incurred by exporters such as local\ntaxes, coal cess, mandi tax etc., which are not getting exempted or refunded under\nany other existing scheme.\n\nIt ensures zero rating of exports i.e, taxes and duties should not be exported.\n\nIt replaces erstwhile Merchandise Export from India Scheme (MEIS) and Rebate of\n\nState and Central Taxes and Levies (RoSCTL).\n\n+ MEIS violated the provisions of WTO by giving export subsidies for a wide range\nof goods.\nROSCTL was offered for embedded state and central duties and taxes that are\nnot refunded through goods and services tax (GST).\n\nAdvance\nAuthorisation\nScheme\n\nDirectorate General of Foreign Trade (DGFT) implements Advance Authorisation\nScheme under the Foreign Trade Policy.\n\nAdvance Authorisation Scheme allows duty free import of inputs, which are\nphysically incorporated in an export product.\n\nIn addition to any inputs, packaging material, fuel, oil, catalyst which is\nconsumed / utilized in the process of production of export product, is also\nallowed.\n\nAdvance Authorisation covers manufacturer, exporters or merchant exporters\ntied to supporting manufacturer(s).\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 7,
                "chapter_name": "7. MINISTRY OF\nCOMMUNICATIONS",
                "chapter_path": "./screenshots-images-2/chapter_7",
                "sections": [
                    {
                        "section_id": 7.1,
                        "section_name": "7. MINISTRY OF\nCOMMUNICATIONS",
                        "section_path": "./screenshots-images-2/chapter_7/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_7/section_1/206d0efd-1788-417b-8f77-3c0c6b74d55f.png",
                            "./screenshots-images-2/chapter_7/section_1/5fdeb340-94b0-42cb-b1d0-c11cffa3ec48.png",
                            "./screenshots-images-2/chapter_7/section_1/82156347-ee93-4007-a6c9-2da032e50d1f.png",
                            "./screenshots-images-2/chapter_7/section_1/d674009b-f638-40c0-958b-0c828703e4ba.png",
                            "./screenshots-images-2/chapter_7/section_1/a74f0cb1-be49-47f0-8b44-3a17de67949c.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "7.1.BHARATNET _\n\nQuick Facts\n\nPurpose: Providing the last mile connectivity to all Gram Panchayats (GPs) of the country.\nType: Central Sector Scheme\n\nFunding: Universal Service Obligation Fund (USOF)\n\nImplementing Agency: Bharat Broadband Network (Merged into BSNL in 2022)\n\nove ©\n\nObjective\n\ni\n\nTo provide 100 Mbps bandwidth broadband connectivity to all Gram Panchayats (approx. 2.6 lakh) in the\ncountry to realise the vision of Digital India.\n\nBE) se\n\n® Background:\n\nnt Features\n\n3 Phases of BharatNet\n\n(NOFN, now Bharat Net) established ||mix of media (OFC, Radio and satellite)\nfor connecting block headquarters to || to connect GPs. Multiple implementing\nGPs by using existing fibre of CPSUs || models like State-led Model, Private\nsuch as BSNL, RailTel and PGCIL. Sector Model and CPSU Model.\n\n* Current Status: 3 phases to be implemented by 2025 and status of different phases are as follows:\n+ Phase 1: Out of 1.23 lakh allotted GPs, 1.22 were made service ready.\n* Phase 2: Out of 1.44 lakh allotted GPs, more than 71, 000 were made service ready.\n* Approach:\n+ Tie-up with Village level entrepreneurs (VLEs) or BharatNet Udyami to take the fiber connections to\nthe homes on a 50:50 revenue-sharing basis.\n+ VLEs will be provided with the necessary equipment, including routers and additional fiber optics cable\nby BBNL\n\nSatellite connectivity: GSAT-11 and GSAT-19 under BharatNet project to provide connectivity to about\n\n6700 GPs/areas which were not accessible through other mediums.\n\nOther features:\n\n« Project of national importance: Network would remain a National Asset. Operation and Maintenance\ncould be taken up by the States.\n\n+ Leveraging private sector: PPP Model for operation, maintenance, utilization and revenue generation.\n\n+ Now the emphasis is to utilize the created infrastructure for broadband/internet services through Wi-\nFi Hotspots, Fibre to the Home (FTTH) connections, etc.\n\nOther benefits: Facilitate delivery of e~governance, e-health, e-education, e-banking, public internet\naccess, G2C, B2B, P2P, B2C, etc.,, weather, agricultural and other services to rural India.\n\n7.2. PLI SCHEME FOR PROMOTING .\nTELECOM & NETWORKING PRODUCTS\n\n@) Quick Facts\n\n© Type: Central Sector Scheme\n\n* Purpose: to create a robust domestic value chain in India.\n\n* Implementing agency: Small industries Development Bank of India (SIDBI)\nTenure: Investment from 2021 up to Financial Year 2024-2025 only\n\nProvides financial incentive to boost domestic manufacturing and attract investments in the target segments\nof telecom and networking products to encourage “Make in India”.\n\nalient Features\n\n* Scope: Support under the Scheme shall be provided only to companies for manufacturing of goods in\nIndia.\n\nEligible Investment: Expenditure incurred segments like\nx\n\nNew plant, machinery,\nequipment\nK\n\n(R&D) (installation and erection of\n\nResearch and Development || Transfer of Technology (ToT) || Expenditure on civil works\n_) \\ plant, machineries, etc,)\n\n« Target Segments\n« Core Transmission Equipment\n\n+ 46/56, Next Generation Radio Access Network and Wireless Equipment\n\n« Access & Customer Premises Equipment (CPE), Internet of Things (loT) Access Devices and Other\nWireless Equipment\n\n« Enterprise equipment: Switches, Routers\n» Any Other Product: As decided by the EGoS.\n© Financial incentive\n\n+ Tenure of incentive payment: Maximum 5 years\n\n+ Rate of incentive: 7%-4% on the incremental sales over Base Year (FY 2019-20) for MSMEs and 6% to\n4% over for others.\n\n+ Additional 1% incentive under Design-led PLI for products that are designed and manufactured in\nIndia.\n\nOTHER SCHEMES/INITIATIVES _“@\n\nNational e Aim: To enable fast track growth of digital communications infrastructure. It aims\nBroadband to fulfill the three objectives of universality, affordability, and quality of broadband\nMission services.\n\nKey components and targets\n\n® Broadband Connectivity to Villages: Under the BharatNet Project, so far, 1.81 lakh\nGPs have been made Service Ready.\n\n® Availability of Broadband Speeds (Mbps): To achieve broadband speeds up to 50\nMbps by 2024-25.\nFiberization: Increase Optical Fibre Cable (OFC) up to 50 Lakh Km by 2024-25.\nOther components: Increase Towers, Fiberization of Telecom Towers/ Base\nTransceiver Station and Mapping of Fiber Cumulative.\n\n® Funding: It would be funded largely by the industries. Government to contribute\n10% through the Universal Service Obligation Fund (USOF).\n\nTarang Sanchar |e It provides\n\nportal information on Mobile Easy access to Information on\n\nTowers and Electro Mobile Towers\nMagnetic Frequency\n\n(EMF) Emission\nCompliances.\n@ Information could be\n\naccessed by paying\nthe fee. Clears the myths and misconceptions on\nmobile towers and emissions\n\nUser can get tower or base station checked\ni for radiation emission\n\n( Information on Mobile Towers and\nElectromagnetic radiation (EMF) Emission\nCompliances\n\n\nSanchar Saathi\nPortal\n\nBharat EMart\n\nIt was launched to fulfil the vision of safe and secure communication under Digital\nIndia programme.\nThrough this portal, people will be able to block, track and check genuineness of a\nused device before buying them.\nPortal, developed by Department of Telecom, will enable citizen with following three\nmodules:\n* Centralized Equipment Identity Register (CEIR) for tracing/blocking of lost/\nstolen mobile devices.\nKnow Your Mobile to check number of mobile connections taken in a subscriber's\nname.\nASTR (Artificial Intelligence and Facial Recognition powered Solution for\nTelecom SIM Subscriber Verification) to identify fraudulent subscribers.\nIndia Post signed an MoU with Confederation of All India Traders (CAIT) and Tripta\nTechnologies to facilitate operationalisation of Bharat EMart portal.\nIt will provide facility of pick-up of consignments from premises of traders and will\nensure delivery at the doorsteps of consignees across the country.\n« Platform has around 8 crore traders registered under it.\nBharat e-Mart would provide much needed logistics support to small traders which\nwould increase their businesses and also the opportunities for employment.\n\nCentral\nEquipment\nIdentity Register\n(CEIR)\n\nGovernment is set to launch CEIR system across the country.\n\nCEIR is the citizen centric portal of Department of Telecommunications for tracing\nthe lost/stolen mobile devices.\n\nThis also facilitates for blocking of lost/stolen mobile devices in network of all\ntelecom operators so that lost/stolen devices cannot be used in India.\n\nTo report a lost or stolen smartphone, one needs details like mobile number of SIM\ncards installed, IMEI (International Mobile Equipment Identity) number, and a mobile\npurchase invoice.\n\nDARPAN (Digital\nAdvancement of\nRural Post Office\nfor A New India)\nProject\n\nSampoorna Bima\nGram Yojana\n\nAim: To improve the quality of service and achieve “financial inclusion” of un-\nbanked rural population.\n\nIt intends to provide a low power technology solution to each Branch Postmaster\n(BPM).\n\nDARPAN-PLI App: Launched for seamless collection of premium for Postal Life\nInsurance (PLI) and Rural Postal Life Insurance (RPLI) policies.\n\nAim: To provide affordable life insurance services to people living in rural areas of\nthe country through the postal network.\n\nHouseholds of at least one village (having a minimum of 100 households) in each\nof the revenue districts are provided with a minimum of one RPLI (Rural Postal Life\nInsurance) policy.\n\nRPLI provides insurance cover to people residing in rural areas, especially weaker\nsections. Low Premium and High Bonus is the unique feature of PLI and RPLI schemes.\nAll villages under Sansad Adarsh Gram Yojana will be turned into Sampoorna\nBeema Gram.\n\n\nDeen Dayal\nSPARSH Yojana\n\nAim: To increase the collection and study of postal stamps.\n\nDeen Dayal SPARSH (Scholarship for Promotion of Aptitude & Research in Stamps\nas a Hobby) Yojana awards annual scholarship to children of Standard VI to IX\nhaving good academic record and also pursuing Philately as a hobby.\n\nPrime Minister\nWi-Fi Access\nnetwork Interface\n(PM-WANI)\n\nAim: To elevate wireless internet connectivity in the country by envisaging provision\nof Broadband through Public Wi-Fi Hotspot providers.\n\na -__@ Le\n> 8) ae)\n\nPublic Date Office pues Ao Olfice App Provider Central Registry.\n(PDOA)\n\n@ The scheme encourages local shops and small establishments to provide Wi-Fi for\n\nlast-mile internet delivery which does not require a licence or charge aregistration\nfee.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 8,
                "chapter_name": "8. MINISTRY OF CONSUMER AFFAIRS,\nFOOD & PUBLIC DISTRIBUTION",
                "chapter_path": "./screenshots-images-2/chapter_8",
                "sections": [
                    {
                        "section_id": 8.1,
                        "section_name": "8. MINISTRY OF CONSUMER AFFAIRS,\nFOOD & PUBLIC DISTRIBUTION",
                        "section_path": "./screenshots-images-2/chapter_8/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_8/section_1/cc0a5ace-4f4d-4d3c-99dd-8fcc455d8ea3.png",
                            "./screenshots-images-2/chapter_8/section_1/11ae06fc-eb2e-4b5b-bb85-34909c5d92b3.png",
                            "./screenshots-images-2/chapter_8/section_1/0423c5a8-59f2-45e0-8a55-84ded271bdd1.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "NATIONAL FOOD SECURITY ACT (NFSA), 2013 :\n\nQuick Facts\n\nPurpose: To provide food and nutritional security in human life cycle approach\n\nType: Centrally sponsored scheme\n\nCoverage: 67% of the country’s population (75% of the rural and 50% of the urban population)\nIdentification of Household: Based on the NSS Household Consumption Survey data for 2011-12\n\nObjective\n\nAlegal right to persons belonging to “eligible households” to receive food grains at subsidised price (called\nCentral Issue Prices/CIPs) under the Targeted Public Distribution System (TPDS).\n\nove ©\n\nSalient Features\n\n|\n\n* Benefits: Beneficiaries are provided subsidized Recent Reforms\nRice, wheat and coarse grains issued at Central To enhance effectiveness of NFSA, 2013\nIssue Price (CIP) of Rs.3, Rs.2 and Rs.1. 5\n* 2 Categories of beneficiaries: Primary Online Grievance Registration Facilities\n. . This has been adopted by many states for\nHouseholds (PHHs); Antyodaya Anna Yojana providing prompt resolution\n\n(AAY) households\nPrimary Households (PHHs): Entitled for 5 Kgs\n\nFortification Of Rice\nof foodgrains per person per month. itis a cost-effective and complementary\nAAY households (poorest family): Entitled for strategy to increase wWhamin and minercl\n35 Kgs of foodgrains per family per month.\n« AAY households also receive 1 kg of sugar\n\nC, Automation Of The Supply Chain\nper family per month through the Targeted ‘Almost 20 states and/or UTs have done this\nPublic Distribution System (TPDS). leading to reduction in leakage\n\n+ The Central Government gives subsidy of\nRs.18.50 per kg per month of sugar to AAY\n\n, ‘Aadhar Seeding\nfamilies of participating States. =| Seeding of ration cards with Aadhar reduces\n\n+ States/UTs bear the distribution cost, “ZANN.| duplication and eliminates ghost cards\nincluding margin to dealers and retailers as\nwell as the transportation cost.\n\n\n« Recently, the government approved extension of scheme of sugar subsidy for AAY families for two\nmore years i.e., 31 March 2026.\ne Life cycle approach:\n« Pregnant women and lactating mothers (PW&LM), and children (age group of 6 months to 14 years).\n° PW&LM are entitled to receive maternity benefit of not less than Rs. 6,000\n\nOther Provisions of NFSA\n\nFart\n\nFood Security Allowance: Grievance Redressal Penalty on public servant Women Empowerment:\nGiven to beneficiaries incase | Mechanism: Set up at the or authority: imposed by Ration cards are issued\nof non-supply of entitled food District and State levels the State Food Commission, in the name of the eldest\n\ngrains or meals in case of failure to comply || woman of the household (of\nwith the relief recommended age 18 years or above)\nby the District Grievance\nRedressal Officer\n\ne Joint responsibility of federal Governments:\n\n+ Centre’s responsibility: Allocation and Transportation of foodgrains, assistance to States/UTs for\ndelivery of food grains from FCI godowns to Fair Price Shop (FPS)\n\n« States ‘ responsibility: Effective implementation like identification of eligible households, issuing\nthem ration card, etc.\nKey initiatives\nPradhan Mantri Garib Kalyan Ann Yojana (PMGKAY)\n* Free food grains to about 81.35 crores NFSA beneficiaries (i.e, AAY households and PHH beneficiaries is\nbeing provided for a period of five years\n+ Benefits: Free food to around 80 crores people, ensuring nutrition security, etc.\n© One Nation One Ration Card (ONORC) plan: To implement nation-wide portability of the ration cards\nissued by the States/UTs under the NFSA.\n+ Benefits could be availed though biometric/Aadhaar authentication using their same/existing ration\ncard issued under NFSA.\n® Pradhan Mantri Poshan Shakti Nirman (PM POSHAN)\n* Background: The scheme was launched in 1995 as Mid-day Meal Scheme\n* Purpose: Providing one hot cooked meal in Government and Government ~ aided Schools\n« Tenure: 2021-22 to 2025-26.\n« Beneficiaries:\n@ Children of pre-schools or Bal Vatika (before class |)\n© Children of classes | to VIII\n« Nodal implementing Ministry: Ministry of Education\n* Pradhan Mantri Matru Vandana Yojana or PMMVY\n* Background: It was launched in 2017 and in 2022 incorporated in Mission Shakti (umbrella scheme for\nsafety, security and empowerment of women).\n* About: It is a conditional cash transfer scheme for Pregnant Women & Lactating Mothers (PW&LM).\n+ Objectives:\n¢ To provide cash incentive for partial compensation for the wage loss so that the woman can take\nadequate rest before and after delivery.\n\n¢ to promote health seeking behaviour among the PW&LM.\n« Beneficiaries: PW&LM of at least 19 years of age in informal and unorganized sectors.\n\n+ Benefits:\n\n¢ Conditional Maternity benefit of @ 5,000 for first living child of family.\n\n© Institutional delivery and incentive available Janani Suraksha Yojana (JSY) is also provided.\nTherefore, on an average, a woman gets @ 6000.\n\n© Support to girl child: Under PMMVY 2.0 incentive of 26,000 in a single installment is provided\nfollowing birth of the second girl child.\n\n+ Nodal implementing Ministry: Minister of Women and Child Development\n<<< 9800\n\nOTHER SCHEMES/INITIATIV! .\n\nOne Nation One\nRation Card\n(ONORC) Plan\n\nType: Central = Sector\n\nScheme\n\nAim: To implement nation-\n\nwide portability of the\n\nration cards issued by the Visit PoS enabled Ration shop during working hours\n\nStates/UTs under the NFSA. | ———\n, Share Aadhaar number or Aadhaar seeded ration\n\nThe scheme was earlier | (2™=)) cog\n\nknown as Integrated\n\nManagement of Public | i’) Undergo Aadhaar based biometric authentication at\n\n@ | trosnep\nDistribution System (IM- | &\"~\n\nONENATION, ONERATIONCARD ©\nTo avail your ration, follow these simple steps\n\nPDs). ha Receive your NFSA food grain quota\nNFSA beneficiaries,\nparticularly migrant\n\nbeneficiaries, can lift their entitled foodgrains from any ePoS (electronic Point of\nSale) enabled Fair Price Shop (FPS) in the country.\n\nBenefits could be availed though biometric/Aadhaar authentication using their\nsame/existing ration card issued under NFSA.\n\nPrice Stabilization\nFund (PSF)\n\nAim: To tackle price volatility in some agri-horticultural commodities such as onion,\npotatoes, and pulses.\n\nThese commodities are procured and stored for regulated release to moderate\nthe prices.\n\nThe scheme promotes direct purchase from farmers/farmers’ association at farm\ngate/Mandi.\n\nThe PSF is utilized for granting interest free advance of working capital to Central\nAgencies, State/UT Governments/Agencies to undertake market intervention\noperations.\n\nNOTE: A PSF is also established under the Ministry of Commerce & Industry since 2003 to provide financial\nrelief to small growers of coffee, tea, rubber and tobacco having land holdings up to four hectares. This\n\nfinancial relief was provided when prices of these commodities fell below the price spectrum band\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 9,
                "chapter_name": "9. MINISTRY OF\nCOOPERATION",
                "chapter_path": "./screenshots-images-2/chapter_9",
                "sections": [
                    {
                        "section_id": 9.1,
                        "section_name": "9. MINISTRY OF\nCOOPERATION",
                        "section_path": "./screenshots-images-2/chapter_9/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_9/section_1/b9ec077a-8377-49d8-b867-3bbebbd5bf09.png",
                            "./screenshots-images-2/chapter_9/section_1/e5229da8-ce83-4313-96ae-4905ffc057b3.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "DAIRY SAHAKAR SCHEME _\n\nQuick Facts\n\n|\n\nPurpose: To realise the vision of “from cooperation to prosperity”\n\nProject Cost Limit: There is no minimum or maximum cap on project cost\nImplementing agency: National Cooperative Development Corporation (NCDC)\nTenure: FY 2021-22 to 2025-26.\n\nove ©\n\nObjective\n\ni\n\nFinancial assistance for encouraging cooperatives achieve higher outcomes in ESG (environment,\nsustainability, governance) linked activities and ‘doubling the farmers income’.\n\nSalient Features\n\n|\n\n© Eligibility: Any registered cooperative CA\nsociety or any FPO/SHG (cooperative)\nwith suitable provision in its bye-laws to ( )\nundertake dairy acthmioa. dairy related Renewable energy\ne Financial support maintenance services\n* Financial support will be extended XY / _ 7\nby NCDC to eligible cooperatives\nfor activities such as bovine || a\ndevelopment, procurement, \\\nprocessing, quality assurance, etc. Information and\n. \\ communication\n+ Loan tenure: 5 to 8 years, including | technology\n1 to 3 years of moratorium on fo -\nrepayment of principal.\ne Assistance pattern: Assistance shall \\ /\nbe provided either through the State\nGovernments/ UT Administrations or PET bottle/packaging Manufacturing of cattle\ndirectly to the cooperatives. material feed / feed supplements\n\nmanufacturing\n\nOther key provisions\n\n\n* Capacity building of cooperatives by LINAC (Laxmanrao Inamdar National Academy for Cooperative\nResearch and Development).\n\n« Convergence with other initiatives of Centre or State or Corporate Social Responsibility mechanisms.\nAbout NCDC:\n\n* NCDC is an apex level statutory autonomous institution set up under the Act of the Parliament in 1963\nexclusively for cooperatives at primary, district, apex / multistate and national level.\n* ltoperates on open market principles, without any budgetary support from the Government.\n\nHER SCHEMES/INITIATIV! ‘\n\nAim: Financial assistance to cooperatives on holistic healthcare infrastructure,\neducation and services.\n\nImplementing Agency: NCDC\nNCDC offers finance to cooperatives to set up PHCs, support medical education,\ndiagnostic services, pharmaceutical businesses, blood banks, etc.\n\nThe scheme also provides working capital and margin money to meet operational\nrequirements.\n\nThe scheme provides interest subvention of 1% to women majority cooperatives.\nYuva Sahakar- Aim: For attracting youth to cooperative business ventures.\n\nCooperative Implementing Agency: NCDC\n\nEnterprise Eligibility: All types of cooperatives in operation for at least one year are eligible.\n\nSupport and a\ninnovation Fund: Scheme is linked to Cooperative Start-up and Innovation Fund (CSIF)\n\nScheme created by the NCDC.\n\nIncentive: 2% less than the applicable rate of interest on term loan for the project\ncost up to Rs 3 crore including 2 years moratorium on payment of principal.\n\nFunding:\n\n* 80% of the project cost for cooperatives of North Eastern region, Aspirational\ndistricts, Women or SC or ST or PWD members\n\n+ 70% of the project cost for others\n\nSahakar Mitra: Aim: To assist cooperative institutions access new and innovative ideas of young\nScheme on professionals and provide interns experience of working in the field.\n\nInternship Implementing Agency: NCDC\n\nProgramme Eligibility: professional graduates in disciplines such as Agriculture and allied areas,\n\nor those having MBA degrees in Agri-business, Cooperation, IT etc.\n\nNCDC provides short term (not exceeding four months) opportunity to young\nprofessionals acquire learning experience by applying skills and knowledge in\norganizational context.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 10,
                "chapter_name": "10. MINISTRY OF\nCORPORATE AFFAIRS",
                "chapter_path": "./screenshots-images-2/chapter_10",
                "sections": [
                    {
                        "section_id": 10.1,
                        "section_name": "10. MINISTRY OF\nCORPORATE AFFAIRS",
                        "section_path": "./screenshots-images-2/chapter_10/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_10/section_1/c75943bb-2952-4f08-9e39-82a6f1b4e979.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "1 HER SCHEMES/INITIATIV! .\n\nMCA2!1 project\n\nIndependent\nDirector's\nDatabank\n\nAim: To achieve inter-operability with the National e-Governance Services Delivery\nGateway (NSDG).\n\nitis the first Mission Mode e-Governance project of the Government of India.\n\nIt is designed to fully automate all processes related to enforcement and\ncompliance of the Companies Act, 1956.\n\nIt enables easy and secure access to MCA services for corporate entities,\nprofessionals, and general public.\n\nMCA 3.0 has additional modules for e-Adjudication, e-Consultation and\nCompliance Management.\n\nAim: Capacity building of the existing Independent Directors to inculcate the high\nstandards of corporate governance in India.\n\nThe Databank is a comprehensive repository of:\n\n+ Existing independent directors\n\n* Individuals eligible and willing to be appointed as Independent Directors\nAllindependent directors are required to register themselves with the Databank.\n\nCompanies can also register to search, select and connect with individuals for\nbeing considered for appointment as Independent Directors.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 11,
                "chapter_name": "11. MINISTRY OF CULTURE |",
                "chapter_path": "./screenshots-images-2/chapter_11",
                "sections": [
                    {
                        "section_id": 11.1,
                        "section_name": "11. MINISTRY OF CULTURE",
                        "section_path": "./screenshots-images-2/chapter_11/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_11/section_1/7c29072e-7297-4d9f-91cc-3c8073d124eb.png",
                            "./screenshots-images-2/chapter_11/section_1/efbb2fbc-ec2b-4296-b42b-37bebf9897d3.png",
                            "./screenshots-images-2/chapter_11/section_1/8a34732e-b09e-4a30-9b39-f185ed11de26.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "1\n\nTHER SCHEMES/INITIATIVE: .\n\nPROJECT\n‘MAUSAM’\n\nScheme for\nPromotion of\nCulture of Science\n\nAdarsh Smarak\n\n« Aim: To explore the multi-\nfaceted Indian Ocean ‘world’ %\nMonsoon patterns\n- collating archaeological and\nhistorical research in order\nto document the diversity\nof cultural, commercial and Cultural routes\nreligious interactions in the\nIndian Ocean.\n\n® Objective: To inscribe places becuhime loncisoupen\nand sitesidentified under Project\n\nMausam as_ trans-national\nnomination for inscription in\nUNESCO's World Heritage List.\n\n>\n\n® Implementing Agency: Archaeological Survey of India (ASI) with research support\n\nof the Indira Gandhi National Centre for the Arts (IGNCA) and National Museum.\nTenure: Up to 2023\nItis proposed to prepare two transnational nominations:\n+ Routes followed by the Cholas in the Southeast Asia region\n* Spread of Buddhism through\n\nland and sea routes in the\n\nSouth and Southeast Asian\n\nregion.\nAim: To popularise S&T by organising exhibitions, seminars, popular lectures, etc.\nand to portray their growth and their application in industry and human welfare.\nImplementing Agency: National Council of Science Museums (an autonomous\norganization of Ministry of Culture).\nProvides for:\n\nEstablishment of Science city, Science centres, Innovation Hubs\n\nModernization/Upgradation of existing science cities/science centres/\nInnovation Hubs\n\nDigital Planetarium/Space & Astronomy Education Centre (SAEC)\n\nAim: To provide amenities like audio-video centre, streamline waste water and\ngarbage disposal, etc. of international standard around monuments.\n\nImplementing Agency: Archaeological Survey of India (ASI)\n\n\nNational Mission\nfor Manuscripts\n\n* Aim: Conserving manuscripts and disseminating knowledge contained therein.\n\n* Mandate of identifying, documenting, conserving and making accessible the\nmanuscript heritage of India.\n\n* Amanuscriptis\n\n+ ahandwritten composition on paper, bark, cloth, metal, palm leaf or any other\nmaterial\n\n+ dating back at least seventy-five years\n+ Has significant scientific, historical or aesthetic value.\ne Lithographs and printed volumes are not manuscripts.\n\nNational Mission\n\n* Aim: For developing a comprehensive database of artists, art forms and other\n\non Cultural resources gathered from cultural organizations on a robust IT-enabled platform.\nMapping and ® The mission has been launched under umbrella scheme of ‘Kala Sanskriti Vikas\nRoadmap Yojana”.\nThis will go a long way in promoting cultural economic activity, supporting the\nartists and employment creation’.\nKala Sanskriti * Anumbrella scheme for the promotion of art and culture in the country\nVikas Yojana Components\n\n* Scheme of Financial Assistance for Promotion of Art and Culture\n\n» Repertory Grant: To provide financial support for all genres of performing arts\nand imparting training to artists by their respective Guru on regular basis in line\nwith Guru-Shishya Parampara.\n¢ Financial assistance for each Guru/teacher is provided @ Rs.15,000/-\n\nper month and for each Shishya/Artist @ Rs.2,000 to 10,000/- per month\ndepending upon the age of artists.\n\n+ Financial Assistance To Cultural Organizations With National Presence:\nAssistance up to Rs. 5 Cr.\n\n+ Cultural Function & Production Grant (CFPG): to provide financial support to\nNGOs/ Societies/ Trusts/ Universities etc. for Seminars, Conference, Research,\nDrama-Theatre, Music etc.\n¢ Amount of assistance: Upto Rs.5 Lakh (Rs. 20 Lakh under exceptional\n\ncircumstances).\n\n+ Financial Assistance For The Preservation & Development Of Cultural Heritage\nOf The Himalayas: The quantum of funding is Rs. 10.00 lakhs per year for an\norganization which can be increased to Rs. 30.00 lakhs in exceptional cases.\n\n+» Financial Assistance For The Preservation & Development Of Buddhist/ Tibetan\nOrganization: The quantum of funding under scheme component is Rs. 30.00\nlakhs per year for an organization which can be increased to 1.00 crore in\nexceptional cases.\n\n® Scheme of Financial Assistance for Creation of Cultural Infrastructure: It has 3\ncomponents:\n\n* Financial Assistance For Building Grants Including Studio Theatres\n\n* Financial Assistance For Allied Cultural Activities\n\n+__ Financial Assistance For Tagore Cultural Complexes (TCC)\n\n\nScheme Of Scholarship And Fellowship For Promotion Of Art And Culture: Consists\n\nof three components:\n\n« Scheme For The Award Of Fellowship To Outstanding Persons In The Field Of\nCulture\n\n* Scheme For Scholarships To Young Artistes In Different Cultural Fields\n\n* Tagore National Fellowship for Cultural Research\n\nArtists Pension Scheme: To provide a pension of Rs.4.000/- p.m. to the old artistes\n\nand scholars (not less than the age of 60 years and annual income not exceeding\n\nRs.48,000/- p.a.) who have contributed significantly in their specialized fields of\n\narts, letters etc. but are now living in penury condition\n\nSeva Bhoj Yojana: Central Goods and Services Tax (CGST) and Central Government's\n\nshare of Integrated Goods and Services Tax (IGST) paid on purchase of specific raw\n\nfood items by Charitable/Religious Institutions for distributing free food to public\n\nshall be reimbursed as Financial Assistance by the Government of India.\n\nScheme for Safeguarding the Intangible Cultural Heritage: For reinvigorating\n\nand revitalizing various institutions, groups, NGOs, etc. so that they may engage in\n\nactivities/ projects for strengthening, protecting, preserving and promoting the rich\n\nintangible cultural heritage of india.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 12,
                "chapter_name": "12. MINISTRY OF DEFENCE",
                "chapter_path": "./screenshots-images-2/chapter_12",
                "sections": [
                    {
                        "section_id": 12.1,
                        "section_name": "12. MINISTRY OF DEFENCE",
                        "section_path": "./screenshots-images-2/chapter_12/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_12/section_1/229f76b3-cf92-4716-a146-c772bf4fa2ac.png",
                            "./screenshots-images-2/chapter_12/section_1/af16acab-9d00-4242-acde-9aa9c03fcbc2.png",
                            "./screenshots-images-2/chapter_12/section_1/ded1fe19-be40-4639-8cc4-b3a794acbe5f.png",
                            "./screenshots-images-2/chapter_12/section_1/a0727f8f-f381-4907-b948-e1275eb356c2.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "12.1. ADITI (ACING DEVELOPMENT OF\n\n*\n\n|\n\nINNOVATIVE TECHNOLOGIES WITH IDEX) pall\n\nQuick Facts\n\nPurpose: To develop about 30 deep-tech critical and strategic technologies where the country does not\nhave existing capabilities\n\nComponents: Grant-in-Aid to ADITI winners and to Partner Incubators (PIs)\n\nTechnologies covered: Technologies which are critically required for national security and where the\ncountry does not have existing capabilities.\n\nTenure: FY 2023-2024 to FY 2025-2026\n\nObjective\n\ni\n\nFacilitate rapid development of strategically critical technologies which are sensitive and innovative.\nIndigenisation of critical technologies and reduction of dependencies on foreign OEMs (Original\nEquipment Manufacturers).\n\nSpiral development within ADITI scheme and also spiral development of products developed under\nexisting IDEX scheme.\n\nBuild “Technology Watch Tool” and conduct technology foresight workshops.\n\nSalient Features\n\nADITI challenges: Support for upto two winners in each ADITI challenge has been provisioned. An applicant\ncan be awarded only one ADITI challenge at a time.\n\n+ ADITI scheme shall subsume iDEX Prime category of challenges launched after the date of approval\nof ADITI Scheme.\n\nPartner Incubators (Pls): Network of about 10 Pls (with specialized expertise) will be developed over the\n\nperiod of the scheme and they will provide specialised support and business mentorship.\n\nFinancial support:\n\n+ Grant-in-Aid to ADITI winners: Grant up to 50% of the product development budget with a cap of Rs.\n25 Crore per winner has been considered for the contracts to be signed.\n\n« Grant-in-Aid to Partner Incubators (PIs):\n¢ The project consists of 6 milestones, with a payment limit of Rs. 1,50,000 for each milestone.\n\n» This payment is estimated to be provided to the Pls based on facilitation/completion of each\nmilestone of their associated challenge winner.\n¢ Additionally, activity wise amount on requirement basis will be given to Pls for:\n» Building pipeline for Defence needs by locating startups/MSMEs.\n» Facilitating technical/financial due diligence, incubation and mentorship support through\nacademia, industry and R&D to the challenge winners on milestone basis.\n» Strengthening the innovation ecosystem by undertaking initiatives to reach out, spread\nawareness, among others.\nEligibility for ADITI Challenge eo\n* Startups, as defined and recognized by the Department ADITI scheme <4 IDEX izertinen ~\nfor Promotion of Industry and Internal Trade (DPIIT). and IDEX \\) =\"\n\n+ Any Indian company incorporated under the Critical & advanced technologies under ADITI shall\n\nCompanies Act 1956/2013, primarily an MSME as savelopmant sthroducta}iconancheyies developed\n\ndefined in the MSME Act, 2006. under existing IDEX scheme.\n*  Individualinnovators (research & academic institutions —\n. , IDEX is the operational framework of the Defence\ncan use this category to apply) registered as Startup/ Innovation Organization (010)\nMSME. =\nEligibility for availing grants as iDEX Partner Incubators ind SCP Provides the wine (cart Pt age\n(Pis) (DISC) funding up to Rs 1.5 erores (depending upon\nthe costing of the project and matching\n+ Legal status: The incubator should be registered in contribution).\n\nIndia as a legal entity in public, private or public —\n\n° To motivat IDEX was expanded\npartnership mode, and should have received/ongoing | _tsipex prime. wit, he assistance nereoeta trons\n\ngrant support from Government of India. Rs 1.5 crore to Rs 10 crore.\n+ Experience:\n\n¢ The incubator must have operated for at least 5 years and incubated or funded a minimum of 10\ndefense-related startups.\n\n¢ It should have incubated at least 5 startups in the past 3 years that are running as ‘a going\nconcern’ as of the date of ‘call for application’ by DIO.\n\n¢  Itmust have managed at least 2 sector-focused accelerator programs (preferably in Deep Tech,\nDefense, Al/ML, Cyber, etc.) in the last 5 years.\n\n+ Resource: it should have at least 25 mentors for startups affiliated with it, at least 5 of whom should\nbe SMEs in defence or aerospace domain; and atleast 2 investment experts/investors.\n\n+ Networking: The Pils should have adequate external support system viz. collaboration with industry,\nacademia, and Government institutions to support ADIT! winners.\n\nProcedure for selection\n\n* The framework for ADITI will call for proposals through challenges launched to address specific\ntechnological needs of the Indian Defence Establishments.\n\n* Selection will be through the High-Power Selection Committee (HPSC) led by challenge owner, subject\nmatter experts, representatives from Academia/industry and other concerned stakeholders.\n\nMonitoring: The grant utilization and progress will be monitored by the Defence Innovation Organisation\n(DIO) through Pis.\n\n+ DIO is a Company incorporated under section 8 of the Companies Act 2013. Accounts of DIO are\nsubject to CAG audit.\n\n* DIO is formed jointly by Hindustan Aeronautics Limited (HAL) and Bharat Electronics Limited (BEL).\n\nEvaluation of the scheme: Evaluation by a third party would be arranged in FY 2025-26 before fresh\nappraisal/revision for continuation.\n\nTechnology Watch Tool: To be developed to bridge the gap between the expectations and requirements\nof the modern Armed Forces and the capabilities of the defence innovation ecosystem.\n\n1 GNIPATH SCHEME :\n\n@) Quick Facts\n\n.\n\n*?\n\n.\n\nPurpose: Reducing salaries and pensions to divert resources for military modernisation\nMethod: Short-term recruitment model or ‘Tour of Duty’ (ToD)\n\nEligibility for agniveer: Candidates between the age of 17.5 years to 21 years fulfilling other eligibility\ncriteria\n\nBenefits: Empower, discipline & skill youth with military ethos in civil society\n\nObjectives: To enhance youthful profile of the armed forces, attract young talent and ensure youths remain\nan asset.\n\ngS} Salient Features\n\n.\n\nAgniveers\n\n+ They will be recruited as personnel below officer (PBOR) rank in the army, air force and navy for four\nyears, including six months of training.\n\n* Around 45,000 to 50,000 soldiers, between age of 17.5 to 21 years (23 years for the current year’s\nrecruitment) will be recruited annually.\n\nCompensation for Agniveers\n\n* Under the “Seva Nidhi” package (exempt from Income Tax), they will receive 211.71 lakh, including\ncontribution and interest, on completion of service.\n\nPermanent enrolment\n* Only25% of total recruits will be allowed to continue for another 15 years under permanent commission.\n\n| Support measures to accommodate Agniveers after their four-year service\nx\n\ncy @\n\nMinistry of Defence has approved 10% | | Ministry ot Home Affairs to reserve Ministry of Ports, Shipping and\nWaterways\n\nreservation in the indian Coast Guard | jobs covering 10% vacancies in Central ‘announced avenues for\nand defence civilian posts, and all the 16 | Armed Police Forces (CAPF) and the smooth transition of Agniveers in various\nDefence PSUs Assam Rifles for Agniveers roles of the merchant navy\n\n\n12.3. OTHER SCHEMES/INITIATIV!\n\nTechnology\nDevelopment\nFund (TDF)\nScheme\n\nItis a flagship programme executed by DRDO under ‘Make in India’ initiative.\n\nObjectives\n\n« To provide Grant in Aid to Indian industries, including MSMEs and Start-ups, as\nwell as academic and scientific institutions for the development of Defence\nand dual use technologies that are currently not available with the Indian\ndefence Industry.\n\n+ To create a bridge amongst the Armed Forces, research organizations,\nacademia and qualifying/certifying agencies with private sector entities.\n\n+ Tosupport the futuristic technologies having a Proof of Concept and converting\nthem into prototype.\n\nCorpus: Rs. 100 Cr\n\nThe Ministry of Defence has approved Fund Enhancement under TDF Scheme from\n\n210 crore to #50 crore per project.\n\nDefence Testing\nInfrastructure\n(DTI) Scheme\n\ne Aim: To boost domestic defence and aerospace manufacturing by creating state-\nof-the-art testing infrastructure in partnership with the private industry.\n* Envisages setting up of 6-8 Greenfield DTI facilities that are required for defence\nand aerospace related production.\n« Financial assistance:\n* Projects will be provided with up to 75% Government funding in the form of\n‘Grant-in-Aid’.\n* 25% of the project cost will have to be borne by the Special Purpose Vehicle\n(SPV) which will be the Indian private entities and state governments.\nThe SPVs under the Scheme will be registered under Companies Act 2013.\n\nOne Rank One\nPension (OROP)\n\nNational\nIntegration Tour\n\n Aim:To provide uniform pension to the Armed Forces personnel retiring in the same\nrank with the same length of service, regardless of their date of retirement.\n\n* Coverage: Armed Forces Personnel retired up to June 30, 2019 family pensioners,\nincluding war widows and disabled pensioners.\n\n* Exclusion: Personnel who voluntarily retire\n\n* In future, the pension would be re-fixed every 5 year\n\nNOTE: Before OROP, ex-servicemen used to get pensions as per the Pay Commission's\nrecommendations of the time when they had retired.\n\nEducational and motivational tours to provide an insight into the rich heritage of\nthe country as well as various developmental and industry initiatives that are\nunderway.\n\nBeneficiaries: For youth of Jammu & Kashmir and North Eastern States\nThis initiative exposes youth to various career options and enables them to interact\nwith renowned personalities.\n\nMission Raksha\nGyan Shakti\n\n® Aim: To inculcate Intellectual Property Right (IPR) culture in Indian defense\nmanufacturing ecosystem.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 13,
                "chapter_name": "13. MINISTRY OF EARTH SCIENCES",
                "chapter_path": "./screenshots-images-2/chapter_13",
                "sections": [
                    {
                        "section_id": 13.1,
                        "section_name": "13. MINISTRY OF EARTH SCIENCES",
                        "section_path": "./screenshots-images-2/chapter_13/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_13/section_1/a1d3ba07-fe7f-4941-8543-80696044eb03.png",
                            "./screenshots-images-2/chapter_13/section_1/46f50145-d403-4d57-9ac4-b9303053f90e.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "13.1. OTHER SCHEMES/INITIATIVES _\n\nPRITHvi Vigyan\n(PRITHVI)\n\nKnowledge\nResource Centre\n\nNetwork (KRCNet)\n\nOverarching scheme that incorporates various ongoing schemes under the Ministry\nof Earth Sciences.\n\nKey highlights of the scheme\n\nTenure: 2021-26\n\nPurpose: Holistically address all the aspects relating to the Earth System\nScience.\n\n°\n\nEarth System Sciences deal with all the five components of the earth\nsystem (atmosphere, hydrosphere, geosphere, cryosphere, and biosphere)\nand their complex interactions.\n\nComponents: Encompasses five ongoing sub-schemes:\n\n°\n\nAtmosphere & Climate Research-Modelling Observing Systems & Services\n(ACROSS): For Research and Development (R&D) of dynamical models and\nproviding the forecast services.\n\nOcean Services, Modelling Application, Resources and Technology\n(O-SMART): For technology development for oceanic applications, services\n(forecast and advisories) and R&D activities in the marine and coastal\nenvironment.\n\nPolar Science and Cryosphere Research (PACER): Comprising the Antarctic\nprogram, Indian Arctic program, Southern Ocean program and Cryosphere\nand Climate program.\n\nSeismology and Geosciences (SAGE): Encompasses 6 activities including\nSeismological monitoring and micro-zonation, and Setting up a facility for\ngeochronology.\n\nResearch, Education, Training and Outreach (REACHOUT): Incorporating\nR&D in Earth System Science (RDESS), developing Skilled manpower in Earth\nSystem Sciences, etc.\n\nAim: To upgrade the traditional libraries of the MoES into a top-notch Knowledge\nResource Centres (KRC).\n\nKRCs will be connected with each other and integrated into the KRCNet portal.\n\nMausam App\n\nAim: to provide seamless and user-friendly access to weather products available\non https://mausam.imd.gov.in/.\n\n\n{>\n\na) Sail \\ Warnings\n\nCity Forecast\n\nSystem of\n\nAir Quality\n\nand Weather\nForecasting and\n\nResearch (SAFAR) .\n\nAim: Research based management system where strategies of air pollution\nmitigation go hand in hand with nation’s economic development\n\nIt provides location specific information on air quality in near real time in\nmetropolitan cities.\n\nAlso provides forecast 1-3 days in advance (for the first time in India).\nIt has been combined with the early warning system on weather parameters.\n\nGagan Enabled\nMariner's\nInstrument for\nNavigation and\nInformation\n(GEMINI) device\n\nAim: Seamless and effective dissemination of emergency information and\ncommunication on disaster warnings, Potential Fishing Zones (PFZ) and Ocean\nStates Forecasts (OSF) to fishermen.\n\nThe GEMINI device receives and transfers the data received from GAGAN satellite/s\nto a mobile through Bluetooth communication.\n\nA mobile application developed by INCOIS decodes and displays the information\nin nine regional languages.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 14,
                "chapter_name": "14. MINISTRY OF EDUCATION",
                "chapter_path": "./screenshots-images-2/chapter_14",
                "sections": [
                    {
                        "section_id": 14.1,
                        "section_name": "14. MINISTRY OF EDUCATION",
                        "section_path": "./screenshots-images-2/chapter_14/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_14/section_1/7e291e89-924d-4ab8-a3e6-1356422419ef.png",
                            "./screenshots-images-2/chapter_14/section_1/c9df852f-e417-4b09-95b5-dc62cf23e780.png",
                            "./screenshots-images-2/chapter_14/section_1/85807654-ddd4-4244-bc2b-f0fce34299d5.png",
                            "./screenshots-images-2/chapter_14/section_1/c28423aa-8a3f-4992-819b-709dcec52b1e.png",
                            "./screenshots-images-2/chapter_14/section_1/699f8f6c-f5dc-4c6b-88ac-c6a4d2784da8.png",
                            "./screenshots-images-2/chapter_14/section_1/e8371c79-82fc-4f5f-a7a3-952a3a4a7d0a.png",
                            "./screenshots-images-2/chapter_14/section_1/62c0d8d7-d9db-44fd-9ad3-325d394709ab.png",
                            "./screenshots-images-2/chapter_14/section_1/19dc0e58-95ab-4f90-a62d-5a8f3c61588c.png",
                            "./screenshots-images-2/chapter_14/section_1/8f77bdaf-8320-414e-8428-1f7e4de5c831.png",
                            "./screenshots-images-2/chapter_14/section_1/e07cebf4-c206-479d-8d49-8ab56052692f.png",
                            "./screenshots-images-2/chapter_14/section_1/08f6baa8-88af-40bb-b257-f4ffdf810688.png",
                            "./screenshots-images-2/chapter_14/section_1/bf747963-7281-4f03-83fc-e7768eb3b069.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "14.1. SAMAGRA SHIK: AN INTEGRATE!\nSCHEME FOR SCHOOL EDUCATION\n\no Quick Facts\n\nPurpose: Improving school education holistically as a continuum from Pre-school to Class 12\nType: Centrally Sponsored Scheme\n\nImplementing agency: State Implementation Society (SIS) at the State/UT level\n\nTenure: 2021 to 2026\n\n* Universal Access, Equity and Quality, promoting Vocationalisation of Education and strengthening of\nTeacher Education Institutions (TEls).\n\n* Support States in implementation of Right of Children to Free and Compulsory Education (RTE) Act, 2009.\n\nSalient Features\n\n® Background: Samagra Shiksha is an\n\noverarching programme for the school Samagra Shiksha Scheme\neducation sector extending from pre-school to for School Education\n\nclass 12.\n\n» The scheme subsumes following three\n\nere @\n\nschemes: @ Covers 1.16 million schools, over 156 million students\n\n° Sarva Shiksha Abhiyan: To universalize ond 6.7 million Teachers of Govt. and Aided schools\naccess to elementary education by @ Access to quality education with an equitable and\nproviding financial support for the inclusive classroom environment\ncreation of school infrastructure as per @> Greater focus on imparting skills among the\nthe norms and standards specified in students\nthe RTE Act, 2009. @ Allchild centric interventions will be provided\n\n+ Rashtriya Madhyamik Shiksha Abhiyan directly to the students through DBT mode over a\n\nperiod of time\n(RMSA): To enhance access to secondary\n\neducation and to improve its quality.\n\n\n« Scheme on Teacher Education: To create a sound institutional infrastructure for pre-service and in-\nservice training of elementary & secondary school teachers and for provision of academic resource\nsupport to elementary and secondary schools.\n\nInitiatives to align with NEP 2020\n\n+ SARTHAQ (Students’ and Teachers’ Holistic Advancement through Quality Education): NEP\nImplementation Plan\n\n+ NIPUN BHARAT (National initiative for Proficiency in Reading with Understanding and Numeracy): For\nensuring that every child necessarily attains foundational literacy and numeracy in Grade 3 by 2026-\n27.\n\n+ Foundational Learning Study (FLS): Conducted by the National Council of Educational Research\nand Training (NCERT) to assess the learning level of Class 3 students in Foundational Literacy and\nNumeracy.\n\n* Vidya Pravesh: A 3 Months Play Based ‘School Preparation Module’ developed by the NCERT.\n\n* Vidyanjali 2.0: A web portal, through which community/volunteer can connect the Government and\nGovernment aided schools of their choice for sharing knowledge, skills and contributing in the form\nof assets/material/equipment.\n\n+ Kasturba Gandhi Balika Vidyalayas (KGBVs): To provide residential and schooling facilities upto\nClass~XIil including Incinerator and sanitary pad vending machines in all girls’ hostels.\n\n+ Netaji Subhas Chandra Bose Avasiya Vidyalayas: In hilly terrain, small and sparsely populated areas\nfor children without adult protection who are in need of shelter and care.\n\n+ NISHTHA 4.0 (ECCE): An online teacher training programme for Early Childhood Care and Education\n(Ecce).\n\nFocus on Girl Education: Upgradation of Kasturba Gandhi Balika Vidyalayas (KGBVs) from Class 6-8 to\n\nClass 6-12.\n\n*  Self-defence training for girls from upper primary to senior secondary stage.\n\n+ Enhanced Commitment to ‘Beti Bachao Beti Padhao’.\n\nFocus on Digital Education: Support ‘Operation Digital Board’ in all secondary schools over a period of 5\n\nyears. Digital initiatives like UDISE+, Shagun, to be strengthened.\n\nShiksha Shabdkosh: A document on glossary of various terminologies in School Education.\n\nAdministrative reform: Single and unified administrative structure leading to harmonized implementation.\n\nSamagra Shiksha Framework: This framework, issued by the DoSEL, gives the Key Performance Indicators\n(KPI) for each component and physical and financial details of implementation of each component of\nSamagra Shiksha.\n\nAmendment in RTE Act, 2009: The schedule to RTE Act, 2009 has been amended regarding pupil teacher\nratio for special educators in general schools.\n\n+ Atprimary level: One special education teacher for every ten pupils with disabilities.\n+ Atupper primary level: One special education teacher for every fifteen pupils with disabilities enrolled.\n\n14.2. PRADHAN MANTRI UCHCHATAR \"ig\nSHIKSHA ABHIYAN (PM-USHA)\n\nQuick Facts\n\nPurpose: To cater to needs of educationally unserved/underserved areas\n\nType: Centrally Sponsored Schemes\n\nCoverage: Covers government and government-aided institutions of the States and UTs\nTenure: 2023-24 to 2025-26\n\nObjective\n\ni\n\n*\n\n.\n\nTo improve the overall quality of existing state higher educational institutions (State HEIs).\nImplementation of recommendations of the NEP 2020 through funding support provided to State HEIs.\nimproving accreditation status of accredited institutions and getting accreditation of non-accredited\ninstitutions.\n\nEstablish backward and forward linkages with school education on one hand and employment market,\non the other hand.\n\nDeveloping infrastructure for ODL/Online/Digital mode of education in such States/UTs.\n\nProviding adequate opportunities for higher education to socially deprived communities.\n\nFocusing on low GER, Left Wing Extremism (Lwe), border area districts, aspirational districts and districts\nwith higher SC/ ST population,\n\nEnhancing employability through skilling and vocationalization.\n\nFocus on multidisciplinary education, including STEM, commerce and humanities fields of education.\n\nSalient Features\n\nBackground: In 2013, Centre launched Rashtriya Uchchatar Shiksha Abhiyan (RUSA to attain higher levels\n\nof access, equity, and excellence in the State HEIs. In 2018, the second phase of RUSA was launched.\n\n* Now, in the light of the National Education Policy (NEP), 2020, RUSA scheme has been launched as\nPradhan Mantri Uchchatar Shiksha Abhiyan (PM-USHA).\n\nComponent in PM-USHA\n\n* Multi-Disciplinary Education and Research Universities (MERU): Only accredited state government\nuniversities would be eligible.\n° NAAC Grading; NIRF Ranking are key criterion for shortlisting.\n\n* Grants to Strengthen Universities (Accredited & Unaccredited Universities): Only state government\nuniversities would be eligible.\n\n+ Grants to Strengthen Colleges (Accredited & Unaccredited Colleges): Only state government and\ngovernment-aided colleges will be eligible.\n\n* New Model Degree Colleges: Districts without any government HEls would be eligible. Only state\ngovernment colleges would be established.\n\n« Gender Inclusion and Equity Initiatives: Districts would be taken as a unit and not individual institutions.\nThe activities that can be undertaken under this component include doing sensitization workshops,\ncombined hostels for females for the nearby colleges and universities in the district, etc.\n\n+ Management Monitoring Evaluation and Research (MMER): The amount of MMER grants is 2 percent\nof the total fund approved, out of which | % will be released to the States/ UTs and 1 % will be utilized by\nthe Centre.\n\nPM USHA aims to cater to the five\npillars of the NEP 2020 viz:\n\nrs 4\nF.§ Yin Fe\n\nJ\n7\n\nDeveloping Quality Accreditation of IcT-based Digital\nby promoting | Teaching & Learning Non-Accredited Infrastructure: HEIs\nmultilingualism and Processes: Upgrading | Institutions & Improving _ should be encouraged to\nproviding opportunities | physical and digital Accreditation: design, develop, and roll Establishment of\n\nto underprivileged. infrastructure and Hand-holding of state out MOOCs for learners & employment cells to\n\nsupporting faculty HEIs for getting teachers. create linkages between\ntraining. accreditation. Academia, Industry, and\nthe Market.\n\nPriority would be given to Focus districts: States would identify the Focus Districts on the basis of the\nfollowing indicators:\n\n+ Low Gross Enrolment Ratio (GER).\n\n* Population proportion and enrollment proportion for Females, transgenders, SCs, STs and OBCs.\n*  Aspirational/ Border Area/ Left Wing Extremism (LWE) prone district.\n\n* Gender parity.\n\nProcess of Selection: Selection of institutions would be done through the challenge method.\n\nMonitoring and Evaluation: The scheme shall be monitored and evaluated at each level i.e. Central, State,\nand Regional.\n\n* At the Central Level National Mission Authority (NMA) chaired by Union Minister of Education acts as\nan overseer of the scheme.\n\n* Project Approval Board (PAB) (chaired by Secretary, Higher Education, Gol) ensures regular monitoring\nand evaluation of not only the proposals but also the performance of the scheme.\n* Activities not supported under PM USHA: Payment of salaries, pensions, and other benefits, recurring/\nnon-recurring cost for any project, etc, scholarships, fellowships, or stipends to students, among others.\n\n7?\n\n14.3. OTHER SCHEMES/INITIATIVES _ \"i\n\nPM eVIDYA unifies all efforts related to digital/online/on-air education to enable\nmulti-mode access for imparting education by using technology to minimise\nlearning losses.\n\nIt has been initiated as part of Atma Nirbhar Bharat Abhiyaan.\n\nUse of ICT under PM eVIDYA, particularly during the COVID-19 pandemic, won\nUNESCO's recognition (UNESCO's King Hamad Bin Isa Al-Khalifa Prize).\n\n\nPM Shri Schools\n\nVidya Sameeksha\nKendra (VSK)\n\n‘PM Shri Schools’ will be state-of-the-art schools and act as the laboratory of\nNational Education Policy (NEP) 2020.\n\nThey will be fully equipped to prepare students for future.\nThe Ministry of Education plans for nationwide replication of Gujarat Education\nDepartment's VSK.\n\nVSK helps track daily online attendance of teachers and students, periodic\nassessments of learning outcomes of students, etc.\n\nNational surveillance system known as NDEAR (National Digital Education\nArchitecture) was launched to create a unifying national digital infrastructure.\n\nIndian Knowledge\nSystems (IKS)\ninitiative\n\nStrengthening\nTeaching-\nLearning and\nResults for States\n(STARS) Project\n\nIKS is an innovative cell at All India Council for Technical Education (AICTE).\nitis established to promote interdisciplinary research on all aspects of IKS, preserve\nand disseminate IKS for further research and societal applications.\n\nIt aims to spread rich heritage and traditional knowledge in field of Arts and\nliterature, Agriculture, Basic Sciences, Engineering & Technology, etc.\n\nRaja mantri chor sipahi, posham pa, gilli danda etc. are among 75 indigenous\ngames that will be introduced in schools under IKS initiative.\n\nType: Centrally Sponsored Scheme\n\nPurpose: Improving the overall monitoring and measurement activities in the\nIndian School Education System.\n\nTenure: Till FY 2024-25.\n\nExternal support: By World Bank amounting to US $ 500 million\n\nCoverage: 6 States namely Himachal Pradesh, Rajasthan, Maharashtra, Madhya\n\nPradesh, Kerala and Odisha.\n\nCarved out of Samagra Shiksha, with a focus on those elements of the scheme\n\nthat will most directly support school education enhancement.\n\n2 major components:\n\n+ AtNational level: Strengthening of learning assessment systems, Establishing a\nNational Assessment Center (PARAKH) etc.\n\nAt State level: Strengthening Early Childhood Education, classroom instruction,\nVocational education etc.\n\nLinks the receipt and disbursement of funds to outcomes.\n\nStrengthening planning and Improvement in secondary\nmanagement capacities for school completion rate\ndecentralized management\n\nMinimum proficiency in grade Improvement in\n3 language in selected states governance index scores\n\nPartnerships developed to Strengthened learning\nfacilitate cross- learning between assessment systems\nstates\n\n\nPrime Minister's |* Aim: To attract the best talent into research thereby realizing the vision of\nResearch development through innovation.\nFellowship ® Coverage:\nScheme + Allthe IITs, all the IISERs, Indian Institute of Science (Bengaluru)\n* Some of the top Central Universities/NITs that offer science and/or technology\ndegrees\n* Any recognised institute/university\ne Attractive scholarship is provided to the selected candidates for a PhD program in\nthe area of Science or Engineering/Technology.\n* APMRF fellow is expected to teach once a week in a neighborhood ITi/Polytechnic/\nEngineering College/School other than their own PMRF granting institute.\nStudy in India ® About: The Study in India program is a flagship of Government of India to encourage\nProgramme international students to explore educational opportunities at top Indian universities.\n* Type: Central Sector Scheme\n* Purpose: To make India a preferred education destination/hub for foreign students.\n© Implementing Agency: EdCIL (india) Limited, a Mini Ratna Category |.\nRashtriya © Aim: To motivate and engage children (6-18 years) in Science, Mathematics and\nAvishkar Abhiyan Technology through observation, experimentation, inference drawing, etc.\n(Raa) * Asubcomponent of both SSA and RMSA.\n* Mentoring by institutes like lTs/ tMs/ lISERs and other central universities and\n\nUnnat Bharat\nAbhiyan\n\nreputed organizations through innovative programmes, student exchanges, etc.\nType: Central Sector Scheme\nAim: Transformational change\nin rural development processes\nby leveraging knowledge rural energy sustainable\ns .\ninstitutions to build inclusive owe ogrioulture\nIndia.\nFacilitate faculty and students\nof Higher Educational basic amenities water resource\nInstitutions (HEIs) in identifying | | (infrastructure & management\ndevelopment issues in rural services)\nareas and finding sustainable\nsolutions for the same.\nUnder Unnat Bharat Abhiyan artisans, industries:\n2.0, the scheme is extended to and livelihood\nall educational institutes subject\nto fulfilling certain criteria.\n\nKalam Program\nfor IP Literacy\nand Awareness\n(KAPILA)\n\nAim: To recognise, facilitate and felicitate the Intellectual Property, innovations and\nbest practices in higher education institutions (HEIs).\n\nLaunched by: Ministry of Education’s Innovation Cell (MIC)\n\nProvides financial assistance to the institutions that are part of the Higher Education\nInstitutions for filing patent.\n\nIt will create appropriate awareness regarding the need of IP filing, mechanism,\n\nand methodology involved in filing IP in India and globally, especially amongst\nstudents and faculty of higher education institutions.\n\nAICTE-SPICES * Aim: For developing students club for the well-rounded development of students\n\n(Scheme for by promoting their interests, creativity, and ethics.\n\nPromoting * Eligibility: AICTE approved institutes with minimum 5 years of existence.\n\noe ad Financial assistance: 2 | Lakh only to a Student Club to develop it as model Club\n\nty a (only one time grant to one institute)\n\nEthics among\n\nStudents)\n\nVittiya * An appeal was made to all the higher educational institutions to develop a\n\nSaksharata cashless campus.\n\nAbhiyan (VISAKA) |. National Cadet Corps (NCC)/National Service Scheme (NSS) volunteers to spread\nawareness about these digital modes of transactions to shopkeepers, vendors in\nnearest market place.\n\nIMPacting Aim: To solve the most relevant engineering challenges faced by our nation by\n\nResearch translating knowledge into viable technology.\n\nINnovationand =| Coverage: Ministry of Education funded HEIs /Centrally Funded Technical institution\n\nTechnology (CFT!) including private institutions.\n\n(IMPRINT) 2.0\n\ninstitute of\nEminence (loE)\nscheme\n\nSubsumes the erstwhile Uchhatar Avishkar Yojana.\nFunded by: Ministry of Education and Department of Science and Technology (DST).\n* Aim: To enable 10 institutions each from the public and private category to have\nworld class academic & research facilities and grant them the status of loE.\n* Benefits to loEs:\n* Government will provide funding upto 21,000 crore to public institutions, for\nprivate institutions no financial support.\n* Significant amount of autonomy in academic, administrative & financial\nmatters has been provided under the regulatory framework to these institutions.\n°  loEs are allowed to set up campuses abroad after receiving no objection\ncertificates from Ministry of External Affairs and Ministry of Home Affairs.\n¢ Norms and standards of the off shore campus shall be the same as that\nmaintained on the main campus for similar courses.\n°  loEs are also permitted to start off new campus centres, with a maximum of\nthree in five years and not more than one in an academic year.\n\nVidwan portal\n\n© itis the premier database of profiles of scientists / researchers and other faculty\nmembers working at leading academic institutions and other R & D organisations\ninvolved in teaching and research in India.\n\n\nNav Bharat\nSaaksharta\nKaryakram (New\nIndia Literacy\nProgramme or\nNILP)\n\nType: Centrally Sponsored\nScheme\n\nThe schemes in alignment\nwith the recommendations\nof National Education\nPolicy (NEP) 2020.\n\nThe scheme targets all\nnon-literates of age 15\nyears and above in the\ncountry, with more focus on\nfemales and educationally\nbackward states.\n\nThe scheme is to be\nimplemented through\nvolunteer teachers and\nstudents of schools\nand Higher Education\nInstitutions and Teacher\nEducation Institution.\n\nTarget for FYs 2022-27 is 5\ncrore learners (1.00 crore\n\nVocational\nSkills Skills\n\nContinuing\nEducation\n\nFoundational\nLiteracy and\nNumeracy\n\nCritical Life\n\nper year) by using “Online Teaching, Learning and Assessment System (OTLAS)”\nin collaboration with National informatics Centre, NCERT and NIOS.\n\nSWAYAM (Study\nWebs of Active—\nLearning for\nYoung Aspiring\nMinds)\n\nAim: To take the best\nteaching learning resources\nto all, including the most\ndisadvantaged.\n\nA repository of more than\n300 high quality Massive\nOpen Online Courses\n(Mooc) that are developed\nby academicians from top\nranked institutions and are\noffered free of cost.\n\na.\n\nsysternatic\nApproach\n\nBest-in-Class\nInstructors\n\n12\n\nActive Local Weekly\n\nChapters Assignments\n\nEasy Credit\nTransfer\n\nGlobal Initiative\nof Academic\nNetworks (GIAN)\n\nAim: Tapping the talent pool of scientists and entrepreneurs internationally to\nencourage their engagement with the institutes of Higher Education in India.\nFaculty from highly rated institutions abroad will visit India, interact and partner\nwith their counterparts and with students, and deliver specialised courses.\n\nThe lectures under GIAN would be made available to the students across the\ncountry through the SWAYAM, the MOOCs platform and the National Digital Library.\n\n\nNational\nAcademic\nDepository (NAD)\n\nNational\ninstitutional\nRanking\nFramework (NIRF)\n\n* \\tis a 24x7 online store house of all academic awards viz. certificates, diplomas,\ndegrees, mark sheets, etc.\n\nDuly digitised and lodged by academic institutions / boards / eligibilityassessment\nbodies.\n\n® Outlines a methodology to rank institutions across the country.\n\nParameters\n\nTEACHING, || RESEARCH AND || GRADUATION |D>| OUTREACH AND |%>|  pERCEPTION\nLEARNING & PROFESSIONAL OUTCOMES INCLUSIVITY\nRESOURCES PRACTICE\n\nimpactful Policy\nResearch in\nSocial Sciences\n(IMPRESS)\n\nSPARC (Scheme\nfor Promotion\nof Academic\nand Research\nCollaboration)\n\nAim: To encourage social science research in policy relevant areas so as to provide\nvital inputs in policy-formulation, implementation and evaluation.\n\nImplementing Agency: Indian Council of Social Science Research (ICSSR)\nEligibility: All Government funded institutions, private institutions with UGC 12(b)\nstatus and ICSSR Research Institutes.\n\nFunds research proposals in social sciences with maximum impact on the\ngovernance and society.\n\nState and Urban Media, Culture |] Employment || Governance,\nDemocracy ||Transformation|| and Society _} skills and Rural || Innovation and\nTransformation) \\_ Public Policy\n\ne's p54\nSocial Media | |Politics, Law and]| Science and\nland Technology} Economics Education Environment\n\nAim: To improve the research ecosystem of India’s HEIs.\n\nFacilitating academic and research collaborations between Indian Institutions and\nthe best institutions in the world from 28 selected nations to jointly solve problems\nof national and/or international relevance.\n\nEligibility: All Indian Institutions ranked in the overall top-100 or category-wise top-\n100 in the India Rankings (NIRF-2019) are eligible to apply.\n\n\nIntegrated * Envisages a fully integrated, instantly accessible and seamless information\n\nNational School network for all information related to schools across the country.\n\nEducation * Theaimis to create an easily accessible multi-layered eco-system of information\n\nTreasury (INSET) — school wise, block-wise, district-wise, constituency-wise, state-wise and region-\nwise.\n\nMadhyamikand |¢ twas created in 2017 to receive proceeds from the Secondary and Higher Education\n\nUchchtar Shiksha Cess.\n\nKosh (MUSK)\n\nFor 2023-24, transfers from this fund are proposed to be made to\n* Sarva Shiksha Abhiyan\n\n« National Means cum Merit Scholarship Scheme\n\n« The Kendriya Vidyala Sanghatan\n\n* The Navodaya Vidyalaya Samiti.\n\n+ PM Uchchatar Shiksha Protsahan (PM-USP) Yojna, which integrates current\nInterest Subsidy and Guarantee Fund contribution schemes and scholarships\nfor higher education\n\nNational\nEducational\nAlliance for\nTechnology\n(NEAT)\n\nPradhan Mantri\nYUVA (Young,\nUpcoming and\nVersatile Authors)\n2.0 Scheme\n\nPadhe Bharat\nBadhe Bharat\n\nAim: To bring the best technological Products in education pedagogy on a single\nplatform for the convenience of learners.\n\nA Public-Private Partnership (PPP) model between the Government and the\nEducation Technology companies of India.\n\nThrough an open invitation and screening, companies are invited to showcase\ntheir products on a National Portal developed for the learners, who may procure\nthem based on their requirements.\n\nitis an Author Mentorship programme.\n\nIt aims to train young and budding authors (below 30 years of age) in order to\npromote reading, writing and book culture in the country, and project India and\nIndian writings globally.\n\nA nationwide sub programme of SSA to improve language development and to\ncreate a natural and positive interest in mathematics.\n\nTwo tracks\n+ Early reading and writing with comprehension in Elementary Classes\n\n* Early Mathematics\n\nFirst time provision for Creating Readin,\nOutlay of Rs. 473.96 a separate library Corners with Children’s\ncrore for 7,02,250 grant of Rs. Literature to promote\ngovernment schools 5,000-20,000 for each reading habit among\ngovernment school children\n\nPradhan Mantri\nInnovation\nLearning\nProgramme\n(DHRUV)\n\nScheme\n\nfor Trans-\ndisciplinary\nResearch\n\nfor India’s\nDeveloping\nEconomy (STRIDE)\n\nTECHNICAL\nEDUCATION\nQUALITY\nIMPROVEMENT\nPROGRAMME\n(TEQUIP)\n\nEducation Quality\nUpgradation\n\nand Inclusion\nProgramme\n(Equip)\n\nAim: To identify and encourage talented children to enrich their skills and\nknowledge.\n\nIn centres of excellence across the country, gifted children will be mentored and\nnurtured by renowned experts in different areas, so that they can reach their full\npotential.\n\nThe first batch of DHRUV programme was implemented during October 2019.\n\n* To begin with, two areas i.e. Science and Performing Arts were covered\n\nAim: To identify young talent, strengthen research culture, build capacity, and\nto fund multi-institutional network, high-impact research projects in humanities\nand human sciences.\n\nThe specific focus of the scheme is to support high-impact research in thrust areas\nof humanities and human sciences including arts, indian languages, and culture\nand knowledge systems.\n\nInnovative research\nprojects under STRIDE\n\nLocally Nationally Globally\nneed-based important significant\n\nObjectives: To improve the quality of technical education system in the country\nwith a special consideration for Low Income States and Special Category States\n(secs)\n\nExternal assistance: World Bank assisted Project\n\nGraduates from IITs, NITS, etc. are hired for teaching in engineering colleges of rural\nareas\n\nEQUIP is a vision plan aiming at ushering transformation in India’s higher education\nsystem by implementing strategic interventions in the sector over five years (2019-\n2024).\n\nStrategies for Expanding Access\n\nEnhance access to vulnerable communities (SC/ST): Setting up of Samras Hostels\nin underserved areas; Fee reimbursements for SC/ST students; Finishing School/\nBridge Course to impart employable skills\nExpand access to cater to geographically underserved areas: Enhance learnability\nand employability through vocationalisation; Broadening opportunities for access\nto higher education through MOOCs.\nImprove the Gross Enrolment Ratio (GER) through Open and Distance Learning\n(ODL): Double the number of Learner Support Centres; Upgrade ICT infrastructure\nof IGNOU; Offer Courses through multiple languages\nEnhance overall access to higher education: Offer incentives to students for\npursuing higher education; Offer courses in a dual mode (distance and regular) in\nuniversities.\n\n\nEK BHARAT\nShreshtha\nBHARAT\nPROGRAMME\n\nObjectives: To celebrate cultural diversity through mutual interaction & reciprocity\nbetween people of different States and UTs\n\nOne State/UT is paired with another State/UT in India for reciprocal interaction\nbetween the people.\n\nThe paired States/ UTs enter into MoUs with each other to carry out common\nactivities.\n\nRashtriya Ekta Shivirs are organised under this programme by Kendriya Vidyalaya\nSangathan.\n\nUdaan: Giving\nwings to girls\n\nObjective: To address the low enrolment of girl students in prestigious engineering\ninstitutions and the teaching gap between school education & engineering entrance\nexamination.\n\nStudents are provided free offline / online resources through study material on pre-\nloaded tablet while studying in Class X! and Class XII for preparation of admission\ntest to various premier engineering colleges in the country.\n\nDigital Gender\nAtlas for\nAdvancing Girl's\nEducation in India\n\nShala Gunvatta\n(Shagun) Portal\n\nObjective: To identify low performing geographic pockets for girls, particularly\nfrom marginalised groups such as scheduled castes, scheduled tribes and Muslim\nminorities, on specific gender related education indicators.\n\nThe Atlas provides a comparative composite index based on quartile ranking of\ngender related indicators at National, State, District and Block levels.\n\nThe Atlas enables a trend analysis and tracking of performance of individual\ngender related parameters across periods of time.\n\nData source\n\n* Unified District Information System for Education (U-DISE)\n\n+ National Education Management Information System (EMIS)\n\n* Census of India 2011\n\n* District Information System for Education (DISE)\n\nItis a repository of best practices, photographs, videos, studies, newspaper articles,\netc. on elementary education in schools of the Central Government, States & UTs\n& Autonomous bodies.\n\nIts online monitoring module measures State-level performance and progress\nagainst key educational indicators.\n\nCredit Guarantee\nFund Scheme for\nEducation Loans\n(CGFSEL)\n\nEducation loans offered by around 30 regional rural banks (RRBs) will now have\nthe credit shield from the CGFSEL.\n+ This will bring RRBs on a par with commercial banks and help them lower\ninterest rate on such loans.\nThe CGFSEL was set up by Ministry of Education in 2015 to ease education loans\nand extend guarantee coverage against default in education loans sanctioned by\npublic, private, and foreign banks.\nAt present, the scheme covers default on an education loan if the loan limit is 27.5\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 15,
                "chapter_name": "15. MINISTRY OF\nELECTRONICS & IT",
                "chapter_path": "./screenshots-images-2/chapter_15",
                "sections": [
                    {
                        "section_id": 15.1,
                        "section_name": "15. MINISTRY OF\nELECTRONICS & IT",
                        "section_path": "./screenshots-images-2/chapter_15/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_15/section_1/b47a8592-fca3-433a-a7b9-c0da14b11c64.png",
                            "./screenshots-images-2/chapter_15/section_1/9b8f20a0-9058-43fe-b5e2-1428efd2d95b.png",
                            "./screenshots-images-2/chapter_15/section_1/ac829b3f-a163-485a-b875-4f03a2c01870.png",
                            "./screenshots-images-2/chapter_15/section_1/12c690c2-8665-40fa-bbea-c9d9ae7b6924.png",
                            "./screenshots-images-2/chapter_15/section_1/45b554a8-be0a-4dc0-8947-e2850d1b7707.png",
                            "./screenshots-images-2/chapter_15/section_1/ffa8c82b-95e1-4a15-a1cd-2603d9934528.png",
                            "./screenshots-images-2/chapter_15/section_1/6db6c2c1-5309-4322-9154-c1858f4bb5e3.png",
                            "./screenshots-images-2/chapter_15/section_1/1be08126-4bf0-4faa-b2ba-5bbd4c11088d.png",
                            "./screenshots-images-2/chapter_15/section_1/fde4b9d2-3b1c-4501-ab87-a16a82b14ecb.png",
                            "./screenshots-images-2/chapter_15/section_1/4387ace2-bd3b-4c8f-8863-43d35494bded.png",
                            "./screenshots-images-2/chapter_15/section_1/f30bf942-77fc-45f9-a6d4-b9a92a43b333.png",
                            "./screenshots-images-2/chapter_15/section_1/02d0a286-7c78-4e79-80eb-2ea4b799c695.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "15.1. DIGITAL INDIA PROGRAMME\n\n> auick Facts\n\nPurpose: To transform India into a digitally empowered society and knowledge economy\n\nNature: Umbrella programme that clubs together various e-governance initiatives across Ministries\nand Departments\n\n* Leveraging private sector: Public Private Partnerships (PPP) are preferred wherever feasible to implement\ne-Governance projects.\n\nImplementation: By the entire Government with overall coordination by the MeiTY.\n\nQD Objective\n\nTo transform India into a digitally empowered society and knowledge economy.\n* Toensure digital access, digital inclusion, digital empowerment and bridge the digital divide.\n* Toensure that Government services are available to citizens electronically.\n\n5 Salient Features\n\n® Background: launched in 2015 to enable digital delivery of services to citizens.\n® Umbrella programme: Covers multiple projects of various Central Ministries/Departments and States\nand Union Territories (UTs).\n\nDIGITAL INDIA\n\n—— = =\nNine Pillars of Digital india\n\n4. E-Governance ~ 7. Electronics\n) 1. Broadband Highways }( Reforming government Manufacturing - Target\nthrough Technology = NET ZERO Imports\n\n2. Universal Access to 5. eKranti - Electronic\nPhones delivery of services a 8 IT for Jobs\nJ \\\n\n\\ ‘i\n3. Public Internet Access @ 6 information for All : 9. Early Harvest\nProgramme Programmes\n\n\n+ The central ministries/departments and state governments concerned would have the overall\nresponsibility for the implementation of various projects under the Digital India Programme.\n\ne Vision is centred on three key areas:\n\n« Digital infrastructure as a Utility to Every Citizen\n° High-speed internet as a core utility\n© Cradle to grave digital identity -unique, lifelong, online, authenticable\n° Mobile phone & Bank account enabling participation in digital & financial space\n° Easy access to a Common Service Centre\n¢  Shareable private space on a public cloud\n° Safe and secure Cyber-space\n\n* Governance & Services on Demand\n° Seamlessly integrated across departments or jurisdictions\n° Services available in real-time from online &mobile platform\n°  Allcitizen entitlements to be available on the cloud\n° Services digitally transformed to improve Ease of Doing Business\n\n¢ Making financial transactions electroni¢ eo\n& cashless Project Management Structure —~\n° Leveraging GIS for decision support\nsystems & development Chairperson\n* Digital Empowerment of Citizens\n¢ Universal Digital Literacy & Prime Minister\n© Universally accessible digital resources [A Monitoring Committe\ne All documents/ certificates are to be a\navailable on the cloud Minister of\nDigital India Communications and IT\n¢ Availability of digital resources/services Advisory Group\nin Indian languages\n. & Cobinet secretary\nP P ie Apex Committee\n¢ Portability of all entitlements through the\n\ncloud\n\nKey agencies enabling DI initiatives: Some of them include:\n\n* Controller of Certifying Authorities (CCA)\n\n* Centre for Development of Advanced Computing (C-DAC)\n\n* Centre for Railway Information Systems (CRIS)\n\n« Common Services Center (CSC)\n\n* Small Farmers Agribusiness Consortium (SFAC)\n® Some of the Key initiatives: Aadhar, Common Service Centres (cscs), Digi Locker, Digi Sevak, Bharat\n\nBroadband Network Limited, CERT-In, Centre of Excellence for loT, Cyber Swachhta Kendra etc.\n\nCopyright © by Vision IAS\n\nAll rights are reserved. No part of this document may be reproduced, stored in a retrieval system or\ntransmitted in any form or by any means, electronic, mechanical, photocopying, recording or otherwise,\nwithout prior permission of Vision IAS.\n\n\n15.2. SAMRIDH (STAR\n\nP ACCELERATORS OF MEITY FOR PROD\n\nINNOVATION, DEVELOPMENT AND GROWTH) PROGRAMME\n\n> auick Facts\n\n°\n\nPurpose: To create a conducive platform to Indian Software Product start-ups to enhance their products\nand securing investments for scaling their business.\n\nFocus: Accelerating the 300 start-ups by providing customer connect, investor connect, and international\nimmersion in next three years (from 2021).\n\nFinancial assistance: Investment of up to Rs 40 lakh to the start-up will be provided through selected\naccelerators.\n\nImplementing agency: MeitY-Startup-Hub (MSH)\n\nTo support existing and upcoming accelerators to select and accelerate potential IT based start-ups to\nscale for solving India’s problems creating positive social impact.\n\nalient Features\n\nBackground: Government of India has various programs to promote incubation services to startups, but\n\nan urgent need was felt to conceptualize and run an accelerator program to help these start-ups with\n\nSocial Impact and to solve India’s problems at scale.\n\n+ The Startups from aforementioned programs will act as a feeder for the SAMRIDH program.\n\nSupport to accelerator: The SAMRIDH scheme will support existing and upcoming Accelerators to select\n\nand accelerate potential IT based startups to scale for solving India’s problems creating positive social\n\nimpact.\n\n* Startup accelerators support early-stage, growth-driven companies through education, mentorship,\nand financing.\n\nEligibility of Accelerators:\n\n« Have been in the business of incubation for more than 3 years and supported more than 50 start-\nups of which at least 10 have received non-public investment, Or\n\n° Having targeted accelerator programs with an experience of running at least 3 cohorts with\nactivities listed as desirable under SAMRIDH\n\n« Have operations in India\n* Have necessary space and infrastructure to carry out activities for the start-ups.\n+ Should demonstrate capabilities with regard to:\n¢ Supporting Start-Ups for domestic and international market immersion\n° Network/Connect with Venture Capitalist/Angel Investors\n¢ On-boarded with leading business mentors\n* Structured cohort for accelerating deep tech software product start-ups.\n\n® Support mechanism\n\n+ MSH will take equity in Start-Ups for Government's contribution via Promissory/SAFE Note, same as\naccelerator which will be utilized for self-sustainability of the program.\n\n« AProject Management Unit will be formed for the overall implementation of the program.\n\n* MSHis a nodal entity under MeitY to facilitate its vision of promoting technology innovation, start-ups\nand creation of intellectual Properties.\n\n+ It acts as a national coordination, facilitation and monitoring centre to integrate all the incubation\ncentres, start-ups and innovation related activities of MeitY.\n\n15.3. NATIONA PERCOMPUTING MISSION _*\"@\n\nQuick Facts\n\nPurpose: Developing indigenous supercomputing ecosystem of the nation\nInter-ministerial initiative: MeiTY and the Department of Science and Technology (pst)\nExpected benefit: Accelerate R&D activities in multidisciplinary domains of science and engineering\n\nImplementing Agencies: Centre for Development of Advanced Computing (C-DAC) and Indian Institute\nof Science (IISc), Bangalore.\n\nef @\n\nObjective\n\ni\n\nTo build and deploy 24 facilities with cumulative compute power of more than 64 Petaflops.\n\nSalient Features\n\n|\n\nBackground\n\n« Launched in 2015 and envisages empowering our national academic and R&D institutions by\ninstalling a vast supercomputing grid comprising of more than 70 high-performance computing\n(HPC) facilities.\n\n+ These supercomputers will also be networked on the National Supercomputing grid over the National\nKnowledge Network (NKN).\n\n¢ The NKN is another programme of the government which connects academic institutions and\nR&D labs over a high speed network.\n\n(4pittars of vse )\nes 3 S\n\n\n® Server developed: C-DAC has designed and developed a computer server “Rudra” and high-speed\ninterconnect “Trinetra” which are the major sub-assemblies required for supercomputers.\n\n® Large-scale applications being developed under NSM\n« NSM Platform for Genomics and Drug Discovery.\n* Urban Modelling: To Address Urban Environment Issues (Meteorology, Hydrology, Air Quality).\n+ Flood Early Warning and Prediction System for River Basins of India.\n+ HPC Software Suite for Seismic Imaging to aid Oil and Gas Exploration.\n« MPPLAB: Telecom Network Optimization.\n* About FLOPS (Floating-point OPerations per Second): It is a common benchmark measurement for\nrating the speed of microprocessors.\n+ AMegaFLoPs is equal to one million FLOPS.\n* AGigaFLOPS is equal to one billion FLOPS.\n+ ATeraFLOPS is equal to one trillion FLOPS.\n+ A PetaFLOPS can be measured as one thousand teraflops.\n© First Indian supercomputer was PARAM 8000.\ne000\n\n15.\n\n. PRODUCTION LINKED INCENTIVE (PLI) 2.0 FOR IT HARDWA\n\n@ Quick Facts\n\n® Purpose: To boost domestic manufacturing and attract large investments in the value chain\n@ Type: Central Sector Schemes\n\ne Incentive Period: 6 years during the Scheme tenure\n\n* Project Management Agency: Industrial Finance Corporation of India (IFC!)\n\nThrough financial incentives boost domestic manufacturing and attract large investments in the value chain.\n\n® Salient Features\n\n® Background: PL! 2.0 Scheme for IT hardware doubled the outlay while also enhancing the incentive and\ntenure as compared to PLI 1. 0 (launched in 2021).\n+ It was launched to provide more flexibility to applicants and allow a longer duration to develop the\nsupply chain within the country.\n© 3category of applicants\n* Global companies\n* Hybrid (global/domestic) companies\n\n« Domestic companies.\n\na\n\nLaptops, Tablets All in-One PCs Servers Ultra Small Form Semiconductor design,\nFactor (USFF) IC manufacturing, and\npackaging\n\n© Eligible Product: Goods manufactured in india and covered under target segment. Incentive shall be\ngiven on the sales of Target Segment Goods.\n\n* Incentives: Around 5% on net incremental sales over base year.\n* Monitoring: Empowered Group of Secretaries (EGoS) chaired by the Cabinet Secretary.\n\n15.5. PRODUCTION LINKED INCENTIVE (PLI) SCHEME ™§\nFOR LARGE SCALE ELECTRONICS MANUFACTURING\n@) Quick Facts\n\nType: Central Sector Scheme\n\nPurpose: To boost domestic manufacturing and to become global champions in electronics manufacturing\nNodal Agency: Project Management Agency (PMA)\n\nTenure: For round two, tenure is 4 years applicable from 01.04.2021\n\nTo attract large investments in the electronics value chain including manufacturing of mobile phones,\nsemiconductor packaging and electronic components including Assembly, Testing, Marking and Packaging\n(ATMP) units.\n\n> salient Features\n\n® Eligibility: Support under the Scheme shall be provided only to companies engaged in manufacturing of\ntarget segments in India.\n\nIncentive: The Scheme shall extend an incentive of 4% to 6% on incremental sales (over base year) of\ngoods manufactured in India and covered under target segments, to eligible companies, for a period of\nfive (5) years subsequent to the base year.\n\nTarget Segment: Mobile phones and specified electronic components.\n\nere? ©\n\n.\n\n* Base Year: Financial Year 2019-20 shall be treated as the base year for computation of incremental\ninvestment and incremental sales of manufactured goods\n\n1 OTHER SCHEMES/INITIATIVES _\n\nJeevan Pramaan\n\n* Objective: To facilitate on-line submission of Life Certificate by pensioners and\nstreamline the process of getting a Life certificate.\n\nIntended beneficiary: Pensioners of Central Government, State Government or any\nother Government organization.\n\nHow to get Jeevan Pramaan Certificate?\n\n© Visit any Post Office near you ar avail the services through Postmon\n\n@ Provide basic details related to your pension account\n© Pension ID © Pension Payment Order\n© Pension Disbursing Department © Bank Account details\n© Mobile Number © Aadhaar Number\n\n@> Authorize your request with biometric fingerprint scan\n\n@ Digital life certificate will be instantly generated with Pramaan ID sent to you on your mobile. Your\nCertificate details will be automatically updated with Pension Department.\n\n* Other features\n\n+ It is AADHAR Biometric Authentication based digital life certificates (DLCs) for\nPensioners.\n\n+ Itis intended do away with the requirement of a pensioner having to submit a\nphysical Life Certificate in November each year, in order to ensure continuity of\npension.\n\n* It can be obtained through various Jeevan Pramaan Centres which are being\noperated by CSCs, Banks, and Government offices or by using the client\napplication on any PC/ mobile/tablet.\n\n\nSoftware\nTechnology Parks\nof India (STP!)\n\nScheme for\nPromotion of\nManufacturing\n\nof Electronic\nComponents and\nSemiconductors\n(SPECS)\n\nPradhan Mantri\nGramin Digital\nSaksharta\nAbhiyaan\n(PMGDISHA)\n\n* Background: STP! was set up in 1991 as an autonomous society under the MeitY.\n\nae\nWe\n\nIncubation Training and Statutory Data\nfacilities value-added services communication\n\nConsultancy STPI Co-location Information\nservice Services Technology\nAudit Service\n\n® Objective: Promotion of software exports from the country.\n* Key Features\n* STPl acts as ‘single-window in providing services to the software exporters.\n+ STPI has been implementing the Software Technology Park (STP) scheme and\nthe Electronics Hardware Technology Park (EHTP) scheme for the promotion of\nIT/ITES industry.\nObjective: Offset the disability for domestic manufacturing of electronic\ncomponents and semiconductors in order to strengthen the electronics\nmanufacturing ecosystem in the country.\nEligibility: Entity registered in India and applicable to investments in new units as\n\nwell as expansion of capacity/ modernization and diversification of existing units.\nKey features: The scheme provides financial incentive of 25% on capital\nexpenditure for the identified list of electronic goods that comprise downstream\nvalue chain of electronic products, i.e, electronic components, semiconductor/\ndisplay fabrication units, ATMP units, etc.\n\n* Objective: Making one person in every family digitally literate\n\nEligibility Criteria: The eligible households can nominate one person from their\nfamily.\n\nAge: 14 to 60 years\n\nCourse Duration: 20 Hours (Minimum 10 Days and Maximum 30 Days)\n\nMedium of instruction: Official Languages of India\n\nPlace of Learning: Nearest Training Centre/ Common Service Centre (CSC).\n\nEvaluation: Independent external evaluation conducted by a National level\ncertifying agency like NIELIT, NIOS, IGNOU, etc.\n\n?\n\nef ef @ @\n\nStree Swabhiman\n\n® tis striving to create a sustainable model for providing affordable and accessible\nsanitary products close to the homes of adolescent girls and women in rural areas\n\n\nElectronics\nDevelopment\nFund (EDF) policy\n\nType: Central Sector Scheme\n\nObjectives: Creating an electronics industry ecosystem by supporting a vibrant\necosystem of innovation, Research and Development (R&D) with active industry\ninvolvement.\n\nEDF is setup asa “Fundof Funds” to participate in professionally managed “Daughter\nFunds” which provide risk capital to companies developing new technologies in\nthe area of Electronics, Nano-electronics and Information Technology (IT).\n\nThis fund is fostering R&D and innovation in these technology sectors.\n\nModified\nElectronics\nManufacturing\nClusters (EMC\n2.0) Scheme\n\nGyan Circle\nVentures\n\nObjective: Providing support for creation of world class infrastructure for attracting\nmajor global electronics manufacturers along with their supply chain to set up\nunits in the country.\n\nThis Scheme will fortify the linkage between domestic and international market by\nstrengthening supply chain responsiveness, consolidation of suppliers, decreased\ntime-to-market, lower logistics costs, etc.\n\nThe EMC 2.0 Scheme provides financial assistance for setting up of both EMC\nprojects and Common Facility Centres (CFCs) across the country.\n\nGyan Circle Ventures (Centre for Innovation and Entrepreneurship Development at\nITS (CIEDI), a Section 8 Company) is the Technology Business Incubator of IIT Sri\nCity.\n\nThe center is funded under TIDE 2.0 as a Group 2 Centre to promote deep-tech\nentrepreneurship through financial and technical support to incubators engaged\nin using emerging technologies such as IoT, Al, Block-chain, etc.\n\nAim: ‘Digital Empowerment’ of citizen by providing access to authentic digital\ndocuments to citizen’s digital document wallet.\n\n(Fina Documents based on Categories )\n\nCentral State Ministry of Transport\nGovernment Government Defenc Departments\n\nt\n\nove\n\nBanking and Health & Other Most Popular\nInsurance Wellness Organisations Documents,\n\nDigiLocker is a secure cloud based platform for storage, sharing and verification of\ndocuments & certificates.\n\nIndian citizens who sign up for a DigiLocker account get a dedicated cloud storage\nspace that is linked to their Aadhaar (UIDAI) number.\n\nThe issued documents in digilocker system are deemed to be at par with original\nphysical documents as per Rule 9A of the Information Technology (Preservation\nand Retention of Information by Intermediaries providing Digital Locker facilities)\nRules, 2016\n\n\nRegister i Fetch your\nYourself Documents\n\nUMANG\n(Unified Mobile\nApplication\n\nfor New-Age\nGovernance)\n\nDigishala\n\nCyber Surakshit\nBharat Initiative\n\n© UMANG is one of the key initiatives TARNESsING THE POWER OF DIGITALINDIA\nunder the Digital India program FOR GOOD GOVERNANCE\nto develop a common, unified | umanoappiaunchedto evonationze the way ctizens avail\nplatform and mobile app to | ~~\"\n\nfacilitate a single point of access (Bs to 162 services of 33 departments & 4\n\nto all government services.\n\nIts primary aim is to abridge & a\n\ninconvenience faced by users in mobile, gas & water\n\nmanaging multiple mobile apps\n\nand facilitate a one-stop-solution JBM, \\ supports 18 indian languages and caters to\nto avail varied government onvdomen sealabity\n\nservices.\n\n| Will soon support feature phones without internet\n/ connectivity through USSD\n\n« A free Doordarshan DTH channel to educate and inform the peo,\nvarious modes of digital payments.\n\n* Aim: to educate the Chief Information Security Officers’ (CISOs) and broader\n1T community across all government departments to defend their digital\ninfrastructures and become future-ready in tackling cyber-attacks.\n\ne Itisa training programme and first public-private partnership of its kind.\n\n« The founding partners include leading IT companies such as Microsoft, Intel, and\nWIPRO.\n\n* Its knowledge partners include CERT-In, NIC, NASSCOM and consultancy firms\nDeloitte and EY.\n\nSecure, Scalable\n& Sugamya\nWebsite asa\nService (S3Waas)\n\n \\Itisamechanism to connect the government directly with citizens across India by\nrunning mailer, outbound dialing and SMS campaigns.\n« The platform is used for sharing informational and public service messages.\n\n* e-Sampark signifies the essence of Digital India. It enables the government to\ncommunicate with the citizens about several programs and initiatives.\n\n* It is an online service developed for government entities to generate Secure,\nScalable & Sugamya websites.\n\nIt enables government entities to choose from various themes for generating\nwebsites as well as customizing and managing the content without any technical\nknow-how.\n\n* Itis Designed, Developed, Hosted and Maintained by National Informatics Centre\n(Nic).\n\n\no os\nLogin at S3Waas Make Site Live\nLogin with official Select theme for || Get your site live\nemail address Select theme for your feature ‘and share it with\n\n(gov.in or nic.in) your feature Website Details, requirement the public\nrequirement Technical Owner\n\nDetails and Site\nOwner Details\n\nGI Cloud -— The National Informatics Centre (NIC) is providing National Cloud services under\n\nMeghRaj the initiative MeghRaj. The services offered are as follows.\n\n+ Infrastructure as a Service (laaS): laaS provides you basic virtual computer\ninfrastructure resources like CPU, Memory, Disk Storage attached to blank VMs\nwith allowing you to install OS, using ISOs, from scratch and customization.\nPlatform as a Services (PaaS): PaaS provides pre-installed web and database\nservers so that you can publish and run web application without worrying\nabout server setup. The servers are pre-configured ready with basic security\n\nhardening.\n\nSoftware as a Services (SaaS): This provides on demand software service. SaaS\nis a software delivery model where users are not responsible for supporting the\napplication or any of the components.\n\nStorage as a Service (STaaS): STaaS provides need based storage solution. It\nprovides excellent alternative to the traditional on-site and dedicated storage\nsystems and reduces the complexities of deploying and managing multiple\nstorage tiers.\nHosting Environments: NIC Cloud Services provides 3 different types of\nenvironment for creating virtual machines ie. Production, Staging and\nDevelopment so that you keep your VM segregated and manage them properly\nbased on the business need for both Paas as well as laaS service model.\nNational NIC-CERT Division is the nodal arm of National Informatics Centre (NIC) for\nInformation managing the cyber security incidents.\nCentre-~Computer NIC-CERT acts as a single point of contact and co-ordinate with concerned\nEmergency stakeholders for cyber security incidents targeted at NIC Infrastructure.\n(meee) It undertakes measures to issue periodic threat intelligence, Security Alerts/ Tips\nZ and advisories to safeguard NIC’s assets against cyber threats.\n\nProject Cyber Launched by: Microsoft & Data Security Council of India (DSc!)\nShikshaa Aim: Skilling women engineering graduates in the niche field of Cyber Security.\n\n\nVisvesvaraya\nPhD Scheme for\nElectronics and IT\nPhase-ll\n\nObjective: Enhancing the number of PhDs in the Electronic System Design and\nManufacturing (ESDM) and IT/IT Enabled Services (ITES).\n\nTenure: 9 years from 2021\n\nThe scheme will support 1000 Full Time PhD candidates, 150 Part Time PhD\ncandidates, 50 Young Faculty Research Fellowships and 225 Post-Doctoral\nFellowships.\n\nThe scheme will have a provision for one time support to 250 Full time PhD fellows for\n6 months to facilitate visits to labs abroad, to broaden their research perspective.\nInstitutions eligible: All IITs, NITS, IISc, IISERs, Central Universities, Deemed Universities,\nPrivate Universities, Private Deemed Universities, etc.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 16,
                "chapter_name": "16. MINISTRY OF ENVIRONMENT,\nFOREST AND CLIMATE CHANGE\n(MOEFCC)",
                "chapter_path": "./screenshots-images-2/chapter_16",
                "sections": [
                    {
                        "section_id": 16.1,
                        "section_name": "16. MINISTRY OF ENVIRONMENT,\nFOREST AND CLIMATE CHANGE\n(MOEFCC)",
                        "section_path": "./screenshots-images-2/chapter_16/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_16/section_1/0b5641d3-c2f3-4c09-984f-c500b69d5900.png",
                            "./screenshots-images-2/chapter_16/section_1/f5647411-7b27-4e43-b5e4-f18fbdc1c279.png",
                            "./screenshots-images-2/chapter_16/section_1/5a1c0d94-ade4-4f6e-b5a3-1ee03ee2c736.png",
                            "./screenshots-images-2/chapter_16/section_1/de4d4662-0f45-4b60-a615-0f9d47c0890f.png",
                            "./screenshots-images-2/chapter_16/section_1/a27e2c8b-e4ac-4f79-b457-f182ce577213.png",
                            "./screenshots-images-2/chapter_16/section_1/fa3a847e-4075-4163-a3f2-84b7abae71cf.png",
                            "./screenshots-images-2/chapter_16/section_1/e69616d9-5571-4da2-8072-0739ab2249f4.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "16.1. SECURE HIMALAYA (SECURING LIVELIHOODS, CONSERVATION,\nSUSTAINABLE USE AND RESTORATION OF HIGH RANGE HIMALAYAN\nECOSYSTEM) PROJECT\n\no) Quick Facts\n\n® Purpose: Securing livelihoods, conservation, sustainable use and restoration of high range Himalayan\necosystems\n\nInternational support: Global Environment Facility (GEF) and UNDP\nTenure: 2017-2024\nPartnering agency: TRAFFIC\n\nObjective\n\nTo ensure conservation of locally and globally significant biodiversity, land and forest resources in high\nHimalayan ecosystem.\n\nSalient Features\n\nGlobal project: SECURE Himalaya project is a part of “Global Partnership on Wildlife Conservation\nand Crime Prevention for Sustainable Development” (Global Wildlife Program) funded by the Global\nEnvironment Facility (GEF).\n\n+ It contributes to the Global Snow Leopard Ecosystem Protection Program (GSLEP), a joint initiative of\n12 range country governments, international agencies, civil society, and the private sector.\n\n* Sustainable conservation: The project promotes sustainable management of alpine pastures and\nforests in the high range Himalayan ecosystems.\n\n+ Itfacilitates securing conservation of globally significant wildlife, including endangered snow leopard\nand their habitats.\n\n* Areacovered\n* Selected high altitude landscapes in the Trans- and Greater Himalayan regions which includes:\n@ Changthang (Jammu and Kashmir)\n@ —Lahaul-Pangi and Kinnaur (Himachal Pradesh)\n@ Gangotri-Govind and Darma-Byans Valley in Pithoragarh (Uttarakhand)\n\n* Kanchenjunga-Upper Teesta Valley (Sikkim)\n\nConservation of key Securing sustainable Establishment of Knowledge,\nareas and their community livelihoods and monitoring and cooperation advocacy, communication\neffective management natural resource to reduce wildlife crime and and information systems\nrelated threats\n\n@ Three pronged strategy: The scheme follows following strategies:\n« Providing alternate and new livelihood options\n* Enhancing existing livelihoods\n* Supporting skill-based employment opportunities\n\n16.2. NATIONAL ACTION PLAN ON CLIMATE CHANGE .\n\nQuick Facts\n\n|\n\nType: Central Sector Scheme\n\nPurpose: To adapt to climate change and enhance the ecological sustainability of India's development\npath.\n\nTenure: Upto 2025-26\n\nImplementing Agency: Missions are institutionalised by “respective ministries” and coordinated by Prime\nMinister's Council on Climate Change\n\nObjective\n\ni\n\nTo enable the country to adapt to climate change and enhance the ecological sustainability of India’s\ndevelopment path.\n\n2\n\n® Background: The NAPCC was released in 2008. The NAPCC identifies measures that promote development\nobjectives while also yielding co-benefits for addressing climate change effectively.\n\nwn\no\n\nnt Features\n\nha\n.> E\\s\n\nAchieving national Efficient and cost- Deployment of New and innovative Unique linkages - with\ngrowth and poverty || effective strategies for appropriate market, regulatory, and | | civil society, LGUs, and\nalleviation end-use demand-side technologies for _| | voluntary mechanisms public-;\nmanagement adaptation and for sustainable partnerships\nmitigation development\n\nThere are eight National Missions on climate change\n\n* National Solar Mission: To achieve 280GW of installed solar capacity by 2030\n\n® National Mission for Enhanced Energy Efficiency (NMEE): To strengthen the market for energy efficiency\nby creating conducive regulatory and policy regime.\n\nNational Mission on Sustainable Habitat: Improvements in energy efficiency, Management of Municipal\nSolid Waste (MSW), and Promote urban public transport.\n\n* National Water Mission: Conserving water, ensuring more equitable distribution through integrated water\nresource management and facilitating water use efficiency by 20%\n\n* National Mission for Sustaining the Himalayan Eco-system (NMSHE): Empowering local communities\nespecially Panchayats to play a greater role in managing ecological resources\n\n* National Mission for a Green India (NMGI): Enhancing ecosystem services such as carbon sinks. It is to be\nimplemented on degraded forest land through Joint Forest Management Committees set up under State\nDepartments of Forest.\n\n* National Mission for Sustainable Agriculture (NMSA): To make Indian agriculture more resilient to climate\nchange by identifying new varieties of crops, especially thermal resistant ones and alternative cropping\npatterns\n\nNational Mission on Strategic Knowledge for Climate Change: Strives to work with the global community\nin research and technology development and will also have its own research agenda supported by a\nClimate Research Fund\n\nOTHER SCHEMES/INITIATIV! ‘\n\nEnvironmental Itis one of the Central Sector sub- schemes being implemented in alignment with\nInformation Mission LiFE.\n\nAwareness Program is dedicated to raising awareness, building capacity, and promoting\n\nCapacity Building sustainable actions among individuals and communities across India.\n\nand Livelihood\nProgramme\n(EIACP)\n\nItencompasses the best functional aspects of erstwhile Environmental Information\nSystem (ENVIS) Scheme.\n\n\nNational Clean\n\nAim: To meet the prescribed annual average ambient air quality standards at all\n\nAir Programme locations in the country in a stipulated timeframe.\n(Ncap) Target: To achieve reduction in Particulate Matter (PMIO) levels up to 40% or\nachievement of national standards (60 microgram/cubic meter) by 2025-26 (base\nyear 2017)\nCoverage: 131 cities of 24 States.\nAugmenting Air Quality Air Quality Indoor Air Pollution National Emission\nMonitoring Network || Management Plan for Monitoring & Inventory\n100 Non-Attainment Management\nCities\ne=o=]\nSao\nIs)\nTechnology Network of Technical || *PRANA* - Portal for\nAssessment Cell Institutions Regulation of\nAir-pollution in\nNon-Attainment cities\nClimate Aim: To mitigate climate change impacts and enhance adaptive capacity as well\nResilience as counter the adverse environmental impacts that arise from stubble burning.\nBuilding among The project has been launched under the National Adaptation Fund for Climate\nFarmers through Change (NAFCC) to tackle Stubble Burning.\nCrop Residue\n\nManagement\nGreen Skill\nDevelopment\nProgramme\n(GspP)\n\nIndia Cooling\nAction Plan\n(ICAP)\n\nCoverage: Punjab, Haryana, Uttar Pradesh and Rajasthan.\n\nAim:To develop green skilled workers having technical knowledge andcommitment\nto sustainable development.\n\nIt has been conceptualised and developed by MoEF&CC in consultation with the\nNational Skill Development Agency (NSDA).\n\nAll courses are National Skills Qualifications Framework (NSQF) compliant.\nIt is utilising the vast network and expertise of Environmental Information System\n\n(ENVIS) Hubs/ Resource Partners (RPs).\n\nGSDP-ENVIS is a mobile app to boost employability and entrepreneurship of the\nyouth in the country.\n\nAim: To provide sustainable cooling and thermal comfort for all while securing\nenvironmental and socio-economic benefits for the society.\n\n\nINDIA'S COOLING ACTION PLAN\n\nOBJECTIVES FOR 2037-38\n\n~ Reduction of cooling demand\n20%-25% | Gcross all sectors 9\n\n25%-30% | Reduction of refrigerant demand\n\nReduction of cooling ener;\n25%-40% | requirements 9 sy\n\nTraining and certification of\n100,000 | servicing sector technicians by\n\nThelCAP provides anintegrated visiontowards coolingacrosssectorsencompassing\ninter ALIA reduction of cooling demand, refrigerant transition, enhancing energy\nefficiency and better technology options with a 20 year time horizon.\n\nThis will also help in reducing both direct and indirect emissions.\n\nPARIVESH\n\nIntegrated\n\nDevelopment of\nWildlife Habitats\n\nPARIVESH (Pro-Active and Responsive facilitation by Interactive, Virtuous and\nEnvironmental Single-window Hub) is an environmental single window hub for\nEnvironment, Forest, Wildlife and CRZ clearances.\n\nIt automates the entire process of submitting the application and tracking the\nstatus of such proposals at each stage of processing.\n\nType: Centrally Sponsored Scheme\n\nFinancial assistance is provided to State/UT Governments for protection and\nconservation of wildlife and its habitats in Protected Areas (PAs) as well as outside\nPAs and also for the recovery programmes of the critically endangered species.\n\nComponents of the scheme\n\nto Protected Areas Protection of Wildlife Outside Recovery programmes for\n{Nationel Parks, Wildlife Protected Areas saving critically endangered\nSanctuaries, Conservation species and habitat.\nReserves and Community\nReserves)\n\n\nNational Mission\non Himalayan\n\nType: Central Sector Scheme\nAim: Conservation and sustainable management of natural resources in Indian\n\nStudies (NMHS) Himalayan Region (IHR)\n\nFocus: Enhancing livelihoods of local communities, in line with the National\n\nEnvironment Policy, 2006\n\nImplementing Agency: Himalayan Knowledge Network (HKN)\n\n{ sft |\n; SH\n‘Skill Development and || Handling of Hazardous Infrastructure\nCapacity Building Substances Development\nWater Resource Biodiversity\nManagement Conservation and\nEnvironment Type: Central Sector scheme\nEducation Aim: To promote environmental awareness and mobilize students’ participation for\nAwareness and environment conservation.\nTraining (EEAT) Major programmes:\n\n* National Green Corps (NGC) Programme: More than | lakh Eco-clubs have been\nformed in schools and colleges to educate students and to spread awareness\non environmental issues.\n\n+ National Nature Camping Programme (NNCP): Organization of field visits/\nnature camps in different Protected Areas/ Nature Parks/ Tiger Reserves of the\ncountry for students.\n\nLeadiT Background: Launched at the UN Climate Action Summit, 2019\n\n(Leadership Aim: To help guide the world’s hard to-decarbonize and energy-intensive sectors/\nfor Industry industries toward the low-carbon economy.\n\nTronekion) Launched by: India and Sweden together with some other countries.\n\nSupported by: World Economic Forum\n\nLeadIT gathers countries and companies that are committed to action to achieve\n\nthe Paris Agreement.\n\nLeadiT members subscribe to the notion that energy-intensive industry canand must\n\nprogress on low-carbon pathways, aiming to achieve net-zero carbon emissions.\n\nColombo itis a roadmap for action on nitrogen challenges proposed by Sri Lanka in 2019 and\nDeclaration on endorsed by the United Nations member states. It seeks to halve nitrogen waste\nSustainable by 2030.\n\nNitrogen It has been developed with the technical support of the International Nitrogen\nManagement Management System (INMS), a joint activity of the UNEP and the International\n\nNitrogen Initiative supported by the Global Environment Facility (GEF).\n\n\nNagar Van Yojana\n(nvy)\n\nIt was launched in 2020, on World Environment Day (5th June).\n\nItenvisages developing 400 Nagar Vans and 200 Nagar Vatikas in the country during\n\nthe period of 2020-21 to 2024-25.\n\nObjective: To significantly enhance the tree outside forests and green cover,\n\nenhancement of biodiversity and ecological benefits to the urban and peri-urban\n\nareas apart from improving quality of life of city dwellers.\n\nUnder the scheme\n\n+ These forests will come up either on existing forest land or on any other vacant\nland offered by urban local bodies.\n\n* Van Udyan once established will be maintained by the State Government.\n\nThe scheme is fully funded under CAMPA (Compensatory Afforestation Fund Act,\n\n2016) funds.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 17,
                "chapter_name": "17. MINISTRY OF EXTERNAL\nAFFAIRS",
                "chapter_path": "./screenshots-images-2/chapter_17",
                "sections": [
                    {
                        "section_id": 17.1,
                        "section_name": "17. MINISTRY OF EXTERNAL\nAFFAIRS",
                        "section_path": "./screenshots-images-2/chapter_17/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_17/section_1/00d8e88f-b9da-4056-8aa7-8cf682ba8ac9.png",
                            "./screenshots-images-2/chapter_17/section_1/d74b315f-4bc9-49a3-bf3f-2da9d7410cb7.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "17.1. OTHER SCHEMES/INITIATIV\n\nKnow India\nProgramme (KIP)\n\n.\n\nAim: Acquainting Indian diaspora with the transformational changes taking place\nin India.\n\nIt is a three-week orientation programme for diaspora youth conducted with a\nview to promote awareness on different facets of life in India and the progress\nmade by the country in various fields e.g. economic, industrial, education, science\n& technology, etc.\n\nEligibility: Youth (aged between 18-30 years) of Indian origin (excluding non-\nresident Indians) from all over the world having graduation from a recognized\nUniversity/institute or enrolled for graduation and ability to speak in English.\nPreference: To Person of Indian Origin (PIO) from Girmitiya countries (Mauritius, Fiji,\nSuriname, Guyana, Trinidad &Tobago, South Africa and Jamaica).\n\nPravasi Kaushal\nVikas Yojana\n(PKvy)\n\nObjective: Training and certification of Indian workforce keen on overseas\nemployment in select sectors and job roles, in line with international standards.\nMinistries: MEA in partnership with the Ministry of Skill Development &\nEntrepreneurship.\n\nImplementing Agency: National Skill Development Corporation (NSDC)\n\nThe short-term program (of 2 weeks to one month) involves training candidates\nin suitable skill sets which address the requirements in communication, trade\nspecific knowledge and skills along with cultural orientation.\n\nIndian Technical\n\nand Economic\nCooperation\nProgramme\n(iTEc)\n\nInstituted in 1964, ITEC is one of the oldest institutionalized arrangements for\ninternational capacity building.\n\nitis a demand-driven, response-oriented programme that focuses on addressing\nthe needs of developing countries through innovative technological cooperation\nbetween India and the partnering nation.\n\nAlthough it is essentially a bilateral programme, its resources have also been\nused for financing trilateral and regional undertakings such as with the Economic\nCommission for Africa, UNIDO and G-77.\n\nIt offers nearly 10,000 fully-funded in-person training opportunities at 100+\neminent institutes in India each year.\n\nitis administered by the Development Partnership Administration-II Division of the\nMEA.\n\n\ne-VidyaBharati\nAarogyaBharati\n(e-VBAB)\n\nNetwork Project\n\n@ITEC (for online trainings using\n\nITEC-Executive (short-term ITEC-Onsite and ITEC-\ndigital delivery platforms)\n\npolicy-focused, in-person (onsite capacity building\n\ntrainings for senior assignments carried out by\ngovernment executives) Indian experts)\n\nIt was launched to offer free of cost tele-education and tele-medicine services to\nAfrican countries.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 18,
                "chapter_name": "18. MINISTRY OF FINANCE",
                "chapter_path": "./screenshots-images-2/chapter_18",
                "sections": [
                    {
                        "section_id": 18.1,
                        "section_name": "18. MINISTRY OF FINANCE",
                        "section_path": "./screenshots-images-2/chapter_18/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_18/section_1/f0a9e64f-1bf9-4e68-af8f-6ab4a70d5235.png",
                            "./screenshots-images-2/chapter_18/section_1/e0daccd6-2af1-4b95-af24-493fc203eb15.png",
                            "./screenshots-images-2/chapter_18/section_1/aa8d9eee-6648-4ba3-9a8d-bdd6081c1961.png",
                            "./screenshots-images-2/chapter_18/section_1/d870cba4-905c-4d68-80ae-8a74a982029e.png",
                            "./screenshots-images-2/chapter_18/section_1/a30f8d85-b2ee-455a-8310-b17221bca39e.png",
                            "./screenshots-images-2/chapter_18/section_1/1a132692-8797-4a2e-9d0a-5505036c21fc.png",
                            "./screenshots-images-2/chapter_18/section_1/b15bb60a-6934-4481-a29e-a0f071a6f85a.png",
                            "./screenshots-images-2/chapter_18/section_1/55ff498a-64a8-400c-880f-375ce2af59f2.png",
                            "./screenshots-images-2/chapter_18/section_1/01065c38-3dfb-4c20-aee9-1e8a27aa5064.png",
                            "./screenshots-images-2/chapter_18/section_1/d8a22716-28cd-4979-8e28-4932a31e3484.png",
                            "./screenshots-images-2/chapter_18/section_1/9aceeece-4920-4e1b-841b-36bcfaef2811.png",
                            "./screenshots-images-2/chapter_18/section_1/aef6cca5-0841-472a-99d1-2e1263347402.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "18.1. PRADHAN MANTRI JAN DHAN JANA (PMJDY) -\nNATIONAL MISSION FOR FINANCIAL INCLUSION\n\n> auick Facts\n\n|\n\nPurpose: To ensure access to financial services like Banking, Remittance, Credit, Insurance, Pension in an\naffordable manner.\n\nOverdraft facilities: Rs. 10,000\nAccident Coverage: Rs. 2 lakhs\nFocus: Every Unbanked Adult\n\nObjective\n\ni\n\n* Ensure access of financial products & services at an affordable cost.\n* Use of technology to lower cost & widen reach.\n\nSalient Features\n\nHh\n\n* Background: Launched in 2014, the PM JDY is a National Mission for Financial Inclusion.\n* Basic Tenants of Scheme:\n\n* Banking the unbanked - Opening of basic savings bank deposit (BSBD) account with minimal\npaperwork, relaxed KYC, e-KYC, account opening in camp mode, zero balance & zero charges.\n\n* Securing the unsecured - Issuance of Indigenous Debit cards for cash withdrawals & payments at\nmerchant locations, with free accident insurance coverage of Rs. 2 lakhs.\n\n+ Funding the unfunded - Other financial\n\nproducts like micro-insurance, overdraft Pradhan Mantri Jan Dhan 2\nfor consumption, micro-pension & micro- Yojana (PMJDY) pension scheme t\n\n‘ension scheme for\ncredit. aay as a 8) Unorganized Sector\n* Approach Basic saving bank\n\n* Accounts opened are online accounts in Account with\ncore banking system of banks. . antee\\ \\ OF PMJDY Orne tocoow!\n\n+ Inter-operability through RuPay debit Eligible adult\n\nFinancial literacy ( £3) Micro-insurance\n\ncard or Aadhaar enabled Payment System Program Financial literacy\n(AePs). Program\n\n\n« Fixed-point Business Correspondents\n+ Simplified Kyc / e-KYC in place of cumbersome KYC formalities.\n\n® RuPay Card Insurance: Free accidental insurance cover on RuPay cards increased from Rs. 1 lakh to Rs. 2\nlakhs for PMJDY accounts opened after 28.8.2018.\n\nOverdraft facilities: OD upto Rs 2,000/- (without conditions) and upper age limit for OD is 65 years.\nOperative PMJDY Accounts: As per extant RBI guidelines, a PMJDY account is treated as inoperative if\nthere are no customer induced transactions in the account for over a period of two years.\n\n® Jan Dhan Darshak App: A mobile application, was launched to provide a citizen centric platform for\nlocating banking touch points such as bank branches, ATMs, Bank Mitras, Post Offices, etc. in the country.\n\n. . Micro Units\nPradhan Mantri Pradhan Mantri\n. Atal Pension Yojana\nDirect Benefit J an ti Bima Sur Bi Development & ( ) y\n\nTransfer (DBT) Yojana (PMJJBY) Yojana (PMSBY) eee (MUSRAY\nscheme\n\nUKANYA SAMRIDDHI YOJANA (S: .\n\n@) Quick Facts\n\nPurpose: To promote the welfare of the girl child\n\nBackground: launched in 2015 as a part of the Beti Bachao Beti Padhao campaign.\nBeneficiaries: A girl child (a maximum of two girl children in one family)\nLimitation: Only one account can be opened in the name of a girl child.\n\nTo provide a smallinvestment for the girl, which is to be used to facilitate payment of education and marriage\nexpenses.\n\nef @\n\n* SUKANYA SAMRIDDHI ACCO\n\n\n> Salient Features\n\nAccount Opening: Account can be opened in Post Offices SUKANYASAMRIDDHIYOJANA ©”\nand notified branches of Commercial Banks. Saving for girl a\n\n“ Attractive\nchild’s J ®@ interest rates\n\nMaximum Account Per family: Account is opened in the | educational\nname of a girl child for upto two girl children in one family. | and marriage\n+ Exception for twins/triplets: Benefits could also be expenses\navailed for more than two in case of twins/triplets in the Premature la Gain tax\n\nfirst birth or the second birth. withdrawal benefits under\na - ‘allowed Section 80C of\n¢ However, if the first birth itself results in more than IT Act, 1961\ntwo girl children, girls born after the twins/triplets will Minimum Deposit- Rs.250\nnot be eligible to open Sukanya Samridhhi accounts. Maximum Deposit - Rs. 1.5 Lakh per year\nAccount portability: The account can be transferred Eligibility ~ Girl Child under 10 years of age\n\nanywhere in India from one post office/Bank to another.\nInterest Rate: Interest on balance (at rate notified by the government from time to time) will be calculated\non yearly compounded basis and credited to the account.\n\nMaturity of scheme: The account shall mature after 21 years from the date of opening or on marriage of the\ngirl child under whose name the account is opened, whichever is earlier.\n\nPremature closure of account: In the event of death of the account holder or where the Central Government\nis satisfied that continuation of the account is causing undue hardship to the account holder.\n\nPremature withdrawal: Once the girl child is 18 years old, she can make an early withdrawal of up to 50% of\nthe balance for higher education.\n\nOther benefits of Sukanya Samriddhi Account Scheme\n\n+ Even girl child can operate the account after she attains the age of 10 years.\n* Payment on maturity to girl child.\n\n+ Interest payment even after maturity if account is not closed.\n\n* Transferable anywhere in India.\n\n* Deposits may be made in the account till the completion of a period of fifteen years from the date of\nopening of the account.\n\nDocuments required for opening an account\n\n« Sukanya Samriddhi Account Opening Form.\n« Birth certificate of girl child\n\n«Identity proof (as per RBI KYC guidelines)\n\n+ Residence proof (as per RBI KYC guidelines)\n\n18.3 STAND UP INDIA SCHEME _\n\nQuick Facts\n\nPurpose: To empower every Indian & enable them to stand on their own feet”\nType: Central Sector Scheme\n\n* Enterprises covered: Greenfield enterprise in manufacturing, services, Agri-allied activities or the trading\nsector\n\n® Refinancing agency: Small Industries Development Bank of India (SIDBI).\n\nTo facilitate bank loans between Rs.10 lakh and Rs. 1 Crore to at least one SC or ST borrower and at least one\nwoman borrower per bank branch for setting up a Greenfield enterprise.\n\nSalient Features\n\n* Collateral free coverage\n\nEligibility\n+ To extend Collateral free coverage the government has set up\nCredit Guarantee Fund for Stand-Up India (CGFSI).\n\n‘SC, STor Woman Above 18\nLB years of age.\n+ However, Government does not allocate funds for loans under the\n\nScheme.\n\n@ Loan extending entity: Loans under the Scheme are extended by all Loans available for setting up\nGreen Field Projects.\n\nthe branches of the Scheduled Commercial Banks as per commercial\nparameters.\n* loan security: Besides primary security, the loan may be secured by ae o Snee are ee\ncollateral security or guarantee of CGFSI as decided by the banks. SJ, entrepreneur for a\nnon- individual enterprise.\n© Rate of Interest (Rol): Rol would be the lowest applicable rate of the\nbank for that category (rating category) not to exceed Bank's base Bonowers sheuld netbe in\nrate (MCLR) +3%+ tenor premium. default to any bank or financial\n* loan repayment: The loan is repayable in 7 years with a maximum institution.\nmoratorium period of 18 months.\n* Stand-up Connect Centres:\n* The Scheme also envisages extending handholding support to the potential borrowers.\n+ The offices of SIDBI and NABARD are designated as Stand-up Connect Centres, who will arrange for\nthe support required.\n\n*® Convergence with other scheme: This scheme also provides for convergence with Central/State\nGovernment scheme.\n\n‘Stand Up India Scheme Ecosystem eS\n\nes Rural Self-Employment Trainning institutes (RSETIS)\nBank Branch! Vocational Training Centers\nMSME Development Institutions\n\nBank Branch 2— 2 sf State SC/ST Development Financial Corporations\n—— 8 Industry Associations\n\nBank Branch 3 Lead District- [Districtindustriescenters\n\nManager Connect\n— Centers\nNABARD || Women Entrepreneurial Associations ]\n\n[ sxiting Centers ]\n\n\nRADHAN MANTRI VAYA VANDANA YOJANA (PMVVY) _*@\n\nQuick Facts\n\n|\n\nType: Central Sector Scheme\n\nPurpose: Offer an insurance policy-cum-pension scheme that provides security to senior citizens\nEligibility: Open only to senior citizens (individuals who have completed 60 years)\n\nImplementing agency: Life Insurance Corporation of India\n\nObjective\n\ni\n\nTo provide social security during old age and protect elderly persons against a future fall in their interest\nincome due to uncertain market conditions.\n\nSalient Features\n\n|\n\n*\n\n*\n\n5. PRADHAN MANTRI MUDRA YOJANA (PMM\n\nGuaranteed Pension:\n+ The scheme guarantees pension payouts for 10 years, with a return of principal at maturity.\n\n* Subscribers get an assured pension ranging from Rs 1000/- per month to Rs. 12,000/- per month,\nbased on contribution.\n\nLimit on investment\n\n+ It sets a minimum and maximum limit on investment at 21.56 lakh and 215 lakh respectively.\n\n* The ceiling of maximum pension is for a family as a whole, the family will comprise of pensioner, his/\nher spouse and dependents.\n\nTax benefit: The scheme enjoys no tax benefits, except for GST exemption on principal.\n\nPremature exit: Premature exit with a 2% penalty on principal is allowed in case of critical or terminal\nillness of self or spouse\n\nLoan facility:\n\n+ Loan facility is available after completion of 3 policy years.\n\n* Maximum loan that can be granted shall be 75% of the Purchase Price.\n\nDeath of subscriber: Should the investor die within 10 years, beneficiaries will get back principal.\n\n@ Quick Facts\n\n.\n\nType: Central Sector Scheme\n\n* Purpose: To create an inclusive, sustainable and value based entrepreneurial culture\n\nMUDRA: It is registered as a Company under the Companies Act 2013 and as a Non-Banking Finance\nInstitution with the RBI.\n\n* Intended beneficiary: Any Indian Citizen who has a business plan for a non-farm sector income generating\nactivity and whose credit need is less than Rs. 10 lakh.\n\nIncreasing access of finance to the unbanked but also bring down the cost of finance from the last Mile\nFinancers to the micro/small enterprises, most of which are in the informal sector.\n\n> Salient Features\n\n* Loan to beneficiaries\n\n* MUDRA (Micro Units Development & Refinance Agency\nLtd.) supports the finance Institutions (Fis) which are in\nthe business of lending to micro / small business entities.\n\n» These Fis include Commercial Banks / Regional Rural\nBanks (RRBs) / Small Finance Banks / Non-Banking\nFinancial Companies (NBFCs).\n\n+ There is no subsidy for the loan given under PMMY.\n+ Banks have been mandated by RBI not to insist for collateral security.\n@ MUDRA Card\n+ Itis a debit card issued against the MUDRA loan account.\n+ Itcan be used for multiple withdrawals and credits, so as to manage the working capital limit in cost-\nefficient manner and keep the interest burden minimum.\n* Credit Guarantee\n* Tomitigate the issue of collateral and to provide comfort to the lending institutions, a Credit Guarantee\nProduct is extended by creation of a Fund called “Credit Guarantee Fund for Micro Units (CGFMU)”.\n+ The scheme is being managed by the National Credit Guarantee Trustee Company Ltd. (NCGTC).\n\nRs. 5 Lakh to\nRs. 10 Lakh\n\n1 NATIONAL PENSION SYSTEM (NPS) _\"@\n\nQuick Facts\n\n* Purpose: To provide a sustainable solution to the problem of providing adequate retirement income to\nevery citizen of India.\n\n® Beneficiaries: Any citizen of India (both resident and Non-resident) in the age group of 18-65 years.\nCoverage: Employees’ public, private as well as unorganized sectors.\n\n* Implementing agency: Pension Fund Regulatory and Development Authority (PFRDA)\n\nTo provide retirement income to all the citizens and to inculcate the habit of saving for retirement amongst\nthe citizens.\n\ngS Salient Features\n\n* Coverage\n\n+ NPS is mandatorily applicable on Central Government employees (except Armed Forces) recruited\non or after 01.01.2004.\n\n* Subsequently, all State Governments excluding West Bengal have also adopted NPS for their\nemployees.\n* Contribution\n«The individuals contribute to their retirement account and employer can also co-contribute.\n+ One individual can open only one account under NPS, however, such Individual can have another\naccount in Atal Pension Yojana.\n® Two types of account\n\nbjective\n\nType of account Feature\n\n[Tiertaccount si ® _Non-withdrawable account meant for savings for retirement\n\nAvoluntary savings facility.\nOnly those who have T-1 Account can avail this.\n\nThe subscriber is free to withdraw savings from this account\nanytime.\n« Notax benefit is available on this account.\n® Marketlinked return: The contributions accumulate over a period of time till retirement grows with market\nlinked returns.\n© PRAN: The subscriber is allotted a unique Permanent Retirement Account Number (PRAN) which is portable\nand can be used from any location in India.\n® Partial withdrawal: Such Withdrawal can happen\n+ Atleast 3 years from the date of joining of the NPS except for activities like skill development, re-\nskilling or any other self-development activities.\n* Can happen maximum of three times during the entire\ntenure of subscription. NPS offers 3 funds to subscribers ~~\n* 25% of the contribution could be withdrawn for exigencies\nlike health, marriage, house and education, etc.\n* Premature exit: Premature exit only after completion of 10\nyears. If the total accumulated corpus is:\n\n+ Less than or equal to Rs. 1 Lakh: Complete Withdrawal is\nallowed\n\n\n« More than Rs. 1 Lakh: Only 20% of the accumulated funds can be withdrawn as lump sum.\n° 80% of the accumulated fund has to be utilized for purchase of an Annuity that would provide a\nregular monthly pension.\n* Exit benefits upon attaining the age of 60 years or Superannuation\n+ Minimum of 40% of accumulated pension wealth will be utilized for monthly annuity or pension.\n* Remaining 60% of accumulated pension wealth shall be paid to the subscriber as lump sum.\n® Tax Benefits\n« NPS has EEE tax status (tax exempt at entry, investment, and maturity).\n+ Employee's own Contribution towards NPS Tier-! eligible for:\n© — 21,50,000 of deduction available under section 80 C of the IT Act\n° Anadditional tax deduction up to 250,000 under section 80CCD (1) of the IT Act\n© Withdrawal:\n\n«  Interim/ Partial withdrawal up to 25% of the contributions made by the subscriber from NPS Tier-! is\ntax free.\n\n« Lump sum withdrawal up to 60% of total pension wealth from NPS Tier-| at the time of superannuation\nis tax exempt.\n¢ The minimum 40% of the amount utilized for annuity is also tax exempt.\n\n18.7. GOLD MONETIZATION SCHEME :\n\nQuick Facts\n\nPurpose: To mobilize the idle gold in the country and put it into productive use.\n\nEligibility: Resident Indians\n\nTaxation benefits: Earnings under the GMS are exempt from the capital gains tax, wealth tax and income\ntax.\n\nDeposite limits: Minimum 10 grams of raw gold\n\nObjective\n\ni\n\nTo mobilise gold held by households and institutions, reduce country’s reliance on the import of gold and\nprovide a fillip to the gems and jewellry sector in the country.\n\nSalient Features\n\n|\n\n* Background: Comprises of the previous ‘Gold Deposit Scheme’ and the ‘Gold Metal Loan’ scheme,\nrevamped and linked together in GMS.\n\n* Eligibility: Resident Indians (individuals, HUFs, Proprietorship & Partnership firms, etc.) can make deposits\nunder the scheme.\n\n« Joint deposits of two or more eligible depositors are allowed.\n\n* Deposit Quantity Limit\n* Minimum: 10 grams of raw gold (bars, coins, jewellery excluding stones and other metals)\n+ Maximum: No Limit\n\nOther Features\n\nShort Term Bank Medium Term Long Term Government\nDeposit (STBD) Government Deposit Deposit (LTGD\n(mMTGD)\n\nDeposits Bank's on-balance Deposits are accepted by banks on behalf of the\nsheet liability Central Government\n\n1-3 years 5-7 years 12-15 years |\n\nLock in Period 5 years\n\nROI (based on the value | As decided by bank 2.50% p.a.\nof gold during deposit)\n\nPrincipal: Gold/cash|* Principal: Cash\nbased onCustomer's|¢ interest: Cash\ndiscretion\nInterest: Gold\n* NOTE: The Gems & Jewelry sector is one of the important sectors of Indian Economy, with a contribution\nof around 7% to GDP, 10-12% share in country’s total merchandise export.\n\n1 OTHER SCHEMES/INITIATIV :\n\nSovereign Gold ® SGBs are government securities denominated in grams of gold.\n\nBond Scheme They are substitutes for holding physical gold.\n\n(sea) * Investors have to pay the issue price in cash and the bonds will be redeemed in\ncash on maturity.\nInterest earned: 2.50% per annum payable semi-annually on the nominal value\nThe Bond is issued by Reserve Bank on behalf of Government of India.\n\n© Eligibility: Person resident in India (individuals, HUFs, trusts, universities and\ncharitable institutions)\n\n« Know-Your-Customer (KYC) norms: Every application must be accompanied by\nthe ‘PAN Number’\n\n* Tenure: Tenor of the bond is 8 years, early encashment/redemption of the bond is\nallowed after fifth year from the date of issue on coupon payment dates\n\n* Tax benefits: Interest on the Bonds is taxable, but the capital gains tax arising on\nredemption of SGB to an individual has been exempted\n\n\nLimits on investment per fiscal year\n* Minimum: one gram\n\n+ Maximum: 4 kg for individuals and Hindu Undivided Family (HUF) and 20 kg for\ntrusts and similar entities\n\n+ Incase of joint holding, the limit applies to the first applicant\n\nAuthorized agencies selling the SGBs: Bonds are sold through offices or branches\nof Nationalised Banks, Scheduled Private Banks, Scheduled Foreign Banks,\ndesignated Post Offices, Stock Holding Corporation of India Ltd. (SHCIL)\n\nSpecification\n\nDeath due to any reason, after the first |* Accidental death and disabilities\n\n45 days of enrolment.\n\nConditions\n\ne Rs.2lakh (terminsurance), renewable |* Rs 2 lakh for accidental death or total\n\nfrom year to year permanent disability\n@ Rsllakh for partial permanent disability.\n\n* Abank or post office account, and consent to enable auto-debit of premium.\n\nImplementing\nagencies\n\n« Life Insurance Corporation Public Sector General insurance\n© Allother life insurers Companies (PSGiCs)\n\nOther general insurance companies\n\nPremium rate\n\nAtal Pension\nYojana (APY)\n\n© 2436 perannum @ %@20perannum\n\nAim: To provide minimum guaranteed pension for the people in the unorganized\nsector.\n\nType: Central Sector Scheme\n\nImplementing agency: Pension Fund Regulatory and Development Authority\n(PFRDA) under the National Pension System (NPS).\n\nEligibility: APY is open to all bank account holders in the age group of 18 to 40 years\nBenefits: Guaranteed minimum monthly pension of Rs. 1000 or its multiple upto Rs.\n5000 (based on the contributions) at the age of 60 years.\n\nVoluntarily exit: Subscriber could exit from the scheme subject to certain condition.\nDeath of the subscriber\n\n« Premature death (before 60 years of age)\n\n« Spouse can continue contribution to APY account\n\nDeath after attaining 60 years\n\n« Pension to spouse\n\n« If spouse also dies, accumulated pension corpus would go to nominee\n\nMahila Samman\nSavings\nCertificates\n(mssc)\n\nScheme was announced in 2023-24 Union Budget with the objective of promoting\n\nfinancial inclusion and empowering women, including girls.\n\nKey features of scheme\n\n* Two-year tenure (valid upto 2025) and provides fixed interest rate of 7.5%\ncompounded quarterly.\n\n* MSSC account holder can withdraw a maximum up to 40% of eligible balance\n\nonce after expiry of one year from date of opening of account but before\nmaturity of account.\n\n+ Minimum amount to be invested is Rs.1,000 and any sum in multiples of Rs.100.\n+ Maximum investment limit is Rs.2 lakh.\n\nAtmanirbhar\nBharat Rozgar\nYojana (ABRY)\n\nScheme for\nFinancial\nSupport to PPP\nin Infrastructure\nViability Gap\nFunding (VGF)\nScheme\n\nAim: Reduce the financial burden of the employers of various sectors/industries\nand encourages them to hire more workers.\n\nApplicability: Every establishment registered with EPFO and their new employees\n(earning wage less that Rs. 15,000/- per month) for hiring between October 2020 to\nJune 2021 or those who lost jobs between March 2020 to September 2020\nIncentive for encouraging hiring: Centre is crediting for provident fund for a period\nof two years both the employees’ share and employers share’ (12% of wages each)\nof contribution payable or only the employees’ share, depending on employment\nstrength of the EPFO registered establishments.\n\nImplementing Agency: Employees Provident Fund Organization (EPFO)\n\nThe scheme provides financial support in the form of grants, one time or deferred,\nto infrastructure projects undertaken through PPPs (Public Private Partnership)\nwith a view to make them commercially viable.\n\nTenure: Till 2024-25\n\nSub scheme -1\n\n+ Tocater to Social Sectors such as Waste Water Treatment, Water Supply, Solid\nWaste Management, Health and Education sectors etc.\n\n* Eligible projects should have should have at least 100% Operational Cost\nrecovery.\n\n* Central Government will provide maximum of 30% of Total Project Cost (TPC) of\nthe project as VGF and State Government/Sponsoring Central Ministry/Statutory\nEntity may provide additional support up to 30% of TPC.\n\nSub scheme -2\n\n+ To support demonstration/pilot social sectors projects which may be from\nHealth and Education sectors\n\n* Eligible projects should have should have at least 50% Operational Cost recovery.\n\n+ Central Government and the State Governments together will provide up to 80%\nof capital expenditure and upto 50% of Operation & Maintenance (O&M) costs\nfor the first five years.\n\n+ Central Government will provide a maximum of 40% of the TPC of the Project. In\naddition, it may provide a maximum of 25% of Operational Costs of the project\nin first five years of commercial operations.\n\n\nSpecial\nAssistance to\nStates for Capital\nInvestment\n\nSpecial Window\nfor Affordable\nand Mid-\nIncome Housing\n\n(SWAMIH) Fund\n\ne-Appeals\nScheme\n\n* Under the scheme (announced in 2023-24 budget), State Governments will get\nspecial assistance in the form of 50-year interest free loan up to an overall sum of\nRs. 1.3 lakh crore during the financial year 2023-24.\n\n* Scheme for financial assistance to States for capital investment/expenditure was\nfirst instituted by Ministry of Finance in 2020-21 in the wake of COVID-19 Pandemic.\n\n® Scheme has following 8 parts\n\n+ Rs. 1] lakh crore has been allocated amongst States in proportion to their share\nof central taxes & duties as per the award of the 15th Finance Commission.\n\n« Financing reforms in ULBs to make them credit worthy for Municipal Bonds and\nfor issue of Municipal Bonds.\n\n+ Housing for Police personnel above or as part of police stations in urban areas.\n\n« Children and adolescents libraries with digital infrastructure at Panchayat and\nWard level\n\n+ Incentive for Just-in-time release of Centrally Sponsored Schemes funds by\nstate governments\n\n+ Incentive for scrapping Old vehicles\n\n* Urban Planning Reforms\n\n« Construction of Unity malls\n\nBengaluru’s first project under SWAMIH fund was completed, providing affordable\n\nhomes to nearly 3000 families.\n\nSWAMIH Fund is a social impact fund specifically formed for completing stressed\n\nand stalled residential projects and was launched in 2019.\n\n+ Fund is sponsored by Ministry of Finance and is managed by SBICAP Ventures\nLtd.\n\nIt provides priority debt financing for completion of stressed, brownfield and Real\n\n(RERA)-registered residential project.\n\n* Central Board of Direct Taxes (CBDT) has notified an e-Appeals Scheme, 2023 to\nreduce pendency of appeals at the level of income tax commissioners.\n\n* About e-Appeals Scheme:\n\n« Aggrieved assesse can appeal certain orders before Joint Commissioner\n(Appeals) passed by an assessing officer below the rank of Joint Commissioner\n(Appeals).\n\n« Aperson shall not be required to appear either personally or through authorised\nrepresentative in connection with any proceedings under this scheme.\n\n+ Appellant can, however, request a personal hearing, which would be done\nthrough video conferencing or video telephony.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 19,
                "chapter_name": "19. MINISTRY OF FISHERIES,\nANIMAL HUSBANDRY & DAIRYING",
                "chapter_path": "./screenshots-images-2/chapter_19",
                "sections": [
                    {
                        "section_id": 19.1,
                        "section_name": "19. MINISTRY OF FISHERIES,\nANIMAL HUSBANDRY & DAIRYING",
                        "section_path": "./screenshots-images-2/chapter_19/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_19/section_1/2d25a71c-abfa-466b-9231-8ab1e48a680c.png",
                            "./screenshots-images-2/chapter_19/section_1/fd5fdb8f-4903-4861-b1e5-c730301db500.png",
                            "./screenshots-images-2/chapter_19/section_1/b76f8903-eb58-4aaa-aa8b-06e278b14331.png",
                            "./screenshots-images-2/chapter_19/section_1/85ead38a-8a1a-47aa-9c9c-168624270555.png",
                            "./screenshots-images-2/chapter_19/section_1/95940d2b-19f4-4f85-9c7d-66f5de162fcf.png",
                            "./screenshots-images-2/chapter_19/section_1/e10e7468-2703-4c05-8ab0-a0930aed9977.png",
                            "./screenshots-images-2/chapter_19/section_1/5a5e98e0-8426-49fc-8efd-f75ac47f1d48.png",
                            "./screenshots-images-2/chapter_19/section_1/09aa055f-091e-48a1-89df-0f6207f48cb1.png",
                            "./screenshots-images-2/chapter_19/section_1/47e59a6b-621c-4052-b862-79505c58b079.png",
                            "./screenshots-images-2/chapter_19/section_1/65990c4f-9ce5-4088-bfd4-a57c4b235539.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "19.1. PRADHAN MANTRI MATSYA \"3\nSAMPADA YOJANA (PMMSY)\n> auick Facts\n\nPurpose: Bring Blue Revolution through sustainable and responsible development of fisheries sector in\nIndia.\n\nType: Both Central Sector Scheme and Centrally Sponsored scheme\nApproach: To the extent possible, ‘cluster or area-based approaches’ to be adopted\nTenure: FY 2020-21 to FY 2024-25,\n\nHarnessing of fisheries potential\n\nModernizing value chain, post-harvest management and quality improvement\nEnhancing fish production and productivity\n\nBuild robust fisheries management and regulatory framework\n\nDoubling fishers and fish farmers’ incomes and generation of employment\n\nSalient Features\n\nFocus: All round development of Fisheries sector through abunch | sims of PMMSY\nof diverse interventions along the fisheries value chain right from\nproduction to consumption.\n\nef 7? @ @\n\nEnhanced fish production to 22\nmillion metric tons.\n\n* 42%ofthetotal estimated investment of the PMMSY is earmarked | \"cose or contribution of Gross\n\nfor creation and upgradation of fisheries infrastructure facilities. Value Added (GVA) of fisheries\n\n* Focus areas include Fishing Harbors and Landing Centers, Sector to agriculture GVA to 9%.\nPost-harvest and Cold Chain Infrastructure, Fish Markets and Double export earnings to about Rs.\nMarketing Infrastructure, Integrated Modern Coastal Fishing Hakh crore.\n\nVillages and Development of Deep-sea Fishing. Reduction of post-harvest losses to\n* Swath Sagar plan: Under this, key activities include promotion about 10% (currently 25%)\nof Bio-toilets, Insurance coverage for fishing vessels, Fisheries Doubling of incomes of fishers and\nManagement Plans, €£-Trading/Marketing, Fishers and fish farmer.\nresources survey and creation of National IT-based databases.\n\n\n°\n\nNational network of Brood Banks: Establishing Species Specific/Multispecies Brood Banks in the States/\nUTs to primarily source, select, raise and maintain Quality Brood Fish.\n\nIntegrated Laboratory Network: For addressing diseases, antibiotics and residues issues, aquatic health\nmanagement.\n\nAquaparks: Developed as hub of fisheries and aquaculture activities as one stop ‘parks’ with assured,\naffordable, quality inputs under one roof, etc.\n\nFunding pattern for Centrally Sponsored Component: Share of fund between Central and North Eastern\n& Himalayan States- 90:10 and 60:40 for other states.\n\nKey Initiatives\n\n* Matsya Sampada Jagrukta Abhiyan: Awareness campaign for enhancing outreach across India and\nensuring ‘last mile connectivity’.\n\n«River ranching programme:\n¢ Launched for augmenting and enhancing the fish production and productivity through expansion,\n\nintensification, diversification and productive utilization of land and water.\n\n¢ National Fisheries Development Board (NFDB) has been designated as the Nodal Agency.\n\n+ National Surveillance Programme for Aquatic Animal Diseases (NSPAAD) Phase-ll: For early\ndetection and managing the spread of aquatic diseases.\n\n* Genetic improvement program of Penaeus indicus (Indian white shrimp)-Phase-I: To establish a\nNational Genetic Improvement Facility for shrimp breeding.\n\n19.2 PRADHAN MANTRI MATSYA KISAN .\nSAMRIDHI SAH-YOJANA (PM-MKSSY)\nQuick Facts\n\neee e\n\nPurpose: Formalization of the fisheries sector and supporting fisheries micro and small enterprises\nType: Central Sector Scheme\n\nSub-scheme of: Pradhan Mantri Matsya Sampada Yojana\n\nTenure: FY 2023-24 to FY 2026-27\n\neee\n\nGradual formalization of the unorganised fisheries sector.\n\nFacilitating institutional finance to fisheries sector micro and small enterprises.\nProviding a one-time incentive to beneficiaries for purchasing aquaculture insurance.\nIncentivizing for improving fisheries sector value-chain efficiencies.\n\nSalient Features\n\n© Intended beneficiaries\n\n«Fishers, Fish (Aquaculture) Farmers, Fish workers, Fish Vendors or such other person directly engaged\nin fisheries value chain.\n\n« Micro and Small enterprises in the form of Proprietary Firms, Partnership Firms and Companies\nregistered in India, Societies, Limited Liability Partnerships (LLPs), Cooperatives, Federations, Village\nLevel Organizations like SHGs, Farmers Producer Organizations (FPOs) and Fish FPOs\n* Startups engaged in fisheries and aquaculture value chains.\n* Any other beneficiaries that may be included by the Department of Fisheries,\n* Funding; Total outlay of 6000 crore rupees, of which-\n« 50% will come from public finance including the World Bank and the AFD (French Development\nAgency) external financing\n+ 50% will be contributed by the beneficiaries from private sector\n* Key components\n* Component I-A: Formalization of the fisheries sector and facilitating access of fisheries\nmicroenterprises to Gol programs for the financing of working capital.\n¢ National Fisheries Digital Platform (NFDP) will be created and all the stakeholders will be mobilized\nto register on it.\n» The NFOP will serve multiple functions including disbursement of financial incentives.\n* Component 1-B: Facilitating the adoption of aquaculture insurance: It is proposed to facilitate the\ncreation of appropriate insurance products and to cover at least I lakh hectares of aquaculture farms\n(Refer to the infographics below).\n\n=] Insurance provisions\n| under Component 1-B |\n\n4\n\n2 incentive for Small\n\n® Scope\n\n* Incentive is provided for purchase\nof insurance for one crop cycle\nonly\n\n‘* Additional incentive for\nMarginalized Groups:\n© SC, ST, and Women beneficiaries\n\neligible for an additional 10%\nincentive.\n\n- Farms\n\n* Offer a one-time incentive to\nfarmers with farm size of upto 4\nhectares.\n\n* Incentive rate: 40% of premium\ncost, capped at Rs. 25,000 per\nhectare.\n\n+ Maximum incentive per farmer:\nRs. 100,000.\n\n== Incentive for intensive\n' Aquaculture\n\n* Applies to intensive form of\naquaculture other than farms such\nas cage culture, Re-circulatory\nAquaculture System (RAS), bio-floc,\nraceways, etc.\n\n* Incentive rate: 40% of premium cost,\nwith a maximum of Rs. 1,00,000.\n\n* Maximum unit size eligible: 1800 m3.\n\nComponent-2: Supporting microenterprises to improve fisheries sector value chain efficiencies.\n\nComponent-3: Facilitating Adoption and expansion of fish and fishery product safety and quality\n\nassurance systems.\n\nComponent-4: Project management, monitoring, and reporting: It is proposed to set up Project\n\nManagement Units (PMUs) to manage, implement, monitor, and evaluate project activities.\n\n\n1 ANIMAL HUSBANDRY INFRASTRUCTURE \"iq\n‘VELOPMENT FUND (AHIDF)\noO Quick Facts\n\nPurpose: To help increasing of milk and meat processing capacity and product diversification\nType: Central Sector Scheme\n\nFinancial assistance: Term Loan to the Eligible Entities would be provided\n\nTenure: Till 2025-26\n\nTo help increasing of milk and meat processing capacity and product diversification thereby providing\ngreater access for unorganized rural milk and meat producers to organized milk and meat market.\n\nTo make available increased price realization for the producer and quality milk and meat products for\nthe domestic consumer.\n\nDevelop entrepreneurship and generate employment and to increase the export contribution in the milk\nand meat sector.\n\nTo make available quality concentrated animal feed to cattle, buffalo, sheep, goat, pig and poultry to\nprovide balanced ration at affordable prices.\n\nSalient Features\n\nBackground: Setting up of Rs. 15000 crore AHIDF was announced under Atma Nirbhar Bharat Abhiyan\n\nstimulus package.\n\n* The scheme has recently been realigned to be implemented under Infrastructure Development Fund\n(IDF) with a total outlay of Rs.29,610.25 crore.\n\nIndividual Section 8 Micro Small and\n\nentrepreneurs i Cooperatives Medium\nOrganization Enterprises\n(FPO) (MSME)\n\nQuantum of loan: The project under the AHIDF shall be eligible for loan up to 90% of the estimated/ actual\n\nproject cost on submission of viable projects.\n\n+ LOAN IS PROVIDED BY scheduled bank and National Cooperative Development Corporation (NCDC),\nNABARD and NDDB.\n\nEligible Projects: Loan is provided for\n\na sa ae aa\nDairy Processing Value added dairy Animal Feed Breed Improvement Setting up of Animal Waste to\nproduct manufacturing units|| Technology and_ || Veterinary Vaccine Wealth\nmanufacturing || and strengthening || Breed Multiplication ‘and Drugs Management\nof existing units Farm Production facilities (agri-waste\nmanagement)\n\nBeneficiary Contribution\n* 10% for Micro and Small units\n* upto 15% for Medium Enterprises\n+ upto 25% for other categories beneficiaries\n® Interest subvention: Loans under this financing facility are eligible for interest subvention of 3% per\nannum.\n\n+ The DAHD will provide 3% interest subvention to the Bank upfront in the first year and subsequently on\ndemand by the bank for each of the beneficiaries on each year on the outstanding amount\n\n* Repayment period: Maximum repayment period should not exceed 8 years (initially it was 10 years) from\nthe date of first disbursement inclusive of moratorium of 2 years on repayment of principal.\n\n* Security: Hypothecation of assets created out of Bank finance, mortgage of land & building for which\ncredit facilities has been extended, pledge of specified financial assets etc. as per Bank's policy guidelines,\nPersonal guarantee of the Proprietor, Partners of the Firm, etc.\n\n* Credit Guarantee Fund of AHIDF: Government of India will also provide credit guarantee to the MSME and\nDairy Cooperatives up to the 25% of the term loan.\n\n« Credit Guarantee Fund of Rs.750 crore is established which is managed by NABARD\n\nEase of applying for benefits: Application process through online portal www.ahidf.udaymimitra.in.\n\n@ Convergence with other scheme: Scheme provided for dovetailing with capital subsidy schemes of other\nministries or state level schemes.\n\ne Achievement: The scheme has been able to increase processing capacity by 2-4% in dairy, meat and\nanimal feed sector.\n\n19.4. BLUE REVOLUTION: INTEGRATED\nEVELOPMENT AND MANAGEMENT OF FISHERI\n\n> auick Facts\n\nType: Centrally Sponsored Scheme\n\nPurpose: increasing production and productivity from aquaculture and fisheries resources, both inland\nand marine.\n\nCoverage: all the States including North East States and Union Territories.\n\nSupport to weaker: Support to SCs, STs, Women and their co-operatives to take up fishing and fisheries\nrelated activities\n\n@D Objective\n\n* Toincrease the overall fish production in a responsible and sustainable manner.\n* To modernize the fisheries and ensure food and nutritional security.\n® To generate employment and export earnings and ensure inclusive development.\n\n5 sa nt Features\nVision: Blue Revolution, the\nNeel Kranti Mission has the Components of the\nvision to achieve economic Schem\n\nprosperity of the country\nand the fishermen and fish\n\nfarmers.\n\nee\n\nFinancial assistance: It\nprovides financial assistance\n\nfor lopme: fish National Fisheries Development of Development of National\n\nfor deve mot faheries Development Inland Fisheries Marine Fisheries, Scheme on\n\nand aquaculture sector Board (NFDB) and Aquaculture Infrastructure Welfare of\n\nincluding fish production ‘and Post Harvest Fishermen\nOperations\n\nand post-harvest related\nactivities like fish brood banks,\nhatcheries, construction of\nponds.\n\n* Mission — Fingerling: To\n\na Monitoring, Institutional Strengthening of\nfacilitate the establishment Control and asrangementtor| |” Database &\nof hatcheries and Fingerlin: Surveillance Fisheries Sector Geographical\n\n9 (MCS) and other Inforrtion\nrearing ponds to ensure need based System of the\n\ncertain level of production of Interventions Fisheries Sector\nfish fingerling, post larvae of\nshrimp and crab in the country.\n\n\n* Fisheries and Aquaculture Infrastructure Fund (FIDF)\n+ It was established with a fund size of Rs. 7522.48 crore.\n\n+ The Centre provides interest subvention up to 3% per annum for providing the concessional finance\nby the Nodal Loaning Entities for development of infrastructure in the fisheries sector.\n\n* Tenure: 2025-26\n\nASHTRIYA GOKUL MISSION (RGM) _\n\nQuick Facts\n\nPurpose: Development and conservation of indigenous bovine breeds\nSub-scheme of: Rashtriya Pashudhan Vikas Yojana\n\nKey beneficiaries: Small and marginal farmers particularly women\nTenure: 2021-22 to 2025-26\n\neve\n\nObjective\n\ni\n\n°\n\nTo enhance productivity of bovines and increase milk productivity in a sustainable manner using\nadvance technologies\n\nTo propagate use of high genetic merit bulls for breeding purposes.\nTo enhance Artificial insemination (Al) coverage and delivery of Al services at farmers’ doorstep\nTo promote indigenous cattle & buffalo rearing and conservation in a scientific and holistic manner.\n\neee\n\nSalient Features\n\n* Funding Pattern\n\n25,000\nper IVF pregnancy will be made available to participating farmers\n\nge) 50%\nsubsidy upto 50% for promoting sex sorted semen and establishment of breed multiplication farm\n\n100%\ngrant-in-aid for other componenets\n\nKey components:\n* Availability of High genetic Merit Germplasm\n* Bull Production Programme\n\n\n« Support to semen stations\n\n« Implementation of IVF technology\n\n+ Breed Multiplication Farms\n\nExtension of Artificial Insemination (Al) coverage\n\n* Establishment of Multi-Purpose Al technicians in Rural India (MAITRIs)\n+ Nationwide Al programme (NAIP)\n\n* Using sex sorted semen\n\n+ Implementation of National Digital Livestock Mission (Livestack)\nDevelopment and Conservation of indigenous Breeds\n\n» Assistance to Gaushalas, Gosadans and Pinjarapoles\n\n+ Operation of Rashtriya Kamdhenu Aayog\n\nSkill Development\n\n* For training of professionals in IVF technology, other advanced reproductive techniques and training\nof Al technicians/ professionals, etc.\n\nFarmers Awareness\n\n* Scheme for organising farmers training programme, award to farmers, best Al technicians, dairy\ncooperatives, fertility camps,etc.\n\nOther Activities related to cattle and buffalo Development\n\n+ Research Development and Innovation in Bovine Breeding and any other activity for cattle and buffalo\ndevelopment\n\nRelease of Funds: RGM funds will be released directly to IA.\n\nState Ranking: To enhance the competitive spirit of good performance among the States and Union\nTerritories.\n\nParticipative monitoring: Panchayti Raj Institutions (PRIs) will be integrated for monitoring\n\nNationwide Artificial Insemination Programme (NAIP)\n\n«  Itis a campaign mode genetic upgradation program covering all breeds of bovines to enhance the\nmilk production using low-cost breeding.\n\n« Every cow and buffalo under Al are tagged and can be tracked through the Information Network on\nAnimal Productivity and Health (INAPH) Database.\n\nImplementing Agencies (IA)\n\ncowaiow Hi\n\n+ Frozen Semen Production and Training Institute + Livestock Development Board\n* Cattle Breeding Farms ® Milk Federations\n\n* Central Herd Registration Scheme\n\n* National Dairy Development Board\n\n» ICAR and its Institutes\n\n» Central Universities/ Government Veterinary Universities\n\n\n19.6. OTHER SCHEMES/INITIATIVE :\"\n\nNational Animal |« Objective: To control Foot & Mouth Disease (FMD) and Brucellosis by vaccinating\nDisease Control 100% cattle, buffalo, sheep, goat and pig population.\n\nProgramme Goal: To control FMD by 2025 with vaccination and its eventual eradication by 2030.\n(apc) ® Foot and Mouth Disease (FMD)\n\n«  Itis a highly contagious viral vesicular disease of cloven-hoofed animals such\nas cattle, buffaloes, sheep, goats and pigs etc.\n\n+ It leads to reduction in milk yield, decreased growth rate, infertility, reduced\nworking capacity in bullocks, trade embargo in the international market.\n\n* Brucellosis\n\n+ Brucellosis is a reproductive disease of cattle and buffaloes caused by bacterium\nBrucella abortus.\n\n+ The disease is characterized by fever, induces abortion at the last stage of\npregnancy, infertility, delayed heat, interrupted lactation resulting in loss of\ncalves, loss in production of meat and milk.\n\n+ It is endemic in India and appears to be on the increase in recent times.\n\nNational  Aim:To enhance quality of milk and milk products and increase share of organized\nProgramme milk procurement.\n\nfor Dairy Tenure: 2021-22 to 2025-26\n\nsontepmont The scheme has two components:\n\nNational Livestock\nMission (NLM)\n\n+ Component ‘A’\n\n° Creating/strengthening of infrastructure for quality milk testing equipment\nas well as primary chilling facilities for Cooperatives /SHG run private dairy/\nMilk Producer Companies/Farmer Producer Organisations.\n\n* Component ‘B’\n\n® Aided by Japan International Cooperation Agency (JICA).\n\n¢ Being implemented in 9 states namely Bihar, Uttar Pradesh, Punjab,\nRajasthan, Madhya Pradesh, Andhra Pradesh, Telangana, Uttarakhand\nand West Bengal.\n\n° It facilitates creation of necessary dairy infrastructure for market linkages\nfor the produce in villages and strengthening of capacity building of stake-\nholding institutions from village to State level.\n\nObjectives: Employment generation through entrepreneurship development in\nsmall ruminant, poultry and piggery sector & Fodder sector, increase of per animal\nproductivity through breed improvement, increase in production of meat, egg, goat\nmilk, wool and fodder.\n\nKey components:\n\nBreed Development of Innovation and\nLivestock and Poultry Extension\n\n\nNational Action\nPlan for Control\nand Eradication\nof Glanders\n\n® Asper the action plan, infected animal should be eliminated immediately.\n\n* In case absolutely essential, the positive animal may be transported to\nappropriate area for destruction and further disposal in closed vehicles.\n\nAll the zoo-sanitary measures should be followed at the time of culling and\ndisposal of carcasses.\n\nGlanders:\n\ntis acontagious and fatal disease of equines (horses, donkeys and mules) caused\nby the bacterium Burkholderia mallei.\n\nHumans can also get this disease.\nNo vaccine is available for the disease.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 20,
                "chapter_name": "20. MINISTRY OF FOOD\nPROCESSING INDUSTRIES (MOFPI)",
                "chapter_path": "./screenshots-images-2/chapter_20",
                "sections": [
                    {
                        "section_id": 20.1,
                        "section_name": "20. MINISTRY OF FOOD\nPROCESSING INDUSTRIES (MOFPI)",
                        "section_path": "./screenshots-images-2/chapter_20/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_20/section_1/71569863-4ad1-44b6-a8f3-cac004d3b47f.png",
                            "./screenshots-images-2/chapter_20/section_1/c6c968ba-c237-467d-ab73-1683521a9620.png",
                            "./screenshots-images-2/chapter_20/section_1/c05196d6-c7d5-4f8b-9023-7d15b0077780.png",
                            "./screenshots-images-2/chapter_20/section_1/e3005a5a-e507-4837-8005-640edb9e3159.png",
                            "./screenshots-images-2/chapter_20/section_1/5ae33ac0-5974-4c20-8e4d-1c9590ebe4dc.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "20.1. PRADHAN MANTRI FORMALISATION OF .\nMICRO FOOD PROCESSING ENTERPRISES (PMFME)\n\noo Quick Facts\n\nType: Centrally Sponsored scheme\n\nTenure: 5 years from 2020-21 to 2024-25\n\nIntended beneficiaries: Existing micro food processing enterprises, FPOs/SHGs/Producer cooperatives.\nNodal Bank: Union Bank of India\n\nTo provide financial, technical and business support for upgradation of existing micro food processing\nenterprises\n\nSalient Features\n\n* Target: Supporting 2,00,000 micro food processing units of existing micro food processing enterprises\n\n(MFPE).\n\nNae\n& 2\n\nSeed capital support of Credit linked subsidy for Credit linked grant support Support for marketing &\nRs.40,000 per SHG member capital investment up to up to 35% for establishing branding with 50% grant at\n\n35% with a ceiling of common infrastructure State or regional level\nRs. 10 lakh\n\nFocus areas: Waste to wealth products; Minor forest products; and Aspirational Districts.\n\nOne District One Product (ODODP): The States would identify food product (including perishable produce)\nfor a district keeping in view the existing clusters and availability of raw material.\n\n« Support for common infrastructure and branding & marketing.\n\n* Capacity building and research: Training of units, product development, appropriate packaging and\nmachinery for micro units.\n\n«By NIFTEM and IIFPT under MOFPI along with State Level Technical Institutions.\n* PMFME Scheme Seed Capital Module\n\nAim Launched by Financial assistance portal\nTo facilitate seed capital assistance The MoFP! in association with Mit The seed capital portal can be\n\n(initial money required to start a new of Housing and Urban Affairs (MoHUA] accessed to avail the seed capital\nbusiness) to members of urban on Deendayal Antyodaya assistance of Rs.40,000 per SHG\nSelf-Help-Groups (SHG) working in the Yojana-National Urban Livelihoods member under the PMFME Scheme.\nfood processing sector in India Mission (DAY-NULM) MIS Portal\n\n2 PRADHAN MANTRI KISAN SAMPADA YOJANA (PMKSY) _\"@\n\n@) Quick Facts\n\n@ Type: Central Sector Scheme.\n\n* Purpose: Creation of modern infrastructure with efficient supply chain management from farm gate to\nretail outlet.\n\nUmbrella Scheme: Ongoing schemes and also new schemes of the Ministry are incorporated\n\nPotential benefits: Doubling farmers’ income, creating employment, reducing wastage of agricultural\nproduce.\n\n@ Creation of modern infrastructure with efficient supply chain management from farm gate to retail\noutlet.\n\nHelp in providing better returns to farmers and creating huge employment opportunities especially in\nthe rural areas.\n\nReducing wastage of agricultural produce, increasing the processing level and enhancing the export of\nthe processed foods.\n\n® Salient Features\n\n® Background: Centre approved the umbrella scheme named SAMPADA (Scheme for Agro-marine\nprocessing and Development of Agro-processing Clusters) in 2017 for implementation till 2020.\n* The scheme was subsequently renamed as ‘Pradhan Mantri Kisan SAMPADA Yojana (PMKSY) with\nsome components beina discontinued.\n\n°\n\n* Component of PMKSY:\n\n« Integrated Cold Chain and Value\nAddition infrastructure (Cold Chain):\nto provide integrated cold chain and\npreservation infrastructure facilities, / .\nwithout any break, from the farm Backwardand\ngate to the consumer. Forward tinkages \\\n° The integrated cold chain project\n\ncan be set up by Partnership\n/ Proprietorship Firms,\n\nComponents\n\nCompanies, Corporations, | © of SAMPADA not\nCooperatives, SHGs, FPOs, being continued\nNGOs, Central / State PSUs, etc. under PMKSY\nsubject to fulfilment of eligibility | \\\nconditions of scheme guidelines. \\\\_ and critical control points\n. ; \\ or HACCP development (part of\n¢@ Cold chain for fruits and \\ (part of Food Safety and Human Resources and\n\nQuality Assurance Institutions)\n\nvegetables ore being \\ Infrastructure)\n\nimplemented under Operation\nGreens (OG) scheme to ensure\ninter-scheme convergence.\n\n* Creation of Infrastructure for Agro\nProcessing Cluster (APC): APC has\nsimilar objectives as that of Mega Food Park (MF) i.e, to set up modern food processing units, but at\nrelatively small scale.\n\n© Each APC under the scheme have two basic components i.e.\n» Basic Enabling Infrastructure (roads, water supply, power supply, drainage, ETP etc.)\n» Core Infrastructure/ Common facilities (ware houses, cold storages, IQF, tetra pack, sorting,\ngrading. etc.)\n© At least 10 acres of land is required to be arranged\neither by purchase or on lease for at least 50 years\nfor setting up of APC.\n\n+ Creation/ Expansion of Food Processing And Preservation\nCapacities (Unit Scheme): Creation and expansion of\nprocessing and preservation capacities inside Mega\nFood Parks (MFPs) and APCs.\n® Scheme is implemented through organizations such\n\nas Central & State PSUs/ Joint Ventures/ FPOs/ | *\nNGOs/ Cooperatives/ SHG’s/ Pvt. Ltd companies/\nindividuals proprietorship firms engaged in\nestablishment/ upgradation/ modernization of food J .\nprocessing units. costly and time consuming foreign\ncertifications as many countries have\n\n+ Food Safety and Quality Assurance Infrastructure mandated Hazard Analysis Critical\n(FTL): The scheme assists in setting up of upgradation Control Point (HACCP) for high risk\nof quality control/ food testing laboratories (FTL) sectors like meat, fish, dairy ete. and\nand implementation of Quality Management System most developed countries have also\nthrough HACCP/ ISO 22000/ FSSC 22000/BRC/SQF or any mandated Good Hygienic Practices\nother Global Food Safety Initiatives (GFSI) approved (GHP) across all food sectors.\ncertification scheme/ Standards in Food Processing Units.\n\nInitiatives by Quality Council of India\n(acl) for ensuring Food Safety and\nQuality Assurance\n\n@ QCI has developed “IndiaGHP” and\n\n“IndiaHACCP” based on globally\naccepted Codex Standards for\nadoption by food manufacturers and\nsupply chain operators.\n\nThese schemes will help india\nfood chain related industry to\ndemonstrate compliance to global\nstandards without having to go for\n\n\n+ Human Resource & Institutions (HRI)-Research and Development: 100 R&D projects have been\nsanctioned for 15th FC cycle.\n© The erstwhile skill development component under this scheme is discontinued as same is being\nimplemented under PMFME (PM Formalisation of Micro food processing Enterprises) Scheme.\n+ Operation Greens (OG): Announced in Union Budget 2018-19 on the line of “Operation Flood”.\n\nInitially the scheme was launched for development of Tomato, Onion and Potato (TOP) value\nchain\n\n¢ The scheme has two components:\n\n» Long Term intervention-integrated Value Chain Development Projects: Under the union\nbudget 2021-22, its scope was enlarged to 22 perishable crops.\n\n» Short-Term Interventions: Under “Aatmanirbhar Bharat Package” of 2020 its scope was\nexpanded from TOP crops to all fruits and vegetables (i.e. TOP to TOTAL).\n\nInter-scheme re-allocation: Based on mid-term correction inter-scheme reallocation of the outlay may\nbe approved by the Minister I/C of MoFP! subject to 25% of the original outlay of that scheme.\n\nUse of savings of committed liability: Savings from committed liability for any scheme shall be used for\nsanction of new projects under the scheme.\n\nAwareness: Wide publicity may be given to the schemes of PMKSY so that full advantage of benefits\nunder PMKSY can be availed by stakeholders.\n\n20.3. PRODUCTION LINKED INCENTIVE SCHEME\nFOR FOOD PROCESSING INDUSTRY (PLISFPI)\n@) Quick Facts\n\n* Type: Central Sector Scheme\n\n® Purpose: Expansion of processing capacity and branding abroad to incentivise emergence of strong\nIndian Brands\n\nTenure: 2021-22 to 2026-27\nImplementing Agency: Project Management Agency (PMA)\n\nSupport Food manufacturing entities for enhancing global footprint and employment generation.\n\nSalient Features\n\nApplicants: Limited Liability Partnership (LLP) or a Company registered in India; Cooperatives; SME and\napplicants making an application for coverage under the Scheme.\n\n* Key Components: 3 Components\n+ Incentivising manufacturing of four major food product segments\n\n\n®@ Ready to Cook/ Ready to Eat (RTC/ RTE) foods including Millets based products\n© Processed Fruits & Vegetables\n° Marine Products\n° Mozzarella Cheese\n*  Incentivise Innovative/ Organic products of SMEs across all four earlier mentioned food segment\nincluding Free Range - Eggs, Poultry Meat, Egg Products\n« Support for branding and marketing abroad to incentivise the emergence of strong Indian brands\nScheme is “fund limited”: The maximum incentive shall be restricted to the pre-approved limit.\nMonitoring\n+ The Scheme would be monitored at Centre by the Empowered Group of Secretaries chaired by the\nCabinet Secretary.\n+ Athird-party evaluation and mid-term review mechanism would be built in the programme.\n* Benefits under other scheme: Coverage under the PLI Scheme will not affect eligibility under other\nschemes like Pradhan Mantri Kisan Sampada Yojana.\n\n20.4. OTHER SCHEMES/INITIATIVES _\"%\n\nNivesh Bandhu e itis aninvestor facilitation portal.\n\nIt provides information on Central and State Governments’ investor friendly\npolicies, agro-producing clusters, infrastructure, and potential areas of investment\nin the food processing sector.\n\nScheme ofCold | Objective: To reduce post-harvest losses of horticulture and non-horticulture\n\nChain, and agri-produce.\n\nValue Addition | it provides integrated cold chain and preservation infrastructure facilities, without\n\nInfrastructure any break, from the farm gate to the consumer.\n\n* Thescheme allows flexibility in project planning with special emphasis on creation\nof cold chain infrastructure at farm level.\n\n* Facilitates distribution of non-horticulture, horticulture, fish/marine (except\nshrimp), dairy, meat and poultry.\n\n© Projects could be established by Partnership / Proprietorship Firms, Companies,\nCorporations, Cooperatives, SHGs, FPOs, NGOs, etc.\n\n",
                        "extracted-code": ""
                    }
                ]
            }
        ]
    }
}