{
    "chapters": [
        {
            "chapter_name": "introduction",
            "chapter_path": "./screenshots-images-2/chapter_1",
            "sections": [
                {
                    "section_name": "introduction",
                    "section_path": "./screenshots-images-2/chapter_1/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_1/section_1/5c01a148-5cba-46b6-b8ea-1f59322d684a.png",
                        "./screenshots-images-2/chapter_1/section_1/3e4f8c24-73ae-4c11-9d7e-c343929c50bf.png",
                        "./screenshots-images-2/chapter_1/section_1/588f12c7-3682-4bd9-87c5-92f5eaa1d41b.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Seventy-nine percent of smartphone owners check their device within\nfifteen minutes of waking up every morning. Perhaps more startling, fully\none-third of Americans say they would rather give up sex than lose their\ncell phones.*\n\nA 2011 university study suggested people check their phones thirty-four\ntimes per day. However, industry insiders believe that number is closer to\nan astounding 150 daily sessions.*\n\nFace it: We’re hooked.\n\nThe technologies we use have turned into compulsions, if not full-\nfledged addictions. It’s the impulse to check a message notification. It’s the\npull to visit YouTube, Facebook, or Twitter for just a few minutes, only to\nfind yourself still tapping and scrolling an hour later. It’s the urge you likely\nfeel throughout your day but hardly notice.\n\nCognitive psychologists define habits as “automatic behaviors triggered\nby situational cues”: things we do with little or no conscious thought.2 The\nproducts and services we use habitually alter our everyday behavior, just as\ntheir designers intended. Our actions have been engineered.\n\nHow do companies, producing little more than bits of code displayed on\na screen, seemingly control users’ minds? What makes some products so\nhabit forming?\n\nForming habits is imperative for the survival of many products. As\ninfinite distractions compete for our attention, companies are learning to\nmaster novel tactics to stay relevant in users’ minds. Amassing millions of\nusers is no longer good enough. Companies increasingly find that their\neconomic value is a function of the strength of the habits they create. In\n\n\norder to win the loyalty of their users and create a product that’s regularly\nused, companies must learn not only what compels users to click but also\nwhat makes them tick.\n\nAlthough some companies are just waking up to this new reality, others\nare already cashing in. By mastering habit-forming product design, the\ncompanies profiled in this book make their goods indispensable.\n\nFIRST TO MIND WINS\n\nCompanies that form strong user habits enjoy several benefits to their\nbottom line. These companies attach their product to internal triggers. As a\nresult, users show up without any external prompting.\n\nInstead of relying on expensive marketing, habit-forming companies link\ntheir services to the users’ daily routines and emotions.7 A habit is at work\nwhen users feel a tad bored and instantly open Twitter. They feel a pang of\nloneliness and before rational thought occurs, they are scrolling through\ntheir Facebook feeds. A question comes to mind and before searching their\nbrains, they query Google. The first-to-mind solution wins. In chapter 1 of\nthis book, we explore the competitive advantages of habit-forming products.\n\nHow do products create habits? The answer: They manufacture them.\nWhile fans of the television show Mad Men are familiar with how the ad\nindustry once created consumer desire during Madison Avenue's golden\nera, those days are long gone. A multiscreen world of ad-wary consumers\nhas rendered Don Draper's big-budget brainwashing useless to all but the\nbiggest brands.\n\nToday, small start-up teams can profoundly change behavior by guiding\nusers through a series of experiences | call hooks. The more often users run\nthrough these hooks, the more likely they are to form habits.\n",
                    "extracted-code": ""
                },
                {
                    "section_name": "How | Got Hooked",
                    "section_path": "./screenshots-images-2/chapter_1/section_2",
                    "images": [
                        "./screenshots-images-2/chapter_1/section_2/2b1e2337-789d-4fe9-a7ba-302de34933df.png",
                        "./screenshots-images-2/chapter_1/section_2/7b0a3e08-45f5-4f03-9250-35e0f6f0ba47.png",
                        "./screenshots-images-2/chapter_1/section_2/f2c4691c-9bf1-43e9-a253-0a424a6407f6.png",
                        "./screenshots-images-2/chapter_1/section_2/94dacdff-895d-4257-84da-bf54e781ae95.png",
                        "./screenshots-images-2/chapter_1/section_2/aabf0e3b-a906-4f61-8356-9b160defcdd4.png",
                        "./screenshots-images-2/chapter_1/section_2/76b1c3b1-d0db-4af4-b984-1c7b38ae9abf.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "In 2008 I was among a team of Stanford MBAs starting a company backed\nby some of the brightest investors in Silicon Valley. Our mission was to\nbuild a platform for placing advertising into the booming world of online\nsocial games.\n\nNotable companies were making hundreds of millions of dollars selling\nvirtual cows on digital farms while advertisers were spending huge sums of\n\nmoney to influence people to buy whatever they were peddling. I admit I\ndidn’t get it at first and found myself standing at the water’s edge\nwondering, “How do they do it?”\n\nAt the intersection of these two industries dependent on mind\nmanipulation, I embarked upon a journey to learn how products change our\nactions and, at times, create compulsions. How did these companies\nengineer user behavior? What were the moral implications of building\npotentially addictive products? Most important, could the same forces that\nmade these experiences so compelling also be used to build products to\nimprove people’s lives?\n\nWhere could I find the blueprints for forming habits? To my\ndisappointment, I found no guide. Businesses skilled in behavior design\nguarded their secrets, and although I uncovered books, white papers, and\nblog posts tangentially related to the topic, there was no how-to manual for\nbuilding habit-forming products.\n\nI began documenting my observations of hundreds of companies to\nuncover patterns in user-experience designs and functionality. Although\nevery business had its unique flavor, I sought to identify the commonalities\nbehind the winners and understand what was missing among the losers.\n\nI looked for insights from academia, drawing upon consumer\npsychology, human-computer interaction, and behavioral economics\nresearch. In 2011 I began sharing what I learned and started working as a\nconsultant to a host of Silicon Valley companies, from small start-ups to\nFortune 500 enterprises. Each client provided an opportunity to test my\ntheories, draw new insights, and refine my thinking. I began blogging about\nwhat I learned at NirAndFar.com, and my essays were syndicated to other\nsites. Readers soon began writing in with their own observations and\nexamples.\n\nIn the fall of 2012 Dr. Baba Shiv and I designed and taught a class at\nthe Stanford Graduate School of Business on the science of influencing\nhuman behavior. The next year, I partnered with Dr. Steph Habif to teach a\nsimilar course at the Hasso Plattner Institute of Design.\n\nThese years of distilled research and real-world experience resulted in\nthe creation of the Hook Model: a four-phase process companies use to\nforms habits.\n\nThrough consecutive Hook cycles, successful products reach their\nultimate goal of unprompted user engagement, bringing users back\nrepeatedly, without depending on costly advertising or aggressive\nmessaging.\n\nWhile I draw many examples from technology companies given my\nindustry background, hooks are everywhere—in apps, sports, movies,\ngames, and even our jobs. Hooks can be found in virtually any experience\nthat burrows into our minds (and often our wallets). The four steps of the\nHook Model provide the framework for the chapters of this book.\n\nThe Hook Model\n\nTrigger Action\n\nExternal\nInternal\n\nVariable\nReward\n\nInvestment\n\n1. Trigger\n\nA trigger is the actuator of behavior—the spark plug in the engine. Triggers\ncome in two types: external and internal.2 Habit-forming products start by\nalerting users with external triggers like an e-mail, a Web site link, or the\napp icon on a phone.\n\nFor example, suppose Barbra, a young woman in Pennsylvania,\nhappens to see a photo in her Facebook News Feed taken by a family\nmember from a rural part of the state. It’s a lovely picture and because she\nis planning a trip there with her brother Johnny, the external trigger’s call to\naction (in marketing and advertising lingo) intrigues her and she clicks. By\ncycling through successive hooks, users begin to form associations with\ninternal triggers, which attach to existing behaviors and emotions.\n\nWhen users start to automatically cue their next behavior, the new habit\nbecomes part of their everyday routine. Over time, Barbra associates\nFacebook with her need for social connection. Chapter 2 explores external\nand internal triggers, answering the question of how product designers\ndetermine which triggers are most effective.\n\n2. Action\n\nFollowing the trigger comes the action: the behavior done in anticipation of\na reward. The simple action of clicking on the interesting picture in her\nnews feed takes Barbra to a Web site called Pinterest, a “social\nbookmarking site with a virtual pinboard.”®\n\nThis phase of the Hook, as described in chapter 3, draws upon the art\nand science of usability design to reveal how products drive specific user\nactions. Companies leverage two basic pulleys of human behavior to\nincrease the likelihood of an action occurring: the ease of performing an\naction and the psychological motivation to do it12\n\nOnce Barbra completes the simple action of clicking on the photo, she\nis dazzled by what she sees next.\n\n3. Variable Reward\n\nWhat distinguishes the Hook Model from a plain vanilla feedback loop is\nthe Hook’s ability to create a craving. Feedback loops are all around us, but\npredictable ones don’t create desire. The unsurprising response of your\nfridge light turning on when you open the door doesn’t drive you to keep\nopening it again and again. However, add some variability to the mix—\nsuppose a different treat magically appears in your fridge every time you\nopen it—and voila, intrigue is created.\n\nVariable rewards are one of the most powerful tools companies\nimplement to hook users; chapter 4 explains them in further detail.\nResearch shows that levels of the neurotransmitter dopamine surge when\nthe brain is expecting a reward. Introducing variability multiplies the\neffect, creating a focused state, which suppresses the areas of the brain\nassociated with judgment and reason while activating the parts associated\nwith wanting and desire.!2 Although classic examples include slot machines\nand lotteries, variable rewards are prevalent in many other habit-forming\nproducts.\n\nWhen Barbra lands on Pinterest, not only does she see the image she\nintended to find, but she is also served a multitude of other glittering\nobjects. The images are related to what she is generally interested in—\nnamely things to see on her upcoming trip to rural Pennsylvania—but there\nare other things that catch her eye as well. The exciting juxtaposition of\nrelevant and irrelevant, tantalizing and plain, beautiful and common, sets\nher brain’s dopamine system aflutter with the promise of reward. Now she’s\nspending more time on Pinterest, hunting for the next wonderful thing to\nfind. Before she knows it, she’s spent forty-five minutes scrolling.\n\nChapter 4 also explores why some people eventually lose their taste for\ncertain experiences and how variability impacts their retention.\n\n4. Investment\n\nThe last phase of the Hook Model is where the user does a bit of work. The\ninvestment phase increases the odds that the user will make another pass\nthrough the Hook cycle in the future. The investment occurs when the user\nputs something into the product of service such as time, data, effort, social\ncapital, or money.\n\nHowever, the investment phase isn’t about users opening up their\nwallets and moving on with their day. Rather, the investment implies an\naction that improves the service for the next go-around. Inviting friends,\nstating preferences, building virtual assets, and learning to use new features\nare all investments users make to improve their experience. These\ncommitments can be leveraged to make the trigger more engaging, the\naction easier, and the reward more exciting with every pass through the\nHook cycle. Chapter 5 delves into how investments encourage users to\ncycle through successive hooks.\n\nAs Barbra enjoys endlessly scrolling through the Pinterest cornucopia,\nshe builds a desire to keep the things that delight her. By collecting items,\nshe gives the site data about her preferences. Soon she will follow, pin,\nrepin, and make other investments, which serve to increase her ties to the\nsite and prime her for future loops through the Hook.\n",
                    "extracted-code": ""
                },
                {
                    "section_name": "A New Superpower",
                    "section_path": "./screenshots-images-2/chapter_1/section_3",
                    "images": [
                        "./screenshots-images-2/chapter_1/section_3/9a93377f-9a66-4a2a-87b2-66e9247a3af7.png",
                        "./screenshots-images-2/chapter_1/section_3/c2e82a95-bab8-45f2-883b-6f30ac318a4f.png",
                        "./screenshots-images-2/chapter_1/section_3/724a308d-2a7b-4447-9234-43598907073a.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Habit-forming technology is already here, and it is being used to mold our\nlives. The fact that we have greater access to the web through our various\nconnected devices—smartphones and tablets, televisions, game consoles,\nand wearable technology—gives companies far greater ability to affect our\nbehavior.\n\nAs companies combine their increased connectivity to consumers, with\nthe ability to collect, mine, and process customer data at faster speeds, we\nare faced with a future where everything becomes potentially more habit\nforming. As famed Silicon Valley investor Paul Graham writes, “Unless the\nforms of technological progress that produced these things are subject to\ndifferent laws than technological progress in general, the world will get\nmore addictive in the next 40 years than it did in the last 40.”15 Chapter 6\nexplores this new reality and discusses the morality of manipulation.\n\nRecently, a blog reader e-mailed me, “If it can’t be used for evil, it’s not\na superpower.” He’s right. And under this definition, building habit-forming\nproducts is indeed a superpower. If used irresponsibly, bad habits can\nquickly degenerate into mindless, zombielike addictions.\n\nDid you recognize Barbra and her brother Johnny from the previous\nexample? Zombie film buffs likely did. They are characters from the classic\nhorror flick Night of the Living Dead, a story about people possessed by a\nmysterious force, which compels their every action.“\n\nNo doubt you’ve noticed the resurgence of the zombie genre over the\npast several years. Games like Resident Evil, television shows like The\nWalking Dead, and movies including World War Z are a testament to the\ncreatures’ growing appeal. But why are zombies suddenly so fascinating?\nPerhaps technology’s unstoppable progress—ever more pervasive and\npersuasive—has grabbed us in a fearful malaise at the thought of being\ninvoluntarily controlled.\n\nAlthough the fear is palpable, we are like the heroes in every zombie\nfilm—threatened but ultimately more powerful. I have come to learn that\nhabit-forming products can do far more good than harm. Choice\narchitecture, a concept described by famed scholars Thaler, Sunstein, and\nBalz in their same-titled scholarly paper, offers techniques to influence\npeople’s decisions and affect behavioral outcomes. Ultimately, though, the\npractice should be “used to help nudge people to make better choices (as\njudged by themselves).”1° Accordingly, this book teaches innovators how to\nbuild products to help people do the things they already want to do but, for\nlack of a solution, don’t do.\n\nHooked seeks to unleash the tremendous new powers innovators and\nentrepreneurs have to influence the everyday lives of billions of people. I\nbelieve the trinity of access, data, and speed presents unprecedented\nopportunities to create positive habits.\n\nWhen harnessed correctly, technology can enhance lives through\nhealthful behaviors that improve our relationships, make us\nsmarter, and increase productivity.\n\nThe Hook Model explains the rationale behind the design of many\nsuccessful habit-forming products and services we use daily. Although not\nexhaustive given the vast amount of academic literature available, the\nmodel is intended to be a practical tool (rather than a theoretical one) made\nfor entrepreneurs and innovators who aim to use habits for good. In this\n\nbook I have compiled the most relevant research, shared actionable insights,\nand provided a practical framework designed to increase the innovator’s\nodds of success.\n\nHooks connect the user’s problem with a company’s solution frequently\nenough to form a habit. My goal is to provide you with a deeper\nunderstanding of how certain products change what we do and, by\nextension, who we are.\n",
                    "extracted-code": ""
                }
            ]
        }
    ]
}