{
    "chapters": [
        {
            "chapter_name": "INTRODUCTION",
            "chapter_path": "./screenshots-images-2/chapter_1",
            "sections": [
                {
                    "section_name": "adIntroduction To Book",
                    "section_path": "./screenshots-images-2/chapter_1/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_1/section_1/b444a060-31d0-4516-9fac-518ae3bcc58e.png",
                        "./screenshots-images-2/chapter_1/section_1/27e4c864-39b4-487a-bb06-a96599ab1be9.png",
                        "./screenshots-images-2/chapter_1/section_1/8b176c14-34aa-475f-9fa2-5113ab0a5ab5.png",
                        "./screenshots-images-2/chapter_1/section_1/73dd115c-c938-451b-9358-cb582b9643ed.png",
                        "./screenshots-images-2/chapter_1/section_1/babaff8a-94ba-43d3-8ee5-8b76d5e30686.png",
                        "./screenshots-images-2/chapter_1/section_1/4f96382f-dac8-4a49-8a1a-ec1ef4308d31.png",
                        "./screenshots-images-2/chapter_1/section_1/2a04255b-14ee-4af8-9a39-7c7073fcd384.png",
                        "./screenshots-images-2/chapter_1/section_1/90138b27-dedf-48c1-9df7-85f891d81d1e.png",
                        "./screenshots-images-2/chapter_1/section_1/4a719d1b-4d6b-4981-b541-108702100f05.png",
                        "./screenshots-images-2/chapter_1/section_1/b5525d5e-4aa1-47b7-a968-57ae71a4677f.png",
                        "./screenshots-images-2/chapter_1/section_1/96a2942c-b75f-4fcf-ba2f-6a5466d39db2.png",
                        "./screenshots-images-2/chapter_1/section_1/2b9ec370-318b-4748-b9ea-e5f2a068f4e9.png",
                        "./screenshots-images-2/chapter_1/section_1/99871176-a93b-41f5-8430-fe0e1cb6743a.png",
                        "./screenshots-images-2/chapter_1/section_1/8e2ac602-598b-4c41-a8ca-f4b4fc097984.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Concept of Limited Government, Fundamental Rights, Natural Law,\nHigher Law and the Impact on Judicial Review of Constitutional\nCourts\n\nThe very concept of judgments bringing about wide-ranging social changes\npresupposes that the courts not only interpret laws, but that in the process of\ninterpretation they also declare laws, which has the effect of making laws.\nThis process of constitutional interpretation, better known in constitutional\nparlance as judicial review, is inevitable in India, where we have a written\nConstitution with a chapter on fundamental rights. These features of the\nConstitution automatically lead to the concept of a limited government.\n\nOur Constitution is based on three fundamentals, which form the core of\nconstitutionalism. They are:\n\n(1) A written Constitution\n(2) A chapter on fundamental rights\n(3) Limited government\n\nThe concept of a limited government is the obvious corollary of two other\nfundamental tenets. This concept is based on the postulate that the powers\nof governmental authorities are limited by law. Neither the executive nor\nthe legislature can act beyond the limits of the law.\n\nArticle 73 of the Constitution clearly stipulates that, subject to the\nConstitution, the executive power of the union shall extend to matters in\nrespect of which Parliament has the power to make laws. Article 162 of the\nConstitution subjects the executive power of the state to the same\nlimitations. The executive power is thus coterminous with legislative power.\n\nThat is why it is said in all representative democracies that the government\nis one of laws and not of men. This principle was first incorporated in the\nConstitution of Massachusetts, 1780! and was subsequently followed in the\ncelebrated decision in Marbury v. Madison. Chief Justice Marshall,\ndelivering the judgment, expressly said: ‘The Government of the United\nStates has been emphatically termed a government of laws and not of\nmen’. This doctrine introduced in American jurisprudence has been\nphrased beautifully in the words of Woodrow Wilson: ‘The history of\nliberty is a history of the limitation of governmental power, not the increase\nof it.’3\n\nIn the Indian context also, any talk of the Dicean concept of\nomnipotence of Parliament is totally misplaced. The parliamentary system,\nwhich is introduced in our Constitution, subjects Parliament to various\nlimitations. One of them is the control exercised by the Constitution over\nthe distribution of legislative power. In view of Article 245 of the\nConstitution, Part XI thereof provides that Parliament may make laws,\nsubject to ‘the other provisions in the Constitution’. This limitation has\nmany facets and unfolds itself in the form of subject-wise demarcation\nbetween the union and the states in the matter of making laws. This is\nspecifically spelt out in Article 246 and its various sub-articles which talk\nof three lists—union, concurrent and state. There are other provisions in this\npart, mandating which law will prevail in case of any repugnancy between\nunion and state laws. And our Constitution, in view of its dominant unitary\ncharacter, has leaned in favour of the union laws. However, it is clear that in\nits own field each legislature is supreme. The next limitation on the power\nis already indicated in Article 245: ‘the other provisions of the\nConstitution’. The other provisions would obviously include Part III of the\nConstitution, which is the chapter on fundamental rights.\n\nThe expression ‘fundamental right’ was first used in the US Supreme\nCourt by Justice Washington, sitting on circuit, in the case of Corfield v.\nCoryell.* The learned judge explained the concept by saying:\n\n[W]e feel no hesitation in confining these expressions to those\nprivileges and immunities which are, in their nature, fundamental,\nwhich belong, of right, to the citizens of all free governments and\nwhich have, at all times, been enjoyed by the citizens of the several\nStates which compose this Union...°\n\nBut it was not until 1937 that Justice Curdozo of the US Supreme Court\nformulated for the first time the concept of fundamental rights as a doctrine\nin Palko v. Connecticut and held that some rights are fundamental as they\n‘represent the very essence of a scheme of ordered liberty... principles of\njustice so rooted in the traditions and conscience of our people as to be\nmarked as fundamental’.®\n\nThe framers of the Indian Constitution represented the people of India\nwho were suffering from oppression, deprivation and discrimination for\nabout two centuries of colonial rule. They realized that a chapter on\nfundamental rights is an essential safeguard against the recurrence of such\nan experience in the future. The Americans did the same after succeeding in\ntheir struggle for independence against British domination. While referring\nto the Bill of Rights in the Indian Constitution, Ivor Jennings pointed to\nthese features, saying: ‘The Indian reaction (in enacting the Bill of Rights)\nlike the American reaction, is in a large measure a product of the British\nrule’.” In the Constituent Assembly debates in India, a sub-committee on\nfundamental rights deliberated on the contents of these rights and the\ndistinguished members of that august body knew that fundamental rights\nwere the basic human rights, without which a free democracy was\nimpossible. A number of the members of the assembly expressed their\nopinions as these rights being permanent and inalienable.\n\nDr B.R. Ambedkar talked of these rights as principles that have become\n‘the silent, inarticulate premise of our outlook’®.\n\nDr S. Radhakrishnan, participating in the debates over these rights, said,\n‘THe declaration, which we make today, is of the nature of a pledge to our\nown people and a pact with the civilized world’.°\n\nThe reasons why fundamental rights are in the nature of natural rights\nand why these rights cannot be changed by law, and all laws made by the\nstate have to respect these rights, have been explained by the American\nSupreme Court in the case of Board of Education v. Barnette:\n\n...the very purpose of a Bill of Rights was to withdraw certain\nsubjects from the vicissitudes of political controversy, to place them\nbeyond the reach of majorities... and to establish them as legal\nprinciples to be applied by the court. One’s rights to life, liberty and\nproperty, to free speech, a free press, freedom of worship and\n\nassembly, and other fundamental rights may not be submitted to the\nvote; they depend on the outcome of no elections.!°\n\nOn fundamental rights there are some misconceptions, of which the most\nwidespread is that these rights are granted by the state. In fact, fundamental\nrights are nothing but natural rights. These are based on the primary\ninstincts of human beings, as shaped by their inherent perception of what is\nright and wrong. These rights are universal in all ages and inhere in every\nhuman being. The first corollary of this theory is that these rights, being\ninherent in human beings, existed even before the evolution of the state.\nHowever, with the growth of the state by way of social control, the ambit of\nthese inherent rights is limited by the collective interests of the society or\nstate in which a person lives. Therefore, any civilized state will have to\nrecognize these rights, not in an unbridled form, but regulated in the larger\nand collective interests of the state. As it is often said, I have a right to\nswing my arm, but I must not hurt someone’s nose while doing so. It is on\nthese postulates that we now have six basic rights which are in the nature of\nnatural human rights and are grouped as fundamental rights in Part III under\nArticle 19(1)(a), (b), (c), (d), (e) and (g), but they are all subject to\nreasonable restrictions imposed on them by laws on certain grounds\nenumerated in articles 19(2), (3), (4), (5) and (6). Therefore, these\nfundamental rights are not granted by the state or the legislature, but are\nnatural rights of human beings and have been recognized by the state as\nfundamental but not absolute, and the power of the legislature is subject to\nthese rights. Most of these fundamental rights under Part III of our\nConstitution are natural law rights.\n\nThe second question which has to be clarified about the nature of\nfundamental rights is whether these rights are antecedent to the formation of\nthe state as inalienable rights of human beings. They are the irreducible,\nminimum conditions for the free existence of man. These rights stand above\nthe law of the land and, being universal in nature, are common to civilized\nsociety everywhere in the world. Thus, they are known as higher laws.\n\nAbout the concept of these natural rights which are enumerated as\nfundamental rights, Alexander Hamilton had said long ago, in 1775: ‘The\nsacred rights of mankind are not to be rummaged for, among old\nparchments or musty records. They are written, as with a sun beam, in the\n\nwhole volume of human nature, by the hand of the divinity itself; and can\nnever be erased or obscured by mortal power.’!\"\n\nJohn Adams, the second president of the United States, articulated the\nprinciples behind these rights succinctly:\n\nYou have rights antecedent to all earthly government—rights that\ncannot be repealed or restrained by human laws—rights derived\nfrom the great Legislature of the Universe... British liberties are not\nthe grants of princes or parliaments, but original rights, conditions\nof original contracts coequal with prerogative and coeval with\ngovernment.\n\nThere is thus a distinction between natural rights and civil rights. Civil\nrights are those rights which are available to human beings in view of\nhis/her being a member of a civil society. But every ‘civil right’, as rightly\npointed out by Thomas Paine, ‘has for its foundation some natural right pre-\nexisting in the individual, but to the enjoyment of which his individual\npower is not, in all cases, sufficiently competent’.!2\n\nCivil rights being man-made are thus distinct from natural rights. This\ndichotomy has been tersely put in Jowitt’s Dictionary of English Law by\ndefining natural rights as ‘rules derived from God, reason or nature, as\ndistinct from man-made law’ .!3\n\nWilliam Blackstone explained the distinction and correlation between\nnatural law and civil law or man-made law with great clarity.\n\nThis law of nature, being coeval with mankind, and dictated by God\nhimself, is of course superior in obligation to any other. It is binding\nover all the globe in all countries and all times; no human laws are\nof any validity, if contrary to this; and such of them as are valid\nderive all their force and all their authority, mediately or\nimmediately, from this original.!4\n\nNatural laws over the centuries have made an invaluable contribution to the\ndevelopment of positive law in many countries. The origin and\ndevelopment of equity in England owed much to natural law. It is this\nconcept of natural law which influenced the drafting of the Constitution of\nthe United States and of various states. It is the starting point of modern\ninternational law and international conventions, covenants and declarations.\n\nThis is the concept of constitutionalism with limited government under\na written Constitution. It is clear from what is discussed above that a written\nConstitution has its philosophical roots in the idea of natural law and is\nbased on the hypothesis of a ‘higher law’. This concept of a higher law\nbecame very pronounced with the adoption, in 1787, of the American\nConstitution, which is possibly the first written Constitution of a\nconfederation in the true sense of the term. After that the democratic and\nthe civilized world understood that a written Constitution has to always be\nin tune with democratic principles, as it incorporates in an organic law the\nfruits of natural law, which are the inalienable rights of human beings.\nThese natural laws are to act as limitations upon the organs of the state and\ncannot be left at the mercy of the majority in a Parliament.\n\nIn our country, after full deliberations and debates in the Constituent\nAssembly, the written Constitution was adopted with a provision for\njudicial review and limited government. It will be an antithesis of\nconstitutionalism in India if, ignoring these basic features, the concept of\nparliamentary sovereignty is asserted. This has been laid down by the\nSupreme Court in the case of Golaknath to the following effect: ‘No\nauthority under the Constitution is supreme: the Constitution is supreme\nand all the authorities function under the supreme law of the land.’!>\n\nInsofar as England was concemed, its parliamentary supremacy rests on\nthe good sense of the people in the system of responsible government.\nThese principles were aptly summed up by Lord Wright in Liversidge v.\nAnderson: ‘In the Constitution of this country there are no guaranteed\nrights. The safeguard of the British liberty is in the good sense of the people\nand in the system of representative and responsible government which has\nbeen evolved.’1®\n\nHowever, subsequent opinion of the jurists in England leant towards\nimposing restrictions on parliamentary supremacy. In the Hamlyn lecture\ndelivered by Richard O’Sullivan, one of the senior-most king’s counsel of\nEngland, titled ‘The Inheritance of the Common Law’ (1950), it is said:\n\nIt is perhaps not good for the health of a political community that\nthe acts of the Legislature should be allowed to prevail over\nfundamental moral and ethical principles. Nor is it good that the\npeople of any realm should (even in theory) be without any\nconstitutional guarantee of fundamental human rights.!”\n\nThe learned author reiterated the same position further:\n\nIt is, you may think, a little odd that the people who gave to the\nworld the inheritance of the Common Law should be compelled to\nrely upon a Declaration of Convention of International Law for the\nsafeguarding of their fundamental human rights. One way or\nanother it is essential that these rights shall be safeguarded.!8\n\nThe position in England substantially changed with the coming into force of\nthe Human Rights Act (HRA), 1998, on 2 October 2000. It is one of the\ntwists of history, a quirk of fate, that the said act came into effect in\nEngland on 2 October, the birthday of Mahatma Gandhi, who fought for the\ncause of human rights in India during the British rule.\n\nHowever, the act has brought about a sea change in the administration\nof justice in England. About the impact of the HRA on British\njurisprudence, Lord Irvine said: ‘No measure of law reform has had such\nwide and profound effects on administrative law as has the HRA.’!9\n\nWhen HRA came into force, Jack Straw, the home secretary of England,\ndescribed it as ‘the first Bill of Rights this country has seen for three\ncenturies’.2° Section 3 of the act enjoins that the courts should interpret all\nlaws compatibly with conventional rights ‘as far as possible’. Section 4 of\nthe act provides that the court ‘may’ issue a declaration of incompatibility if\nany primary or subordinate legislation is found incompatible with\nconvention rights, which are mentioned in Schedule 1 of the act in terms of\nSection 1 (3). The schedule provided the United Kingdom, for the first time,\na list of codified human rights enforceable in domestic courts.\n\nThis interpretative power of the court has been called a strong\nadjuration”! and applies to both pre- and post-HRA laws. Similarly, Article\n13 of our Constitution mandates that unless both pre- and post-\nconstitutional laws comply with fundamental rights, they will be declared\nvoid. But unlike Article 13, by the Section 3 interpretation, courts in\nEngland cannot invalidate a statute even if it is found incompatible with\nconvention rights.\n\nSection 2 of the act gives an indication of the materials to be taken into\naccount by the court in the determination of a question of incompatibility.\nJudgments, decisions, declaration and even the advisory opinion of the\nEuropean Constitution of Human Rights are relevant in such determination.\n\nHowever, both sections 3 and 4 of the act make it clear that\ninterpretation of incompatibility by a court or even a declaration to that\neffect does not affect the validity, continuing operation or enforcement of\nthe provision in respect of which the declaration is given.\n\nBut such declarations are not mere empty rituals, as Section 10 of the\nact provides for remedial action under which Parliament may respond to\nsuch a declaration by amending the offending law in a normal way. And\nSection 10 (2) fast-tracks the amendment strategy by empowering the\nminister to remove the incompatibility taint from the law if the minister\nfinds that there are ‘compelling’ reasons to do so.\n\nIn order to ensure that post-HRA laws are convention-compliant,\nSection 19 of the act provides that while introducing the bill to the\nParliament, the concerned minister, before the second reading of the bill,\nmay give a statement that in his view the law is convention-compatible; or\nhe may say that he is unable to make such a statement but the House may\nproceed with the bill.\n\nSection 19 was initially believed to be a ‘parrot provision’ but with the\nestablishment of the Parliamentary Joint Committee on Human Rights\n(JCHR) in 2001, the working of Section 19 is monitored. The Joint\nCommittee also reports to Parliament on the convention-compatibility, or\nthe lack of it, in the bills. Now, it has become a government practice to\ninclude an outline of the government’s view on compatibility, by way of\nexplanatory notes to every bill.\n\nThe act has thus acquired the status of a constitutional law2? and has\nexalted both the profile and influence of higher courts, giving the judiciary\na newly invigorated position...in matters of public law”.\n\nProfessor Sir William Wade in Administrative Law (Ninth Edition)\ntraced the new concept of compatibility in English law by which the courts\ntry to reconcile the convention rights, which are akin to fundamental rights\nin our country, with the laws made by Parliament. Thus, the twin concepts\nof limited government and higher law became the two most emerging\ntrends in British jurisprudence.\n\nLord Chancellor Lord Irvine said:\n\nWe believe that it is right as a matter of principle for the courts to\nhave the duty of acting compatibly with the Convention not only in\ncases involving other public authorities but also in developing the\n\ncommon law in deciding cases between individuals. Why should\nthey not?24\n\nThe question posed by the lord chancellor has been admirably answered by\nProfessor Wade in his treatise on administrative law:\n\nHuman rights under the Convention may conflict with the Acts of\nParliament, as already mentioned, and have done so frequently. The\nAct addresses this problem with a remarkable amalgam of judicial,\nlegislative and administrative procedures, designed to respect the\nsovereignty of Parliament while at the same time protecting human\nrights. In the first place, the court must strive to avoid conflict by\nbenevolent construction. But if that proves impossible, the court\nmay make a ‘declaration of incompatibility’, whereupon it is for the\ngovernment and Parliament to take ‘remedial action’ if they think\nfit. This is a very different policy from that of the European\nCommunities Act, 1972, which incorporated the law of the\nEuropean Union by providing simply that it should prevail with\nparamount effect, overriding the sovereignty of Parliament\nwhenever necessary.\n\nThe rule of construction is that legislation, both primary and\nsubordinate, and whenever enacted, must be ‘read and given effect\nin a way which is compatible with the Convention rights’ ‘so far as\nit is possible to do so’. In other words, instead of seeking the true\nintention of Parliament at the time of the enactment, the court must\nadopt the interpretation which is the more favourable to a\nConvention right.°\n\nThe consequence of a declaration of incompatibility by the court of a\nparliamentary statute has also been discussed by Wade:\n\nWhere a declaration of incompatibility is made, and no appeal is\npending, or where incompatibility is revealed by a later decision of\nthe European Court of Human Rights, the appropriate minister must\nconsider whether there are ‘compelling reasons’ for amending the\nconflicting legislation. If so, he may by order make such\namendments to the legislation as he considers necessary to remove\nthe incompatibility.2°\n\nThe doctrine of compatibility which was evolved in England is a typical\nexample of British compromise between competing claims of parliamentary\nsovereignty and the jurisprudential concept of a higher law articulated in\nconvention rights. Even though constitutionalism in Britain has not\naccepted the doctrine of basic structure, after the HRA, constitutional\njurisprudence in Britain virtually veered round to something akin to the said\ndoctrine, and the court’s power of judicial review over laws made by\nparliamentary statute was firmly established.\n\nAdmittedly, the court’s power in the United States encompassed the\npower of judicial review, including the power to nullify any legislation\nwhich is unconstitutional. This is based on the theory that if a law is made\ninconsistent with power vested in the Parliament, then the judges, in view\nof their independence and in view of the defined power of the Parliament,\ncan declare such a law to be void, in order to guard the Constitution. It is\naxiomatic that any law enacted by the Parliament, contrary to the\nConstitution, has no force.\n\nTherefore, the judicial review has been endorsed by Alexander\nHamilton in ‘The Federalist’ in the following terms:\n\nThe interpretation of the laws is the proper and peculiar province of\nthe courts. A Constitution is, in fact, and must be regarded by the\njudges as, a fundamental law. It therefore belongs to them to\nascertain its meaning as well as the meaning of any particular act\nproceeding from the legislative body. If there should happen to be\nirreconcilable variance between the two, that which has the superior\nobligation and validity ought, of course, to be preferred, or, in other\nwords, the Constitution ought to be preferred to the statute, the\nintention of the people or the intention of their agents.”\n\nThe jurisdiction of judicial review, which has been vested in the judges by\nthe Constitution, argued Hamilton, represents the will of the people, and\nParliament, consisting of the representatives of the people, virtually acts in\nthe position of peoples’ delegates. No act of the delegate can overthrow the\nwill of the people. Hamilton further clarified by saying that in nullifying an\nact of Parliament, the judiciary does not assume a position superior to the\nCongress. Hamilton explained:\n\nNor does this conclusion by any means suppose a superiority of the\njudicial to the legislative power. It only supposes that the power of\nthe people is superior to both, and that where the will of the\nlegislature, declared in its statutes, stands in opposition to that of the\npeople, declared in the Constitution, the judges ought to be\ngoverned by the latter rather than the former. They ought to regulate\ntheir decisions by the fundamental laws rather than those which are\nnot fundamental.?°\n\nAccording to Hamilton, it is only the judiciary which can police on this\nlimitation on the legislature and he made this very clear by the following\nargument:\n\nLimitation of this kind can be preserved in practice [in] no other\nway than through the medium of courts of justice, whose duty it\nmust be to declare all acts contrary to the manifest tenor of the\nConstitution void. Without this, all the reservations of particular\nrights or privileges would amount to nothing.2°\n\nIn India, we have accepted the American concept of limited government,\njudicial review and the idea of higher law under Part III of the Constitution.\nApart from that, the Indian Constitution specifically provides in Article 13\nthat the state cannot make any law which ‘takes away’ or even ‘abridges’\nthe rights under Part III. In case it does, such a law will be void. It is only\nthe judiciary which can declare a law void. This is a unique feature in our\nConstitution and is not found elsewhere.\n\nSimilarly, on the several fundamental rights in Article 19, discussed\nabove, reasonable restrictions can be imposed by law. The obvious question\nis who can decide whether or not the restriction is reasonable? Only the\ncourts can decide the same. Article 32 of the Constitution is another\nprovision which fortifies the court’s power of judicial review, as any person\ncan enforce his/her fundamental right by moving the Supreme Court—this\nright conferred on a person under Article 32 is itself a fundamental right.\nThe importance of this article was lucidly explained by Dr Ambedkar in the\nConstituent Assembly when he said:\n\nIf I was asked to name any particular article in this Constitution as\nthe most important article without which the Constitution would be\n\na nullity—I could not refer to any other article except this one. It is\nthe very soul of the Constitution and the very heart of it and I am\nglad that the house has realised its importance.°°\n\nArticle 226 of the Constitution, which empowers the High Courts in this\ncountry to exercise the power of judicial review in case of complaints of\nviolation of fundamental rights or any other legal right, also entrenches the\npower of judicial review. About the sweep of the court’s power under\narticles 32 and 226, what the Supreme Court said, as early as in 1955, is\nvery pertinent and worth remembering:\n\nThe language used in Articles 32 and 226 of our Constitution is very\nwide and the powers of the Supreme Court as well of all High\nCourts in India extend to issuing all orders, writs or directions,\nincluding writs in the nature of habeas corpus, mandamus, quo\nwarranto, prohibition and certiorari as may be considered necessary\nfor enforcement of fundamental rights, and in the case of High\nCourts for other purposes as well. In view of the express provision\nof our Constitution we need not now look back to the early history\nor the procedural technicalities of these writs in English law nor feel\noppressed by difference or change of opinion expressed in particular\ncases by English judges.*!\n\nIn view of these constitutional provisions, the power of judicial review in\nIndia is much more deep-rooted than it is in England. Of course, recent\ntrends in the English court, as pointed out earlier, indicate a strengthening\nof the powers of judicial review.\n\nArticles 141 and 142 of the Constitution empower the Supreme Court\nthat in exercise of its power of judicial review it can declare a ‘law’ which\nshall be binding on all courts in India. It has been held that the power of\ndeclaring law is wider than the power of making law. This is a unique\npower of the Indian Supreme Court, not to be found in other Constitutions.\nWhat has been very thoughtfully explained by President Roosevelt in his\nspeech is virtually true of the Supreme Court’s power under Article 141.\nThe American president said:\n\nThe chief lawmakers in our country may be, and often are, the\njudges, because they are the final seat of authority. Every time they\n\ninterpret contract, property, vested rights, due process of law, liberty,\nthey necessarily enact into law parts of a system of social\nphilosophy; and as such interpretation is fundamental, they give\ndirection to all law-making.°?\n\nArticle 142 enables the Supreme Court to pass such decrees or orders as are\nnecessary for doing complete justice in any cause or matter pending before\nit. This provision, along with Article 136 of the Constitution, authorize the\nSupreme Court to exercise the widest possible discretion while acting in\nexercise of its power of judicial review. This is also a unique feature of our\nConstitution, which strengthens the court’s power of judicial review.\n\nIn the epoch-making decision in the case of Kesavananda Bharati,> the\nSupreme Court held that judicial review is one of the basic features of the\nConstitution. In the subsequent Constitution decision by the Supreme Court\nin the case of L. Chandra Kumar v. Union of India“, the Supreme Court,\nafter an analysis of the ratio in the case of Kesavananda Bharati and some\nother decisions, came to the conclusion that judicial review is the basic\nfeature of the Constitution of India.\n\nIn view of this clear constitutional dispensation, the Supreme Court of\nIndia has delivered many judgments, discussed in the subsequent chapters,\nwhich have impacted not only our laws but also greatly influenced the\nsocial life of India. Those judgments, being delivered by the last court in a\ncountry of over 1.2 billion people, the largest democracy in the world, have\nalso influenced jurisprudential trends in other countries.\n\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "THE BASIC STRUCTURE DOCTRINE\nEVOLVED TO PROTECT CORE\nCONSTITUTIONAL VALUES",
            "chapter_path": "./screenshots-images-2/chapter_2",
            "sections": [
                {
                    "section_name": "Fundamental Rights and Parliament’s Power of Amendment of the\nConstitution",
                    "section_path": "./screenshots-images-2/chapter_2/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_2/section_1/43ae515f-5ec8-42fd-94d0-ce398f6d5deb.png",
                        "./screenshots-images-2/chapter_2/section_1/66b78ac3-4ccf-4fe9-bac1-0f379f2a151d.png",
                        "./screenshots-images-2/chapter_2/section_1/43c59b0c-fa04-41e1-a0a2-4eda2a40baff.png",
                        "./screenshots-images-2/chapter_2/section_1/59c121b4-1067-4ad3-9a3b-9dbb23d476db.png",
                        "./screenshots-images-2/chapter_2/section_1/4a3a9543-998e-4fd8-83e9-065c559f7588.png",
                        "./screenshots-images-2/chapter_2/section_1/7660816f-2fed-46be-9440-c8c94256ad2f.png",
                        "./screenshots-images-2/chapter_2/section_1/ff108dd3-2ad7-429c-a467-0fffad0e1349.png",
                        "./screenshots-images-2/chapter_2/section_1/5b0549ff-3caf-44dc-8c65-88eb7b5c5be1.png",
                        "./screenshots-images-2/chapter_2/section_1/081ab89b-3250-4b93-af08-a0b470618d18.png",
                        "./screenshots-images-2/chapter_2/section_1/f3a90d60-f296-4a73-94c5-a3922bf2f112.png",
                        "./screenshots-images-2/chapter_2/section_1/1f05565b-b234-4708-91b5-f9230f7d2cfb.png",
                        "./screenshots-images-2/chapter_2/section_1/515e1c13-8afb-4807-8851-f12e1dddf5b4.png",
                        "./screenshots-images-2/chapter_2/section_1/88af0475-bcf7-4461-81c6-27217a9107a2.png",
                        "./screenshots-images-2/chapter_2/section_1/559d792d-0bc4-47c1-9089-9f0f013aa26c.png",
                        "./screenshots-images-2/chapter_2/section_1/ac21f2a0-8a61-4b57-8ef2-0f662541ed8f.png",
                        "./screenshots-images-2/chapter_2/section_1/f4fcc60c-ea34-4cf7-bdfd-3f412815934e.png",
                        "./screenshots-images-2/chapter_2/section_1/d16c4598-83a0-4a9a-b076-852c9c76779a.png",
                        "./screenshots-images-2/chapter_2/section_1/9a2bdc6d-8aec-4ceb-a509-5c1fcec9249a.png",
                        "./screenshots-images-2/chapter_2/section_1/004ccc9e-7bad-46d0-9d9b-f509a68cbf25.png",
                        "./screenshots-images-2/chapter_2/section_1/440522c9-3083-4f0d-9462-597695f5e2f8.png",
                        "./screenshots-images-2/chapter_2/section_1/98684454-fb32-4be6-b525-6b2262ffba17.png",
                        "./screenshots-images-2/chapter_2/section_1/c5af99dd-8646-430d-a618-b175efa6bc50.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "IN LOCATING THE landmark judgments which change India, I have decided to\nclub them under separate groups. The first group deals with judgments on\nthe controversy between Parliament’s power to amend the Constitution and\nthe Supreme Court’s power of judicial review of those amendments In this\ncontroversy, the key issue is whether Parliament, in the name of amending\nthe Constitution, can destroy its basic features. This controversy emerged\nprominently in at least the following six judgments:\n\n@\n\n(2)\n(3)\n\n(4)\n\n(5)\n6)\n\nSri Shankari Prasad Singh Deo v. Union of India and State of Bihar\n(AIR 1951 SC 458)\n\nSajjan Singh v. State of Rajasthan (AIR 1965 SC 845)\n\nI.C. Golaknath and Ors v. State of Punjab and Anr (AIR 1967 SC\n1643)\n\nKesavananda Bharati Sripadagalvaru and Ors v. State of Kerala and\nAnr ([1973] 4 SCC 225)\n\nIndira Nehru Gandhi v. Shri Raj Narain and Anr (1975 Supp SCC 1)\nMinerva Mills Ltd and Ors v. Union of India and Ors (AIR 1980 SC\n1789)\n\nThe amending power of a Constitution, more often than not, indicates the\nnature of the Constitution. For instance, the Constitution of England, being\nmostly unwritten, is like a tapestry, deftly woven and developed over\ncenturies. Its warp is monarchy and the woof is possibly the indomitable\nself-esteem of the descendants of the first Anglo-Saxon invaders. This\nConstitution is mostly impacted by constitutional values and doctrine and is\namendable by a simple majority of the legislature or by judicial decisions\nnot challenged by the state. International agreements, custom and traditional\nusage which has acquired constitutional status, can also amend the\nConstitution. Recently, the Human Rights Act (HRA), 1998, articulating\nEuropean Convention Rights, has acquired the status of a constitutional\ndocument and is a major influence on English constitutional jurisprudence,\nas discussed (supra).\n\nInsofar as the American Constitution is concerned, it can be amended\nunder Article 5, when two-thirds of both houses of Congress propose\namendments or when Congress is required by two-thirds of the state\nlegislatures to call a constitutional convention. Amendments have to be\nratified by three-fourths of the state legislature or conventions made on the\nmode of ratification proposed by Congress. No amendment, however, can\ndeprive any state of equal voting rights in the senate without its consent.\n\nDown under, the Australian Constitution posits under Chapter 8 that a\nproposed amendment has to be initiated by an absolute majority in each\nhouse, and after it is passed, a referendum has to be held. If only one house\npasses a proposed amendment, the governor general may also submit it to a\nreferendum. The provision for dual majority of votes is necessary for\napproval—a national majority and then majority in four of the six states\nmake constitutional amendment rather difficult.\n\nUnder the Indian Constitution there are various provisions dealing with\namendments. Here we are dealing with Article 368 of the Constitution,\nwhich requires a majority of the total membership of both houses of\nParliament and a majority of not less than two-thirds of the members,\npresent and voting. Ratification by not less than half the state legislatures is\nrequired in respect of a few chapters of some parts of the Constitution. Our\nConstitution has by now been amended about a hundred times. It is very\nsignificant that parts III and IV, which respectively deal with fundamental\nrights and directive principles of state policy, can be amended without any\nratification by the state. This has given rise to a lot of controversy, right\n\nfrom the very inception of the debate on Constitution amendment in the\ncase of Shankari Prasad’.\n\nArticle 13(2), which is in Part III of the Constitution, the chapter on\nfundamental rights, mandates that the state, which includes the Parliament,\ncannot make any law which abridges or takes away rights conferred by Part\nIIL, and that any law so made would be void.\n\nNow the question is whether a constitutional amendment would be\n‘law’ within the meaning of Article 13 of the Constitution. In Shankari\nPrasad, Justice Patanjali Shastri (as His Lordship then was) held that ‘in the\nabsence of a clear indication to the contrary’ it is difficult to hold that\nfundamental rights are ‘immune from Constitutional Amendment’ and\nfurther held that the terms of Article 368 are general and empower the\nParliament ‘to amend the Constitution without any exception’. On the\naforesaid reasoning it was held unanimously in Shankari Prasad that in the\ncontext of Article 13 ‘law’ would not mean amendment to the Constitution\nmade in exercise of constituent powers. The apparent conflict between\narticles 368 and 13(2) of the Constitution was resolved by the Supreme\nCourt by relying on the principles of harmonious construction. That is how\nthe 1st Amendment of the Constitution, introducing the 9th Schedule, was\nupheld by the Supreme Court. Almost identical questions, but in a different\ncontext, came up for consideration before the Constitution Bench of the\nSupreme Court in Sajjan Singh, wherein the constitutional validity of the\nConstitution (17th Amendment) Act, 1964, (henceforth referred to as the\n17th Constitution Amendment Act), was up for scrutiny. The most\nsignificant part of this judgment is the formulation by Chief Justice\nGajendragadkar, wherein the learned chief justice held that the dictionary\nmeaning of ‘amend’ cannot be relied on for construing the word ‘amend’ in\nArticle 368. It was held that the power to ‘amend’ in the context of Article\n368 ‘is a very wide power’ and cannot ‘be controlled by the literal\ndictionary meaning’.\n\nIt is observed, with respect, that while making such sweeping\nobservations the learned chief justice did not support it with any discernible\nline of reasoning except by relying on the reasons in Shankari Prasad\nwhich upheld the 1st Amendment to the Constitution.\n\nWith due respect, the reasoning of the learned judge in Shankari Prasad\nis far from being cogent. By quoting Dicey, the learned judge gave an inane\nperception of constituent power. The reasoning of the learned judge is\n\nmarked by what Mr Nariman described? as a lack of ‘a positivist approach’\nby not attempting ‘to plumb the depths’ of the silences of the Constitution\nand not to probe its ‘crevices’. That is why the learned judge was constantly\nruing the absence of clear intention in the text of the Constitution, and this\nled the learned judge to hold that fundamental rights are not immune from\nconstitutional amendments. The learned judge resolved the conflict between\narticles 13 and 368 by following harmonious construction—a canon of\nstatutory interpretation, without possibly appreciating that constitutional\ninterpretation is a different ballgame.\n\nUnfortunately the learned judge did not follow the mode of\nconstitutional interpretation contemporaneously advanced by Justice Vivian\nBose. His Lordship formulated that the words in the Constitution ‘are not\njust dull lifeless words static and hidebound as in some mummified\nmanuscripts, but living flames...tongues of dynamic fire potent [enough] to\nmould the future as well as guide the present’*. Justice Felix Frankfurter, in\nthe Steel Seizure Case, adhered to the same principle by saying, ‘[I]t is an\ninadmissible narrow conception of American Constitutional Law to confine\nit to the words of the Constitution and to disregard the gloss which life has\nwritten upon them.’°\n\nIn the opinion of Lawrence H. Tribe, the famous jurist, a true\ninterpretation of the Constitution by judges must echo their cognizance of\nits ‘dark invisible matter’®. This is true of Indian Constitutional Law and I\nwould venture to say, again with the highest respect, that a rather limited\ninterpretation of constitutional values was given by the Supreme Court in\nShankari Prasad (supra).\n\nIn Sajjan Singh, the Supreme Court held that the constituent power of\namendment can be exercised both prospectively and retrospectively. By\nfollowing the principle in Shankari Prasad, the majority opinion in Sajjan\nSingh affirmed that the word ‘law’ in Article 13 should be taken to exclude\nconstitutional amendment under Article 368, as it is made in exercise of\nconstituent power. In Sajjan Singh, even though the 17th Constitution\nAmendment Act was upheld by Justice Hidayatullah (as His Lordship then\nwas), His Lordship recorded his express dissent with the reasoning in\nShankari Prasad and opined that fundamental rights are far too\nfundamental to be made a plaything of a special majority. His Lordship\nrefused to accept that the chapter on fundamental rights, being a solemn\npart of the Constitution, could be on less firm ground than the articles and\n\nparts of the chapter mentioned in the proviso to Article 368, as amendment\nof these provisions require ratification. His Lordship also referred to the\nanomaly of not ratifying an amendment of Article 32 while doing it for an\namendment of Article 226, and declined to play a ‘grammarian’s role’ in\ninterpreting the Constitution. Thus, His Lordship refused to express a final\nopinion on the question of whether the law of amendment of the\nConstitution is outside the purview of Article 13(2).\n\nJustice Mudholkar also upheld the 17th Constitution Amendment Act,\nbut refused to accept that the view of the Supreme Court in Shankari\nPrasad was the last word. His Lordship, possibly for the first time while\ndealing with the fundamental rights, raised a question of basic features o:\nthe Constitution and argued for giving them ‘permanence’, opining that\notherwise amending them would amount to rewriting the Constitution.®\n\nTherefore, the seeds of the later doctrine in I.C. Golaknath v. State of\nPunjab and Ors, of unamendability of fundamental rights, were sown in the\nopinions of Justices Hidayatullah (as His Lordship then was) and\nMudholkar.\n\nThe earlier conflicts between the parliamentary power and judicial\nprotection of fundamental rights took final shape in the majority opinion in\nGolaknath®. In delivering the verdict, the learned chief justice relied on a\nlecture given by German scholar Dieter Conrad in India on ‘Implied\nLimitations of the Amending Power’.\n\nThe majority opinion in Golaknath was rendered by a majority of six to\nfive. The validity of the 1st, 4th and 17th Constitution Amendment Acts\ncame under scrutiny in the case. The majority held that these amendments\nabridged the scope of fundamental rights but since they were declared valid\nby previous decisions of the Supreme Court, they would, in view of the\ndoctrine of prospective overruling, ‘continue to be valid’ and the decision in\nGolaknath would have prospective operation. But from the date of the said\ndecision, Parliament would not have any power to amend any provision o:\nPart III of the Constitution or ‘to take away or abridge fundamental rights\nenshrined therein’ .!°\n\nThe decision in Golaknath was a turning point in the political, social\nand constitutional history of our country. It is clear that the Supreme Court,\nby changing its interpretative ‘methodology’, donned the lawmaking role.\nIn Golaknath, the majority opinion overruled the decisions in Shankari\nPrasad and Sajjan Singh and held that constitutional amendment is law\n\n\nwithin the meaning of Article 13(2) and is therefore void if it contravenes\nthe fundamental rights. Thus Golaknath started the great war, as opposed to\nearlier skirmishes in Sajjan Singh, between parliamentary and judicial\nsupremacy.\n\nThe majority judgment in Golaknath held that the power to amend the\nConstitution was not in Article 368. It merely provided for the procedure as\nthe marginal note to Article 368 indicated. It also held that the power to\namend the Constitution emanated from Entry 97, List I of Schedule VII.\nTherefore, any amendment to the Constitution was ‘law’ for the purpose of\nArticle 13(2).\n\nHowever, the ratio in Golaknath clearly restricted Parliament’s\namending power and thus imposed the constraints on legislative majority. In\na way, the ratio in Golaknath was openly counter-majoritarian and based on\nthe premise that fundamental rights are nothing but natural rights and no\npower exists in defiance of these rights anywhere in the Constitution, and\nnot even in the largest majority.'' Therefore the majority opinion in\nGolaknath gave a literal and positivist interpretation of articles 13(2) and\n368 of the Constitution. However, the then central government considered\nthe judgment in Golaknath a stumbling block for its march towards\nsocialism.\n\nTo virtually get over the judgment in Golaknath, the Constitution (24th\nAmendment) Act, 1971, (henceforth the 24th Constitution Amendment Act)\nwas introduced, bringing about, inter alia, some amendments to Article 368\nof the Constitution. In the 24th Constitution Amendment Act, it was made\nclear that Article 13(2) would not apply to constitutional amendment and\nthe marginal note to Article 368 was also changed. This amendment\nempowered Parliament to take away or abridge all or any of the\nfundamental rights and gave unlimited plenitude to the amending power of\nParliament.\n\nIn 1970, His Holiness Swami Kesavananda Bharati, pontiff of a Kerala\nmath, challenged the land reforms of the Kerala government by filing a\npetition before the Supreme Court under Article 32 to vindicate the\nfundamental rights of religious institutions to manage their properties.\nDuring the pendency of this writ petition before the Supreme Court came\nthe 24th Constitution Amendment Act, followed by the Constitution (25th\nAmendment) Act, 1971, and the Constitution (29th Amendment) Act, 1972,\n(henceforth 25th and 29th Constitution Amendment Acts, respectively).\n\nThe Kerala Land Reforms Act was included in the 9th Schedule by the 29th\nConstitution Amendment Act. The validity of these amendments was\nchallenged in an Article 32 proceeding which was pending before five\njudges. In August 1972, the matter was transferred to a thirteen-judge bench\nat a time when the Supreme Court had fifteen judges. The case was heard\nby the thirteen-judge bench from November 1972 to April 1973.\n\nIn the case of Kesavananda Bharati, out of thirteen judges, ten held that\nGolaknath was wrongly decided and had to be overruled and was, in fact,\noverruled. Chief Justice Sikri and Justice Shelat, who were part of the\nmajority led by Chief Justice Subba Rao in Golaknath, held otherwise.\n\nIn Kesavananda Bharati, the majority decided that the amending power\nof Parliament is distinct from legislative power and this power is wide\nenough to reach every part of the Constitution. However, this proposition\nwas qualified by holding that the basic structure of the Constitution is\nunamendable. In formulating the notion of basic structure we find that the\njudgment highlighted the concept of constitutional entrenchment in order to\ninsulate certain constitutional provisions from amendment. The majority\nvirtually held that there is some moral reality in the form of inherent\nprinciples which the Constitution purports to represent. The constitutional\nfundamentals being included in the map of a moral terrain, there are limits\nto which it can be changed so as not to snap the constitutionalism of the\nmoral principles which are entrenched in the Constitution. The idea of basic\nstructure is, thus, resting on constitutionalism as against democratic values.\n\nIn this monumental decision, thirteen judges gave eleven judgments.\nThe consensus of opinion upheld the amending powers of the Constitution\nin the 24th Constitution Amendment Act. Of the thirteen learned judges, six\njudges (Chief Justice Sikri, Justice Shelat, Justice Grover, Justice Hedge,\nJustice Mukherjee and Justice Jagmohan Reddy), even while upholding the\namending powers under the 24th Constitution Amendment Act by relying\non the principles of implied limitations of the amending power, opined that\nthe said power could not be utilized to emasculate the basic structures of the\nConstitution which, inter alia, include the fundamental rights.\n\nEleven separate and rather longish opinions of the Supreme Court in\nKesavananda Bharati have unfortunately created some doubts on many\nvital issues. Nevertheless, the decision in Kesavananda Bharati is a\nwatershed in the development of constitutional law in India. The judgment\nin this case has to be considered as the greatest contribution of the Supreme\n\nCourt to constitutional jurisprudence. However, in this case, the Supreme\nCourt accepted the plenary amending powers of Parliament and lifted the\nstumbling block of Article 13, placed there by the ratio of Golaknath. At the\nsame time, the decision in Kesavananda Bharati widened the scope of\njudicial review on the notion of basic structure to which all valid exercise of\namending powers must conform, as stated by Upendra Baxi.!?\n\nThe Theory of Implied Limitation on the amending powers of the\nConstitution, as formulated in Kesavananda Bharati, some commentators\nsuggest, fortified the basics of the Golaknath ratio in a way.\n\nIf we look at the amending powers under the Constitution, we find that\napart from Article 368, the word ‘amendment’ occurs in various parts of the\nConstitution, for example, in articles 4(1), 107, 111, 161(2) and 372. Also in\nParagraph 7 Part D of the 5th Schedule and in Paragraph 21(1) of the 6th\nSchedule. These amendments are different from the provisions of Article\n368 and the concept of basic structure is only relatable to the power of\nParliament under Article 368.\n\nThe doctrine of basic structure which is not mentioned in the\nConstitution has its genesis in the concept of implied limitation on the\npower of amendment under Article 368 of the Constitution. The words in\nthe Constitution are not ‘just dull, lifeless words static and hidebound as in\nsome mummified manuscript but are living flames intended to give a life to\na great nation and... tongues of dynamic power potent to mould the future\nas well as to guide the present’. These are the prophetic words of Justice\nVivian Bose in State of West Bengal v. Anwar Ali Sarkar'? when our\nconstitutional jurisprudence was at a nascent stage.\n\nSubsequently, also in Kesavananda Bharati, Chief Justice Sikri echoed\nthe same principle by saying that words in the Constitution cannot be\nconstrued in a vacuum. In saying so, the learned chief justice relied on the\nspeech of Lord Green in Biede v. General Accident Fire and Life Insurance\nCorporation\". The learned chief justice also referred to the formulations of\nJustice Holmes in Towne v. Eisner! where he held that ‘a word is not a\ncrystal, transparent and unchanged, it is a skin of living thought and may\nvary in colour and content according to the circumstances and the time in\nwhich it is used’. The learned chief justice also referred to an observation of\nLord Gowyer and Lord Wright that ‘a grant of power in general terms\nstanding by itself no doubt be construed in the wider sense, but it may be\n\nqualified by other express provisions of the same enactment, by the\nimplications of the context and even by...the general scheme of the Act’.!®\n\nFrom what is discussed above, it is apparent that the concept of implied\nlimitation on the amending power of Parliament under Article 368 of the\nConstitution virtually emanated from the silences of the Constitution.\nMichael Foley, in his treatise The Silence of Constitutions’, explained that\nwhat is said in the Constitution is important but what is not said, but is\nimplied in the silence from what is said, is equally important.\n\nNow, if the basis of the majority verdict in Kesavananda Bharati is\nanalysed, we would find that Chief Justice Sikri opined that the word\n‘amendment’ is not to be given the widest meaning.\n\nAs His Lordship upheld the Theory of Implied Limitations of\nAmending Power, the chief justice argued that unlimited amending power\nmay lead to totalitarianism and thus would enslave the people and\nultimately make the Constitution unamendable and rigid. The learned chief\njustice had the noble and grand design of the Constitution in view and held\nthat Article 368 of the Constitution had to be interpreted in the background\nof the said vision. He upheld the 24th Constitution Amendment Act, but\nmade it clear that it would not enable Parliament to change the fundamental\nfeatures of the Constitution by destroying fundamental rights and the\nidentity of the Constitution.\n\nChief Justice Sikri did not consider the directive principles of state\npolicy to be an integral part of the basic features of the Constitution. The\nlearned chief justice, on scrutiny of the 25th Constitution Amendment Act,\nheld that Article 31C is invalid. In doing so, he adopted a rights-based\napproach and opined that the directive principles cannot be given primacy\nover fundamental rights. However, the learned chief justice upheld the\nvalidity of Article 31(2).\n\nJustice Shelat and Justice Grover also were in favour of implied\nlimitation of amending powers. According to these judges, our Constitution\nhad been erected to bring about an egalitarian society which provides for\ndevelopment of the country in social, economic and political fields, without\naffecting the basic freedoms. Both Justice Shelat and Justice Grover upheld\nthe 25th Constitution Amendment Act, except its Section 3, which\nintroduced Article 31C. This article, according to the learned judges, was\nunconstitutional as it enabled the negation of the basic rights protected\nunder articles 14, 19 and 31; second, the power of amendment which was\n\nexclusively given to the Parliament could not be delegated to any other\nlegislative body of the country.\n\nHighlighting the structural unity of the Constitution, both Justice Shelat\nand Justice Grover concurred with Chief Justice Sikri by holding that\namendment power could not be controlled by the proviso to Article 368\nalone. Both the learned judges held that Article 368 must be construed\nnarrowly, and in construing the purport of the amendment, the judges were\nto consider other ‘aids of interpretation’, especially the Preamble. Both\njudges opined that the powers under the Constitution and its representative\ncharacter could not be equated with the power of the people who framed the\nConstitution. The learned judges held: ‘It cannot be overlooked that basic\ntheory of our Constitution is that “pouvoir constituent” is vested in the\npeople and was exercised, for and on behalf by the Constituent Assembly\nfor the purpose of framing the Constitution’ !8.\n\nJustices Shelat and Grover indicated the following to be the basic\nfeatures of the Constitution:\n\n(1) The supremacy of the Constitution.\n\n(2) The republican and democratic form of government and the\nsovereignty of the country.\n\n(3) The secular and federal character of the Constitution.\n\n(4) The demarcation of power between the legislature, the executive and\nthe judiciary.\n\n(5) The dignity of the individual secured by the various freedoms and\nbasic rights in Part III and the mandate to build a welfare state\ncontained in Part IV.\n\n(6) The unity and integrity of the nation.\n\nBut the judges maintained that basic features could never be exhaustively\nindicated.\n\nJustices Hegde and Mukherjee held that there could be no restriction on\namending power under Article 368 of the Constitution and that it could\nreach each and every part of the Constitution. However, THeir Lordships\nwere of the opinion that the meaning of ‘law’ in Article 13(2) must be\nconstrued harmoniously with Article 368 of the Constitution. Accordingly,\nJustices Hegde and Mukherjee opined that the identity and nature of the\nConstitution must remain unchanged and there was danger in\n\nacknowledging the unlimited amending power of Parliament. The learned\njudges argued that the substance of the original Constitution must be\nsustained and could not be done away with. Their Lordships also said that\nunder Article 60 of the Constitution, the president of India had taken an\noath to ‘preserve, protect and defend the Constitution’, so he could not\nassent to any amendment changing the basic features of the Constitution,\nwhich are permanent, and the fundamental features of the Constitution\ncould not be emasculated. The learned judges similarly held that clause (c)\nof the 25th Constitution Amendment Act, which introduced Article 31C,\nwas invalid.\n\nRelying on the concept of ‘popular sovereignty’, Justices Hegde and\nMukherjee decided that a close look at the Preamble would demonstrate\nthat the people of India had conferred the Constitution on themselves. This\ncannot be challenged before a court, which is a creature of the Constitution.\nThe judges also held that even though Parliament is vested with amending\npowers, being the creature of the Constitution, the ultimate sovereignty lies\nwith the people. They expressly opined: ‘When a power to amend the\nConstitution is given to the people, its contents can be construed to be larger\nthan when that power is given to a body constituted under that\nConstitution.’!2\n\nThe judges also held that our Constitution is based on a social\nphilosophy and that like religion, such a philosophy has some basic and\ncircumstantial features. Some features of our Constitution are so basic that\nthey cannot be destroyed, at least from within.”°\n\nThis is how the learned judges evolved the concept of implied limitation\non amending powers.\n\nJustice Jagmohan Reddy, while agreeing with Chief Justice Sikri on the\nmain points, held that the main issue before the Bench was to determine the\nscope of Parliament’s amending power under Article 368 of the\nConstitution.\n\nThe learned judge suggested two alternative methods to explore the\nproblem. The first was to assume that the amending power was ‘omni-\nsovereign’. In formulating this principle, the learned judge referred to the\nviews of Justice Holmes. The alternative view was to place on the\namending power a structural-cum-teleological interpretation as opposed to\nan analytical/literal construction. The learned judge, however, leaned in\nfavour of the latter view and held that to understand the purport of the\n\nconstitutional provisions, one had to consider the following: (1) our national\naspiration; (2) the objectives discussed in the Constituent Assembly and\nadopted in the Constitution, giving it the character of a democratic republic;\n(3) various other features, such as rights of individual citizens; (4) the duties\nof the state; (5) the distribution of legislative powers; and (6) the amending\npowers of the state. Therefore, Justice Reddy argued: ‘The edifice of our\nConstitution is built upon and stands on several props. Remove any of\nthem, the Constitution collapses. These are: (1) Sovereign Democratic\nRepublic; (2) Justice, social, economic and political; (3) Liberty of thought,\nexpression, belief, faith and worship; (4) Equality of status and\nopportunity.’2+\n\nThe opinion of Justice H.R. Khanna is of crucial import in formulating\nthe ratio in Kesavananda Bharati. It is his opinion, with which none of the\nother twelve judges fully agreed, that has become the law of the land.\nHowever, the golden common link between the opinions of Justice Khanna\nand the aforesaid six judges who opined in favour of citizens is that\nParliament cannot, while amending the Constitution, alter the basic\nframework of the Constitution, like abolishing the free democratic character\nof the republic. Nor can it dilute the integrity or unity of India or abolish the\nstates.\n\nOn Article 368 of the Constitution, Justice Khanna opined that there are\ncertain limitations inherent in the concept of amendment. His views are as\nfollows:\n\nIt may at this stage clarify that there are certain limitations which\ninhere and are implicit in the word ‘amendment’. These are\nlimitations which flow from the use of the [word] ‘amendment’ and\nrelate to the meaning or construction of the word ‘amendment’. This\naspect has been dealt with elsewhere while construing the word\n‘amendment’. Subject to this clarification, we may not advert to the\ntwo facets of the concept of implied limitations referred to above.”\n\nJustice Khanna made it further clear that by a process of amendment the\nConstitution could not be abrogated nor could its identity be lost. In the\nlucid exposition of this doctrine, he opined:\n\nWe may not deal with the question as to what is the scope of the\npower of amendment under Article 368. This would depend upon\n\nthe connotation of the word ‘amendment’. Question has been posed\nduring the arguments as to whether the power to amend under the\nabove article includes the power to completely abrogate the\nConstitution and replace it by an entirely new Constitution. The\nanswer to the above question, in my opinion, should be in the\nnegative. I am further of the opinion, that amendment of the\nConstitution necessarily contemplates that the Constitution has not\nto be abrogated but only changes have to be made in it. The word\n‘amendment’ postulates that the old Constitution survives without\nloss of its identity despite the change and continues even though it\nhas been subjected to alterations.”\n\nHis Lordship posed a question, asking what was meant by retaining the old\nConstitution, and answered it himself by saying that it meant ‘the retention\nof the basic structure or framework of the Constitution’ 74\n\nHis Lordship held very unerringly that ‘the language of Article 368\nlends support to the conclusion that one cannot, while acting under that\nArticle, repeal the existing Constitution and replace it by a new\nConstitution’.2°\n\nHis Lordship also held that to uphold the second part of Article 31C,\nwhich excludes judicial review, is opposed to the basic structure of the\nConstitution and is beyond ‘the permissible limits of what constitutes\namendment under Article 368’2°. However, Justice Khanna held that the\nright to property is not a part of the basic structure.\n\nThe jurisprudence evolved by Justice Khanna in his opinion in\nKesavananda Bharati had a high moral content. He introduced what can be\ntermed as the best moral interpretation of the Constitution and he was in\nfavour of both process-based and substance-based review. In a process-\nbased review, only the procedural propriety in reaching the decision is\nexamined by the court; however, in a substance-based review, the probe by\nthe court is much deeper.\n\nUltimately Justice Khanna recognized, in his opinion, the non-\nderogability of the basic structure of the Constitution. He accepted that the\nConstitution is sovereign, and since it has been adopted by the people, the\nsovereignty of the people merged with the constitutional sovereignty\nclothes it with non-derogable moral features, which constitute the basic\nstructure and are beyond the amending power under Article 368.\n\nIn appreciating the jurisprudence of the majority ratio in Kesavananda\nBharati one has to keep in mind a basic distinction. This is between\nconstitutional interpretation and construction of a constitutional text in such\na way as to design a new approach to constitutional values by weaving it\nout of the text of the written Constitution.\n\nOf course, the principles of construction cannot ignore the text, nor can\nthey be dehors the text of the Constitution, but they cannot rest at merely\ndiscovering a pre-existing deeply hidden meaning in the text. This is the\ndifference in approach in Kesavananda Bharati, as compared to the\napproach of the Supreme Court in its previous decisions in A.K. Gopalan v.\nState of Madras”’, Shankari Prasad and Sajjan Singh. In order to attempt a\nconstruction of the constitutional document, the judge or the jurist has to\nrely on the value-based vision of a judicial statesman rather than bank on\nthe ‘governing wit’ of a judge who considers himself bound by the black\nletter of the text. Construction of the constitutional text is therefore an\nembellishment and an addition to the fabric of constitutional fundamentals.\nIt is creative, whereas interpretation is mot necessarily creative.\nInterpretation is textual, but construction is conceptual.\n\nFor a proper perception of the basic structure doctrine, we may refer to\nRonald Dworkin’s precepts when he argues that the judicial review leading\nto construction does not present any serious counter-‘majoritarian’\ndifficulty at all. According to him, constitutionalism is meant to control the\nmajorities. Dworkin further elaborates: ‘The Constitution, and particularly\nthe Bill of Rights, is designed to protect individual citizens and groups\nagainst certain decisions that a majority of citizens might want to make,\neven when the majority acts in what it takes to be the general or common\ninterest. Such protection is rooted in the moral rights which individuals\npossess against the majority’ .2°\n\nIn Law’s Empire,” Dworkin claims that his vision of rights is based on\ncommitment to democracy. By democracy Dworkin, of course, does not\nmean majoritarianism only.\n\nThis view of Dworkin is borne out from the written Constitution of any\nfree democracy, which normally has an inbuilt content of counter-\nmajoritarian values. Our Constitution is not an exception. Our Constitution\nrecognizes certain fundamental freedoms in respect of every person, even if\nhe is not a citizen. This gives our Constitution the complexion of an\ninternational charter of human rights. Apart from that, it expressly assures\n\nthe minorities of several basic guarantees in the chapter on fundamental\nrights. Therefore, when the court has to uphold core constitutional values, it\nhas to fashion its jurisprudence on a counter-majoritarian basis. Thus, in\nadjudication of constitutional questions, the highest court has to conjoin the\njurisprudence of the original intent with constitutionalism, which in turn\nushers in a just social order. Therefore, judges have to reach beyond the\napparently impenetrable sphere of meaning by adopting the strategy of\nunravelling meaning in the constitutional text. This is why Alexander M.\nBickel correctly pointed out that ‘the root difficulty is that judicial review is\na counter-majoritarian force in our system’?°,\n\nIf we seek any support for justification of the basic structure doctrine\nfrom the text of our Constitution, we may refer to Article 38 that casts on\nthe state—which includes the higher judiciary—a duty to promote the\nwelfare of the people by securing and protecting social order in which\njustice—social, economic and political—is to inform all the institutions of\nnational life. This reflects the preambular vision. We find resonance of the\nsame view in Larry Simon’s approach when he says, ‘At a heuristic level,\nthe basic criterion for evaluating the arguments supporting the various\nmethodologies or interpretations is the extent to which those methodologies\nand interpretations promote a good and just society... The evaluative\nstandards must come from the external perspectives of political and moral\ntheory’.\n\nHowever, the basis of a changed approach in Kesavananda Bharati\nsprang from a realization by the judiciary that the powers of Parliament can\nbe plenary but they can never be arbitrary and the highest court may\nsometimes find that the constitutional text is ‘incurably incomplete’, as was\nsuggested by H.L.A. Hart. Hart visualized that the uncoding of such a text\npresents ‘problems of penumbra’. He argued that to resolve such disputes\n‘the purely cognitive interpretation by jurisprudence is...unable to fill\nalleged gaps. The filling up of a so-called gap in the law is a law-creating\nfunction and can only be performed by a law-applying organ; and the\nfunction of creating law is not performed by jurisprudence interpreting\nlaw’ 32\n\nIn filling up these gaps, the silence in the Constitution, as discussed\n(supra), with significant overtones, has a major role in conferring unstated\ndiscretion on the judges.\n\nDworkin accepted that such an interpretation is a Herculean task, but it\ncan be performed by integrating the form of natural law into positive law. In\norder to achieve this the judge, as suggested by Dworkin, has to draw upon\nmoral principles in order to put the law in the ‘best light’ and make it\ncomplete.?°\n\nThis mammoth task was performed by the Supreme Court in\nKesavananda Bharati, and its far-reaching jurisprudence of basic structure\ncan be traced to the aforesaid juristic strands of thought.\n\nThis concept of basic structure again came up for further consideration\nin the case of Indira Nehru Gandhi v. Raj Narain, widely known as the\nElection Case.** The factual background to the case is of some relevance to\nthe social and political history of our country. Indira Gandhi, the prime\nminister of India (the appellant), appealed before the Supreme Court\nimpugning a judgment dated 12 June 1975 of the High Court of Allahabad,\nwhich held the appellant guilty of electoral malpractices. The judgment was\nimmediately appealed to the Supreme Court and Justice Krishna Iyer, sitting\nduring vacation, gave a temporary stay of the High Court judgment on the\ncondition that the appellant would be refrained from casting her vote or\nparticipating in parliamentary debates and would draw her remuneration as\na Member of Parliament (MP) till the appeal is finally heard. On 26 June\n1975, the president declared a General Emergency in the whole of India.\n\nBefore the appeal could be heard, Parliament enacted the Election Laws\nAmendment Act with effect from 6 August 1975. Then, on 7 August 1975,\nthere was a bill to amend Article 71 and to introduce the Constitution (39th\nAmendment) Act, 1975, (henceforth 39th Constitution Amendment Act) by\ninserting Article 329A, making special provisions for election to Parliament\nin the case of prime minister and speaker. That bill was passed by\nParliament on 7 August 1975, and on 8 August 1975 it was passed by the\nCouncil of States. Then, by 9 August 1975, several state legislatures ratified\nthe bill. It was gazetted on 10 August 1975 as the 39th Constitution\nAmendment Act. The hearing of the appeal was fixed on 11 August 1975.\nAll this happened within a span of five days.\n\nNever before in the history of any democracy in the world was a\nconstitutional amendment expedited in such a manner to help the cause of\none individual litigant. To say the least, this was a mockery of constitutional\nfunctioning.\n\n\nFor the first time a constitutional amendment was made not in respect of\nrights of property or for advancing social welfare but with reference to\nelectoral law purporting to decide an election dispute between two\ncontesting parties. The amendment was virtually directed towards the\ndisposal of the pending appeal by holding that the election of the appellant\nis declared valid in terms of Article 329A(4).\n\nIt was for the first time that Parliament introduced, through\nconstitutional amendment, the concept that it can exercise judicial power.\n\nWhen the appeal came up for hearing, the Supreme Court unanimously\nset aside the judgment of the Allahabad High Court. However, on the\nvalidity of Article 329A of the Constitution, the Supreme Court invalidated\nthe same by holding that it violated the basic structure of the Constitution\neven though the judges, while returning the said finding, differed on their\nreasoning. All the five judges in the Election Case unanimously held that\nthe court was bound by the majority opinion in the Kesavananda Bharati\njudgment on basic structure, even though four of them (Chief Justice A.N.\nRay, Justice Beg, Justice Mathew and Justice Chandrachud) had not shared\nthe majority opinion on basic structure in Kesavananda Bharati.\n\nChief Justice A.N. Ray, while upholding the election of the appellant,\nheld that clause (4) of Article 329A suffered from various infirmities and is\nopposed to the rule of law. The learned Chief Justice also held that clause\n(4) was in the nature of an exercise of judicial power.*°\n\nJustice Khanna, who was a party to the majority opinion in\nKesavananda Bharati and held that no constitutional amendment can\nmutilate or emasculate the basic structure of the Constitution. The learned\njudge reiterated that the opinion of the majority in Kesavananda Bharati is\nthat democratic set-up was a part of the basic structure of the\nConstitution.** Following the same ratio, Justice Khanna struck down as\nunconstitutional all the clauses of sub-article (4) of Article 329A,\nintroduced by the 39th Constitution Amendment Act. In his own words,\nJustice Khanna held:\n\nAs a result of the above, I strike down clause (4) of Article 329A on\nthe ground that it violates the principle of free and fair election\nwhich is an essential postulate of democracy and which in its turn is\na part of the basic structure of the Constitution in as much as (1) it\nabolishes the forum without providing for another forum for going\n\ninto the dispute relating to the validity of the election of the\nappellant and further prescribes that the said dispute shall not be\ngoverned by any election law and that the validity of the said\nelection shall be absolute and not consequently to be liable to be\nassailed, and (2) it extinguishes both the right and the remedy to\nchallenge the validity of the aforesaid election.°”\n\nJustice Mathew also held that the majority opinion in Kesavananda Bharati\nwas that Parliament’s power under Article 368 is not absolute. His Lordship\nalso said that the consensus among judges in Kesavananda Bharati was that\ndemocracy is a basic structure of the Constitution.*®\n\nFollowing the aforesaid ratio, Justice Mathew held that clause (4) of\nArticle 329A, introduced by the 39th Constitution Amendment Act, was\nperforming a function which had traditionally been in the province of the\ncourt®? and the declaration of validity of appellant’s election by clause (4)\nof the Amending Act was a fiat of a sui generis character of the amending\nbody.*°\n\nNoting that at the time when the constitutional amendment was passed\nthe appellant’s appeal was pending before the Supreme Court, Justice\nMathew opined that the amendment by clause (4) was legislation ‘ad\nhominem’ (for the person), and was a direct interference with the decision\nof these appeals by the Supreme Court on their merits by a legislative\njudgment.*!\n\nJustice Mathew clearly held that the amending power under clause (4)\nwas exercised in violation of the principles of natural justice and the\namending power, under that clause, by evolving new norms for adjudging\nthe validity of a particular election, was exercising a ‘despotic power’ and\nthat would damage the ‘democratic structure of the Constitution’ .42\n\nJustice Beg (as His Lordship then was), in an extremely elaborate\njudgment, held that the claim of the counsel supporting the impugned\nclause (4) of Article 329A, that the constituent power was an\nundifferentiated amalgam of judicial, legislative and executive power\nenabling the constituent body to bring about any amendment in the\nConstitution and was not tenable. His Lordship held that this could not be\nignored in view of the majority judgment in Kesavananda Bharati, which\ncould not be overruled. After discussing various treaties and the decisions\nof various courts, the learned judge held that clause (4) of Article 329A\n\n\ndoes not operate to oust the jurisdiction of the Supreme Court to decide the\nappeal on merits by applying the Representation of People’s Act. His\nLordship also held that perhaps the ‘Doctrine of Reading down’ could be\napplied to clause (4) to hold that the jurisdiction of this court to hear the\nelection appeal on merits had not been ousted, but His Lordship noted that\nno such argument was made by the counsel arguing in support of the said\nclause.“?\n\nHowever, His Lordship did not uphold the validity of clause (4) of\nArticle 329A, even though His Lordship expressed the opinion in very\nguarded language.*#\n\nJustice Chandrachud (as His Lordship then was) also struck down\nclauses (4) and (5) of Article 329A, but His Lordship did so for different\nreasons. His Lordship held that democracy is an essential feature of the\nConstitution, but just as one swallow does not make a summer, similarly the\nimpugned amendment does not destroy the democratic structure embedded\nunder the Constitution.*°\n\nHis Lordship, however, held, relying on the ratio of Anwar Ali Sarkar“®,\nthat the classification of prime minister or the speaker for excluding any\nchallenge to their election under the impugned amendment did not satisfy\nthe Doctrine of Reasonable Classification and amounted to favoured\ntreatment, and that may outrage the sense of justice of common men which\nsustains a democracy. Therefore, clauses (4) and (5) of Article 329A were\narbitrary and destructive of the rule of law. His Lordship also held that the\namending power could not be an amalgam of all powers—legislative,\nexecutive and judicial—and this was opposed to the concept of our\nConstitution, which postulates a well-planned legal order.*”\n\nThe importance of this election case is that it puts the validity of the\nmajority ratio of Kesavananda Bharati beyond doubt and also sheds new\nlight on the concept of constituent power by subordinating it to the primacy\nof the constitutional structure.\n\nThe decision in Minerva Mills is another milestone, which prevented\nParliament from overriding the basic structure doctrine in Kesavananda\nBharati by enacting the Constitution (42nd Amendment) Act, 1976,\n(henceforth 42nd Constitution Amendment Act) which came into effect\nfrom 3 January 1977 virtually for dislodging the said doctrine.“®\n\nThe challenge to the nationalization of Minerva Mills, a textile\nundertaking, could not be made in view of the 42nd Constitution\n\nAmendment Act, which barred a challenge to the law of nationalization, as\nthe impugned Nationalization Act was included vide entry 105 to the 9th\nSchedule to the Constitution,\n\nMinerva Mills, by filing an Article 32 writ petition, challenged the\nconstitutional validity of sections 4 and 55 of the 42nd Constitution\nAmendment Act, inter alia, on the touchstone of the basic structure theory.\n\nFor a proper appreciation of the questions, sections 4 and 55 of the 42nd\nConstitution Amendment Act are set out below:\n\nSection 4. Amendment of Article 31C: In Article 31C of the Constitution,\nfor the words, brackets, letters and figures ‘the principles specified in clause\n(b) or clause (c) of Article 39, the words and figures “all or any of the\nprinciples laid down in Part IV”’ shall be sustained.\n\nSection 55. Amendment to Article 368: In Article 368 of the Constitution\nafter clause (3) the following clauses shall be inserted namely:\n\n(4) No amendment of this Constitution (including provisions of part\nIII) made or purporting to have been made under this article whether\nbefore or after the commencement of Section 55 of the Constitution\n(42nd Amendment Act), 1976, shall be called in question in any\ncourt on any ground.\n\n(5) For removal of doubts, it is hereby declared that there shall be\nno limitation whatsoever on the constituent power of the Parliament\nto amend by way of addition, variation or repeal the provisions of\nthis Constitution under this article.\n\nIn Minerva Mills the majority judgment was rendered by Chief Justice\nChandrachud on behalf of himself and Justices Gupta and Kailasam on 30\nJuly 1980. Both sections 4 and 55 of the 42nd Constitution Amendment Act\nwere held unconstitutional. Justice Bhagwati (as his Lordship then was), in\na separate judgment, concurred with the majority about the\nunconstitutionality of Section 55 but gave his dissent by upholding Section\n4 of the 42nd Constitution Amendment Act.\n\nEven though (then) Justice Chandrachud was in the minority in\nKesavananda Bharati, in Minerva Mills the learned chief justice assured\nthat the power under Article 368 of the Constitution could not be exercised\n\nby Parliament to damage its basic structure and he summed up the\nKesavananda Bharati ratio in Minerva Mills.4°\n\nIn delivering the majority judgment, the chief justice first took up for\nscrutiny Section 55 of the 42nd Constitution Amendment Act by which\nclauses (4) and (5), set out above, were added to Article 368.\n\nReiterating the doctrine of the basic structure in Kesavananda Bharati,\nthe chief justice held that Parliament could not, under Article 368, expand\nits amending power to destroy the basic essential features of the\nConstitution. The donee of a limited power cannot by exercise of that power\nconvert the limited power into an unlimited one.°°\n\nThe Supreme Court went on to state that the addition of clauses (4) and\n(5) of Article 368 were ultra vires the amending power of Parliament. The\nrationale being that they removed the limitations on the power of\namendment to render the Kesavananda Bharati verdict ineffective.\nFurthermore, the court stated that the language of clause (4) would render\nthe fundamental rights a ‘mere adornment’, as no recourse could be taken to\nany court, which is against the principles of the Constitution.>+\n\nThe court, through the chief justice, reiterated the position of\nKesavananda Bharati by stating that clause (4) was invalid, to the extent\nthat it took away rights conferred under articles 14 and 19. The Court\npointed out that the amendment to Article 31C in effect abrogated articles\n14 and 19, which virtually tears away the heart of basic fundamental\nfreedoms enshrined in the two provisions.\n\nJustice P.N. Bhagwati disagreed with the majority on the amendment to\nArticle 31C. His Lordship stated that where protection to a law has to be\ngiven under Article 31C, the court would have to establish a direct\nconnection between the intended effect and the protection sought. His\nLordship placed the onus on the court to determine which portions of the\nlegislation were not pushing forth the intended directive principle. The\ntrouble with such a stance is that it gives the court a much more overt\npolicymaking role, which is contrary to the law established earlier.\n\nMinerva Mills developed the premise of basic structure further by\nanalysing the ‘core conscience’ and the ‘scheme’ of our National Charter\nand this was done by Chief Justice Chandrachud even though His Lordship\nhad previously dissented from the basic structure doctrine in Kesavananda\nBharati. By invalidating Section 55 of the 42nd Constitution Amendment\nAct, the majority opinion in Minerva Mills affirmed that there can be no\n\n\nouster of judicial review even in cases of constitutional amendment. Thus,\ndue process strategies were firmly entrenched in our constitutional\njurisprudence.\n\nIn doing so, the court travelled beyond the territories reached in\nKesavananda Bharati in the arena of judicial access. While striking down\nSection 4 of the 42nd Constitution Amendment Act, the Supreme Court\nmade it clear that fundamental rights have primacy over directive\nprinciples. It was thus asserted that courts could be approached for\nenforcing fundamental rights which cannot be subordinated to directive\nprinciples. In this way, the Supreme Court enriched the core substantive\nvalues of our Constitution, as against the procedural ones.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "DISSENT IN THE LAST COURT, CHANGING\nCONSTITUTIONAL VALUES",
            "chapter_path": "./screenshots-images-2/chapter_3",
            "sections": [
                {
                    "section_name": "Upholding Individual Liberty and Opposing the State’s\nEncroachment of the Same During the Emergency",
                    "section_path": "./screenshots-images-2/chapter_3/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_3/section_1/2ec47a6a-5c59-45c8-aaf0-bf36d049a3b4.png",
                        "./screenshots-images-2/chapter_3/section_1/d5a3fc19-eb24-4582-945a-0ed34bb987eb.png",
                        "./screenshots-images-2/chapter_3/section_1/1485c6c8-e267-407e-bde0-2ad236df3ecd.png",
                        "./screenshots-images-2/chapter_3/section_1/afb915f8-ee3f-47e1-aaa2-df1cfe6b2254.png",
                        "./screenshots-images-2/chapter_3/section_1/f0c74c9c-3589-4c57-b9a2-46df0593c547.png",
                        "./screenshots-images-2/chapter_3/section_1/f139a7f4-e745-4823-a596-de7f199faa23.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "ADM JABALPUR V. SHIVKANT SHUKLA ETC. ETc!\n\nThe importance of this judgment lies in its monumental dissent by Justice\nHans Raj Khanna, in which the learned judge, during the dark days of that\nphoney Emergency, kept the flickering candle of individual liberty burning.\nThis minority judgment also paved the way for the future development of\nthe ‘Due Process’ doctrine in Maneka Gandhi v. Union of India and\nOthers”, which rests on the concept that anything arbitrary is an antithesis\nof the guarantee of equality in Article 14. The judgment also resulted in a\nfar-reaching constitutional amendment, vide the Constitution (44th\nAmendment) Act, 1978, (henceforth the 44th Constitution Amendment\nAct), by which it was made clear that proceedings for enforcement of rights\nunder articles 20 and 21 of the Constitution, even during an Emergency, can\nnever be suspended by a Presidential Declaration under Article 359 of the\nConstitution.\n\nThe decision arose in the background of the following facts:\n\nVarious persons who were detained under Section 3 (1) of the\nMaintenance of Internal Security Act (MISA) petitioned before different\nHigh Courts for habeas corpus, praying for their release. At the hearing of\nthose petitions, the state governments raised the preliminary objection to\n\ntheir maintainability on the ground that the plea for release of the detenues,\nbeing substantially based under Article 21, could not be entertained by the\nHigh Courts, as the rights of the petitioners to move any court for\nenforcement of freedom under Article 21 had been suspended by the\nPresidential Order dated 27 June 1975, issued under Article 359, as a sequel\nto the Emergency declared in the country. Therefore, the state governments\nin various High Courts contended that the petitions should be dismissed at\nthe threshold.\n\nThe High Courts of Allahabad, Bombay, Delhi, Karnataka, Madhya\nPradesh, Punjab and Rajasthan held that it was open to the detenues to\nchallenge the detention if they could show the same was ultra vires MISA\nor that the power of detention had been exercised in breach of conditions\nprescribed in the act. However, the High Courts of Andhra Pradesh, Kerala\nand Madras upheld the preliminary objection.\n\nVarious state governments and the Union of India challenged before\nSupreme Court the orders of the High Courts which overruled the\npreliminary objection of the government. During the pendency of the\nproceeding before the Supreme Court, the president issued a further order\non January 8 1976 under Article 359(1) of the Constitution, declaring the\nright to move any court for enforcement of rights under Article 19 and that\nany proceeding pending in any court for the enforcement of those rights\nwould remain suspended during the Proclamation of Emergency dated 3\nDecember 1971 and 27 June 1975.\n\nThe case was heard by a Constitution Bench of the Supreme Court\nconsisting of Chief Justice A.N. Ray and Justices H.R. Khanna, M.\nHameedullah Beg, Y.V. Chandrachud and P.N. Bhagwati. Five judgments\nwere delivered by all the five judges separately, but the majority opinion, of\nChief Justice A.N. Ray, Justice M.H. Beg, Justice Y.V. Chandrachud and\nJustice P.N. Bhagwati, upheld the preliminary objection of the government,\nand held that in view of the Presidential Order dated 27 June 1975, no\nperson had the right to move a writ petition under Article 226 before a High\nCourt for habeas corpus or any other writ, to challenge the legality of the\ndetention order on the ground that the order is not under or in accordance\nwith the act, or is illegal, or is vitiated by malafides, factual and legal, or is\nbased on extraneous consideration.\n\nJustice Khanna, in his dissenting opinion held, inter alia, that Article\n226, empowering the High Court to issue writ of habeas corpus, was an\n\nintegral part of the Constitution, and no power had been conferred by the\nConstitution on any authority for suspending the power of the High Court to\nissue a writ in the nature of habeas corpus during Emergency. His Lordship\nfurther held that a Presidential Order under Article 359(1) could suspend,\nduring Emergency, the right to move any court for the enforcement of\nfundamental rights mentioned in the order. But rights under statute, being\nnot fundamental rights, could be enforced during the Emergency, despite\nthe Presidential Order. His Lordship also held that Article 21 could not be\nconsidered to be the sole repository of the right to life and personal liberty.\nEven without Article 21, the state does not have the power to deprive a\nperson of his life and liberty without the authority of law, as the same is a\nbasic postulate and assumption of the rule of law in every civilized society.\nHis Lordship further explained that even before the Constitution came, no\none could be deprived of his life or liberty without the authority of law.\nSuch a legal position continued in force after the commencement of the\nConstitution in view of Article 372. We find these thoughts in an embryonic\nform in the opinion of Justice Khanna in Kesavananda Bharti? as well.\nJustice Khanna held in Kesavananda, ‘It would, in my opinion, not be a\ncorrect approach to say that amendments of the Constitution relating to\nabridgment or taking away of fundamental rights would not have the effect\nof denuding human beings of basic dignity and would result in the\nextinguishment of essential values of life.’ Therefore, His Lordship upheld\nthe views taken by the nine high courts that the Presidential Order dated 27\nJune 1975 could not affect the maintainability of a habeas corpus petition.\nHis Lordship, however, did not pronounce on the validity of Section 16A\n(9) of MISA since the habeas corpus petitions were pending a decision on\nmerits before the High Courts.\n\nAbout the majority judgment, Chief Justice M.N. Venkatachaliah, in his\nH.R. Khanna Memorial Lecture delivered in New Delhi on 25 February\n2009, opined that it should be ‘confined to the dustbin of history’. THe\nlearned chief justice equated the dissent of Justice Khanna with that of Lord\nAtkins in Liversidge v. Sir John Anderson.‘ Noted jurist Fali S. Nariman\ndescribed the majority judgment of the Supreme Court as one of its ‘most\ndeplorable decisions’®, and further said, ‘...it was judicial pusillanimity at\nits worst’.© The Supreme Court also noted that the dissenting judgment of\nJustice Khanna became the law of the land’ in view of the 44th Constitution\nAmendment Act by which Article 359 of the Constitution was amended and\n\n\nclauses (1) and (1A) of Article 359 made it very clear that the right to move\nany court for the enforcement of the rights under articles 20 and 21 could\nnot be suspended. Previously, the bar under Article 359 operated against\nmoving the courts for enforcement of any of the rights under Part III of the\nConstitution.\n\nAnother matter of some importance is that, apart from Chief Justice\nA.N. Ray, all the other three judges who shared the majority opinion with\nthe chief justice became chief justices of India later. Even though chief\njusticeship was due to Justice Khanna, on the retirement of Chief Justice\nRay, Justice Khanna knew the consequence of his dissent and he said to his\nyounger sister, about his dissenting judgment, ‘I have prepared a judgment\nwhich is going to cost me the Chief Justiceship of India’.® In fact, it did.\nES. Nariman noted:\n\nIt was directly as a result of the dissent in this case that Justice\nKhanna was subsequently ‘superseded’ in January 1977 when it was\nhis turn as the senior most judge, to be appointed Chief Justice of\nIndia. Contrary to long standing practice, he was not appointed\nChief Justice of India. Khanna then promptly resigned.?\n\nH.M. Seervai, in The Emergency, Future Safeguards and the Habeas\nCorpus: A Criticsm, wrote that the censor banned even publication of\nJustice Khanna’s dissent in the newspaper.”\n\nJustice Khanna’s memorable dissent upheld the concept of rule of law\nbeing opposed to arbitrariness, and the learned judge was very poignant in\nhis observations:\n\nEven in the absence of Article 21 of the Constitution, the State has\ngot no power to deprive a person of his life or liberty without the\nauthority of law. This is the essential postulate and basic assumption\nof the rule of law and not of men in all civilized nations. Without\nsuch sanctity of life and liberty, the distinction between a lawless\nsociety and one governed by laws would cease to have any\nmeaning. The principle that no one shall be deprived of his life or\nliberty without the authority of law is rooted in the consideration\nthat life and liberty are priceless possessions which cannot be made\nthe plaything of individual whim and caprice and that any act which\n\nhas the effect of tampering with life and liberty must receive\nsustenance from and sanction of the laws of the land.'\"\n\nFrom the aforesaid proposition, Justice Khanna defined the contours of the\ntule of law and held that the rule of law was not a nebulous concept.\nAccording to the learned judge, the important facets of the rule of law are\n‘absence of arbitrariness and the need of the authority of law for official\nacts affecting prejudicially the rights of individuals’. Along with that, the\nlearned judge held that the power of the court to grant relief against\narbitrariness or in the absence of authority of law, in a matter relating to the\nliberty of the subject, is a normal feature of the rule of law and pointed out\nthat government under law means the supremacy of law over the\ngovernment. The learned judge also said that ‘the powers of the executive\nshould not only be derived from law, but should also be limited by law’.!2\n\nTherefore, in formulating the concept of rule of law, being antithetical\nto arbitrariness, Justice Khanna’s dissenting opinion heralded the\nsubsequent expansion of the doctrine of equality by the Supreme Court in\nManeka Gandhi that arbitrariness is the reverse of rule of law.\n\nIn addition, Justice Khanna’s dissenting opinion, by recognizing the\nlocus of the detainee to approach the courts for redress, expanded the\nconcept of access to justice, and thus strengthened the concept of\nprocedural due process. But the majority opinion, by withholding access to\ncourt to an aggrieved person who was illegally denied of his liberty, took\nthe most cramped view of liberty. This is an instance of a very constricted\nconstitutional adjudication during Emergency. It has already been noted that\nthe dissenting opinion of Justice Khanna has become the law of the land in\nview of the 44th Constitution Amendment Act. If we look at the Statement\nof Objects and Reasons of the 44th Constitution Amendment Acct, it is clear\nthat it was inspired by the historic dissent of Justice Khanna. Relevant\nexcerpts from the Statement of Objects and Reasons are excerpted:\n\nAs a further check against the misuse of the Emergency provisions\nand to put the right to life and liberty on a secure footing, it would\nbe provided that the power to suspend the right to move the court\nfor the enforcement of a fundamental right cannot be exercised in\nrespect of the fundamental right to life and liberty.!%\n\nTowards the concluding portion of the dissenting opinion, the learned judge\nmade it clear that the question of utmost importance and gravity, and a\nquestion which is not only important for interpreting the Constitution but\nwhich has an impact upon the basic values affecting life, liberty and the rule\nof law, was raised in the case, which, according to the learned judge, was\n‘whether the law speaking through the authority of the courts would be\nabsolutely silenced and rendered mute’!* because of the Emergency. In the\npenultimate paragraph of his opinion, the learned judge referred to the\nobservation of Chief Justice Hughes, that dissent in a court of last resort is\nan appeal to the brooding spirit of law so that in future days a later decision\nmay correct the error which has crept into the majority opinion. This has\nreally happened in the case of the dissenting opinion of Justice Khanna. By\na future amendment of the Constitution, his dissenting opinion has now\nbecome the law of the land, and the majority opinion has virtually lost its\nrelevance in the context of the 44th Constitution Amendment Act.\n\nAbout the role of the higher courts in dealing with preventive detention\nduring the Emergency, Seervai observed that the High Courts rose to the\noccasion, but ‘the Supreme Court sank’.!° However, one dissenting opinion\nin the Supreme Court provoked the 44th Constitution Amendment Act to\nensure access to justice of any person for enforcing his rights to life and\nliberty even during Emergency. Thus, the eternal values of civil liberty and\nfreedom have been recognized in our Constitution as non-derogable\nstandards and are to be regarded as principles of ‘jus cogens’ in\ninternational law.\n\nF.S. Nariman rightly found some similarity between the decision of the\nADM Jabalpur and that of Dred Scott, rendered more than a century ago in\n1857 by a 6:2 majority of the American Supreme Court. The majority in\nDred Scott held that a black person could never be a citizen of the US. A\nstrong criticism of this view by Abraham Lincoln got national attention and\nultimately helped him win the presidential election, which changed history.\nIn both the cases, powerful dissenting opinions brought about far-reaching\nchanges in these two democracies.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "FROM GOPALAN TO GANDHI",
            "chapter_path": "./screenshots-images-2/chapter_4",
            "sections": [
                {
                    "section_name": "The Evolving Mosaic of Constitutional Interpretation",
                    "section_path": "./screenshots-images-2/chapter_4/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_4/section_1/262b6212-8dee-45c8-a1ba-47dd37dc1170.png",
                        "./screenshots-images-2/chapter_4/section_1/4bf8b50c-93b7-4114-ab50-ad8d74c4be4b.png",
                        "./screenshots-images-2/chapter_4/section_1/fe35de28-dd5f-4f18-92f2-a7083e6c4031.png",
                        "./screenshots-images-2/chapter_4/section_1/b3322f64-7d36-4e42-bfd2-3218b7b10954.png",
                        "./screenshots-images-2/chapter_4/section_1/910b2c02-e868-401b-abea-96d9dbab1c44.png",
                        "./screenshots-images-2/chapter_4/section_1/0b0e973f-2909-49e0-adc6-9fdcb5ac11e7.png",
                        "./screenshots-images-2/chapter_4/section_1/9a335215-bbf1-4036-b953-85cdb0f4c9a5.png",
                        "./screenshots-images-2/chapter_4/section_1/cd8b045b-5484-498e-a5a4-d2d3daa4a7f1.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "THE JOURNEY OF the Supreme Court, from its judgment in A.K. Gopalan v.\nState of Madras'—heard by the Constitution Bench of the Supreme Court\nin 1950—to the one heard by its Constitution Bench in the case of Maneka\nGandhi v. Union of India and Ors*—in which the judgment was rendered in\nJanuary 1978—is a very engrossing one, covering a span of about twenty-\neight years. It shows the swing of the judicial pendulum from the tradition\nof black-letter law in Gopalan to the resurgence and firm assertion of the\nconcept of ‘due process’ in Maneka Gandhi. This dynamic, generic and\nmore expansive interpretation of fundamental rights by the Supreme Court\nin Maneka Gandhi in the post-Emergency period not only affected the lives\nof Indians, but also considerably influenced jurisprudential development in\ndifferent countries.\n\nThe decisions in Maneka Gandhi and the allied group of cases are not\nconcerned with constitutional amendments, but they would disclose a\nparadigm shift in the Supreme Court’s interpretation of the basic guarantees\ngiven in the Constitution in its chapter on fundamental rights. Fundamental\nrights have already been discussed in an earlier chapter as higher laws, to\nthe extent that all laws made by the state, after the commencement of the\nConstitution, would have to conform to its mandate, failing which the laws\nwould be declared void (Article 13[2] of the Constitution). Even laws prior\nto the Constitution can continue only if they are consistent with\nfundamental rights and to the extent of their inconsistencies, they are to be\ndeclared void (Article 13[1]).\n\nTherefore, the changing pattern of interpretation of fundamental rights\nis integral to our jurisprudence, affecting both the enactment of statutory\nlaw and the practice of administrative law.\n\nIn Gopalan, the validity of the Preventive Detention Act, 1950, was\nchallenged, mainly on two grounds:\n\n(1) Whether the act violated the guarantee under Article 21\n(2) Whether the act fell foul of the freedom guaranteed under Article 19\n\nOne of the questions raised by Gopalan was that the procedure provided by\nthe act does not stand the test of ‘procedure established by law’ under\nArticle 21, and it was argued that the procedure under Article 21 must\ncomply with the principles of natural justice. Chief Justice Kania dismissed\nthe said argument, saying:\n\nThe Courts are not at liberty to declare an Act void because in their\nopinion it is opposed to a spirit supposed to pervade the constitution\nbut not expressed in words. Where the fundamental law has not\nlimited, either in terms or by necessary implication, the general\npowers conferred upon the Legislature we cannot declare a\nlimitation under the notion of having discovered something in the\nspirit of the constitution which is not even mentioned in the\n\ninstrument.?\n\nThe court, by laying down the aforesaid proposition, refused to examine\nwhether the procedure was fair, as the word ‘due’ is absent in Article 21,\nand the learned chief justice held that ‘the justiciable aspect of the law, i.e.\nto consider whether it is reasonable or not by the Court, does not form part\nof the Indian Constitution’. Therefore, the learned Chief Justice opined that\n‘the Constitution gave the Legislature the final word to determine the law’.°\n\nOn the second question, namely, on the interrelationship between\narticles 19 and 21, all the judges, excepting Justice Fazl Ali, held that\narticles 19 and 21 had to be read as mutually exclusive. It was held by the\nMajority that articles 19 and 21 are not complementary to each other, as\nthere is no mention of right to life in Article 19.° However, the dissenting\nview, expressed by Justice Faz] Ali, demonstrates judicial thinking which is\nmuch ahead of his time. The learned judge, in his dissent, held:\n\n\nTo my mind, the scheme of the chapter dealing with the\nfundamental rights does not contemplate what is attributed to it,\nnamely, that each article is a code by itself and is independent of the\nothers. In my opinion, it cannot be said that Articles 19, 20, 21 and\n22 do not to some extent overlap each other.”\n\nAs in other cases, discussed in the previous chapter, in this case also the\ndissenting opinion was subsequently accepted by the Supreme Court. This\nwas done in Rustom Cavasjee Cooper v. Union of India (hereinafter\nCooper’s case)® which is referred to later.\n\nOn 11 January 1952, which is within a year and a half of the decision\nrendered in Gopalan, the Constitution Bench of the Supreme Court, this\ntime consisting of seven judges, in State of West Bengal v. Anwar Ali\nSarkar,? examined the vires of the West Bengal Special Courts Act, 1950,\nand the Constitution Bench held that the provision of Section 5 (1) is ultra\nvires the Constitution, insofar as it allows the state government to direct any\ncase to be tried by a special court.\n\nWhile agreeing with the majority opinion, and defining what is meant\nby ‘classification’, Justice Vivian Bose virtually leaned in favour of an\ninterpretation which amounted to introducing the ‘due process’ principle.\nWhile determining whether a classification was valid or not, the learned\njudge held:\n\nHowever much the real ground of decision may be hidden behind a\nscreen of words like ‘reasonable’, ‘substantial’, ‘rational’ and\n‘arbitrary’ the fact would remain that judges are substituting their\nown judgment of what is right and proper and reasonable and just\nfor that of the legislature [sic]; and up to a point that, I think, is\ninevitable when a judge is called to crystallise a vague generality\nlike Article 14 into a concrete concept.!°\n\nThis is in stark contrast to the interpretation of Chief Justice Kania in\nGopalan about a year and a half ago, and it may be mentioned that three\nlearned judges—M.C. Mahajan, B.K. Mukherjee and S.R. Das—who\nshared the views of Chief Justice Kania in Gopalan, were also members of\nthe bench in Anwar Ali. Justice Bose gave the aforesaid interpretation as\nHis Lordship thought, if I may say so, rightly, that the words in the\n\nConstitution are not dull, lifeless and static words ‘as in some mummified\nmanuscript’. According to Justice Bose, they are ‘living flames’ and\n‘tongues of dynamic fire potent enough to mould the future as well as guide\nthe present’. The learned judge rightly understood the basic tenets of\nconstitutional interpretation by holding: ‘The Constitution must, in my\njudgment, be left elastic enough to meet from time to time the altering\nconditions of a changing world with its shifting emphasis and differing\nneeds’!\n\nIt is thus clear that the germs of future jurisprudential interpretations of\nfundamental rights were there in the judgment of Justice Bose as early as in\nJanuary 1952. However, the Gopalan doctrine was not overruled in Anwar\nAli. The majority ratio in Gopalan held the field till it was examined and\noverruled by the majority judgment of the Supreme Court in the eleven-\njudge decision in Cooper’s case.!?\n\nCooper held shares in several banks and also had bank accounts. He\nwas also a director of the Central Bank of India. Before the Supreme Court\nhe challenged the Banking Companies (Acquisition and Transfer of\nUndertakings) Ordinance, 1969, and the Banking Companies (Acquisition\nand Transfer of Undertakings) Act, 1969, which replaced the ordinance.\nCooper also challenged the promulgation of another ordinance, on the same\nday, that is, 19 July 1969, whereby the undertaking of fourteen named\ncommercial banks were transferred and vested, under the ordinance, in the\ngovernment. Apart from the other questions, the challenge on which the\nconstitutional interpretation of fundamental rights by the Supreme Court\nchanged from where it rested in Gopalan was in examining the petitioner’s\nchallenge that the impugned enactments violated his fundamental rights\nunder Article 14, 19(1)(f) and (g) and 31(2) of the Constitution. A challenge\nwas also made to the invasion of his right under Article 301.\n\nIn upholding the said challenge, Justice Shah, delivering the majority\njudgment, held that Articles 19(1)(f) and 31(2) were not mutually exclusive.\nBefore reaching the said conclusion, the learned judge dealt in detail with\nGopalan and various other cases, namely the case of Ram Singh and Others\nv. State of Delhi,'? and the ratio in Gopalan was expressly departed from. In\nparagraph 49, the learned judge summed up the ratio in Cooper’s case,\nsaying:\n\nIn determining the impact of State action upon constitutional\nguarantees which are fundamental, it follows that the extent of\nprotection against impairment of a fundament right is determined\nnot by the object of the Legislature nor by the form of the action,\nbut by its direct operation upon the individual’s rights.14\n\nThus, the object test in Gopalan was replaced in Cooper’s case by the\n‘effects test’. In fact, referring to various articles in Part III of the\nConstitution, the learned judge said that they do not follow ‘a uniform\npattern’. But according to the learned judge there was one common thread\nrunning through them, namely the protection of the rights of the individuals,\nor groups of individuals, against infringement by state action. That is why\nthe learned judge held that ‘Part III of the Constitution weaves a pattern of\nguarantees on the texture of basic human rights. The guarantees delimit the\nprotection of those rights in their allotted fields: they do not attempt to\nenunciate distinct rights’ .1°\n\nSubsequently, two Constitution Bench decisions of the Supreme Court\ndelivered within a gap of about four and a half years expanded the ambit\nand reach of the court’s interpretation of fundamental rights, and were in\nfavour of protecting those rights which were facing invasion by the state\nauthority. The first was delivered before the Emergency in the case of E.P.\nRoyappa v. State of Tamil Nadu'® while the second was delivered after the\nEmergency in the case of Maneka Gandhi.'”\n\nE.P. Royappa, who held the post of chief secretary in the Government of\nTamil Nadu, was transferred to a newly created post of a temporary nature,\nand challenged the said transfer in an Article 32 petition on the ground that\nhe had been denigrated to a relatively unimportant post as he had incurred\nthe displeasure of the chief minister of the state. The Supreme Court, while\ndismissing the petition, gave a new interpretation to Article 14, which was\nfurther developed in the subsequent decision in Maneka Gandhi. Justice\nBhagwati, delivering a concurring opinion with Chief Justice Ray, relied on\nthe concept of reasonableness, hitherto unknown in the arena of Article 14.\n\nJustice Bhagwati raised a question on the content and reach of Article\n14 and then answered it in very glowing terms:\n\nIt is a founding faith, to use the words of Bose, J., a ‘way of life’,\nand it must not be subjected to a narrow pedantic or lexicographic\n\napproach. We cannot countenance any attempt to truncate its all-\nembracing scope and meaning, for to do so would be to violate its\nactivist magnitude. Equality is a dynamic concept with many\naspects and dimensions and it cannot be ‘cribbed, cabined and\nconfined’ within traditional and doctrinaire limits. From a\npositivistic point of view, equality is antithetic to arbitrariness. In\nfact, equality and arbitrariness are sworn enemies; one belongs to\nthe rule of law in a republic while the other, to the whim and caprice\nof an absolute monarch. Where an act is arbitrary, it is implicit in it\nthat it is unequal both according to political logic and constitutional\nlaw and is therefore violative of Article 14.18\n\nThe expression ‘a way of life’ was used by Justice Bose in his concurring\nopinion in the case of Bidi Supply Co. v. Union of India and Others'® while\ninterpreting Article 14. Justice Bose referred to certain other important\nideas and opined:\n\nArticle 14 sets out, to my mind, an attitude of mind, a way of life,\nrather than precise rule of law. It embodies a general awareness in\nthe consciousness of people at large of something that exists and\nwhich is very well and which cannot be pinned down to any precise\nanalysis of facts.\n\nJustice Bhagwati virtually enlarged the embryo of the said concept in\nextremely elegant prose, and in the process was inspired by the\nShakespearean turn of phrase in Macbeth.”! In doing so, Justice Bhagwati,\nin his opinion, broadened the sweep of Article 14 by taking it beyond the\ndoctrine of classification based on an intelligible differentia with the nexus\nbetween the basis of classification and the object of the law under\nconsideration as laid down by Chief Justice S.R. Das in Shri Ram Krishna\nDalmia v. Shri Justice S.R. Tendolkar and Ors.\n\nHowever, one thing of some interest is that in a matter of less\nimportance, like the transfer of a chief secretary, which is not a punishment\nin service law, Justice Bhagwati propounded the aforesaid doctrine of\nArticle 14 by holding that equality is antithetic to arbitrariness and they are\nsworn enemies. But when questions of a far greater import relating to\ndeprivation of personal liberty and a citizen’s access to a court of justice\n\ncame up before him later in ADM Jabalpur v. S.S. Shukla, Justice Bhagwati\ndid not take the aforesaid view, which was actually put forward by Justice\nKhanna in his lone dissenting voice (as noted in previous chapters).\nHowever, it has already been noted that several decades before, Justice\nVivian Bose, in his opinion in Anwar Ali, rejected the narrow doctrinaire\napproach to Article 14, as pointed out (supra). However, this doctrine of\nreasonableness and non-arbitrariness emerged with much greater force in\nManeka Gandhi v. Union of India and Ors.\n\n(1) Maneka Gandhi (presently union minister for women and child\ndevelopment) was noticed by the Regional Passport Authority to the\neffect that her passport had been impounded and she was asked to\nsurrender the same within seven days. Challenging the same in an\nArticle 32 petition, several contentions were raised by her before the\nSupreme Court, the chief among them being that the right to go\nabroad is a component of the Right to Life and Personal Liberty under\nArticle 21 of the Constitution.\n\n(2) She was denied the said right without a hearing and without any\nreason for the denial of the said right.\n\n(3) Section 10(3)(c) of the Passport Act, 1967, empowering the Passport\nAuthority to impound a passport, in the interest of the general public,\nwas vague and unreasonable.\n\nThe Supreme Court held that Section 10(3)(c) is not violative of Article 14,\nbut the order of impounding was in violation of the principles of natural\njustice. Since the attorney general assured the court of expeditious\nconsideration of any representation that may be made by Mrs Gandhi, the\ncourt felt that the vice could be removed and the order could not be assailed\non the ground that it violated principles of natural justice. In doing so, the\ncourt relied on the concept of post-decisional hearing, curing the defects in\nan earlier order, which had been passed without a hearing.\n\nIn the opinion of Chief Justice M. Hameedullah Beg, in Maneka\nGandhi, there was tacit approval of the dissenting opinion of Justice\nKhanna in ADM Jabalpur, even though Chief Justice Beg had not agreed\nwith Justice Khanna in ADM Jabalpur. But in Maneka Gandhi, Chief\nJustice Beg clearly stated: ‘I think that both the rights of personal security\nand of personal liberty recognized by what Blackstone termed “natural law”\n\nare embodied within Article 21 of the Constitution’.23 Thus, the learned\nchief justice also relied on the majority doctrine in the case of I.C.\nGolaknath v. State of Punjab‘, that fundamental rights are natural rights\nembodied in the Constitution itself.2° Chief Justice Beg, after quoting the\ndissenting view of Justice Fazl Ali in Gopalan, seems to have agreed with\nthe said dissenting view, saying:\n\nArticles dealing with different fundamental rights contained in Part\nIII of the Constitution do not represent entirely separate streams of\nrights which do not mingle at many points. They are all parts of an\nintegrated scheme in the Constitution. Their waters must mix to\nconstitute that grand flow of unimpeded and impartial Justice.?®\n\nExpanding his doctrine in Royappa, Justice Bhagwati in Maneka Gandhi\nheld that the attempt of the court should be to expand the reach and ambit of\nfundamental rights, rather than attenuate their meaning and content by a\nprocess of judicial construction.2” His Lordship also held that Article 14\npervades, like a brooding omnipresence, and the procedure contemplated by\nArticle 21 must answer the test of reasonableness and must be in\nconformity with Article 14. His Lordship further held that it should be\n‘right, just and fair and not arbitrary, fanciful or oppressive’ .?8\n\nThis refreshingly right-oriented approach of Justice Bhagwati was quite\ncontrary to his view in ADM Jabalpur. However, the matter which is of\ngreater importance is that for the first time in the constitutional history of\nIndia, a majority judgment of the Supreme Court acknowledged that the\nRight to Life and Personal Liberty must stand the test of fairness and\nreasonableness, even though the principle of ‘due process’ was expressly\ndeleted from our Constitution by the founding fathers. However, there is a\nsubstantial difference between the doctrine of reasonableness articulated in\nKhanna’s dissent in ADM Jabalpur and the one formulated by the majority\nopinion of Justice Bhagwati in Maneka Gandhi. In ADM Jabalpur, Justice\nKhanna rested his doctrine on the concept of natural law, but in Maneka\nGandhi, Justice Bhagwati rested his doctrine on the text of the Constitution\nitself—Article 14—by employing a protean and flexible interpretation of\nfundamental rights under our Constitution, and in doing so Justice Bhagwati\nendorsed the interpretation of fundamental rights in Cooper’s case.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "STRENGTHENING THE ROOTS OF\nDEMOCRACY IN INDIA AND ENSURING A\nFREE AND TRANSPARENT ELECTION\nPROCESS",
            "chapter_path": "./screenshots-images-2/chapter_5",
            "sections": [
                {
                    "section_name": "S.R. Bommai and Subsequent Decisions",
                    "section_path": "./screenshots-images-2/chapter_5/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_5/section_1/16b6b751-d1b0-454e-a181-d4d599ef1332.png",
                        "./screenshots-images-2/chapter_5/section_1/4f731233-d7d5-43c2-ae8e-185936833ad9.png",
                        "./screenshots-images-2/chapter_5/section_1/87785cc0-9440-4d8b-bb78-7f69b6fc939e.png",
                        "./screenshots-images-2/chapter_5/section_1/054f2ecd-01ac-486f-84bc-dab53bcddfa2.png",
                        "./screenshots-images-2/chapter_5/section_1/609f8908-2a39-4b79-b21d-6a27a6dbc42c.png",
                        "./screenshots-images-2/chapter_5/section_1/4c350c27-8c21-4ebb-ad99-519fe8f059af.png",
                        "./screenshots-images-2/chapter_5/section_1/d35c072b-86b4-48be-bcf0-0f283033530c.png",
                        "./screenshots-images-2/chapter_5/section_1/154d5b47-8763-4cf0-a521-1fae3211bb69.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "THE NEXT MAJOR decision which rejuvenated the roots of democracy in India\nwas rendered by a nine-judge Constitution Bench of the Supreme Court in\nthe case of S.R. Bommai and Others v. Union of India and Others.‘\n\nThe provision of Article 356 of the Constitution that came up for\ninterpretation in Bommai is in Part XVIII of the Constitution, which deals\nwith Emergency Provisions. Article 356 empowers the president, in the case\nof failure of the constitutional machinery in the state, to impose President’s\nRule by overthrowing the elected government of the state. This provision\nhad its counterpart in Section 93 of the Government of India Act, 1935.\nEven though the framers of our Constitution had had an unhappy\nexperience of the application of Article 93 in the colonial days, a similar\nprovision was retained in the form of Article 356 in the Constitution. This is\nbecause the founding fathers, with regard to the prevalent situation in India\nin or about 1947-48, thought that as the country was going through grave\nand difficult times the ‘danger of grave emergency in India is very real’.?\nHowever, the said provision was incorporated by the founding fathers with\nthe pious hope that the same ‘would remain a dead letter’, and would be\nused very sparingly.?\n\nContrary to their expectations independent India saw repetitive use, and\nat times flagrant misuse, of Article 356. Article 356 provisions were\ninvoked on more than a hundred occasions prior to the decision in Bommai.\nIn the background of the flagrant abuse of Article 356, which topples a\ndemocratically elected government, the Supreme Court’s decision in\nBommai provides certain salutary safeguards. It is heartening to note that\nthe decision in Bommai has proved to be a deterrent to the misuse of the\npowers of Article 356. This explains the importance of this decision.\n\nPrior to the decision in Bommai, the question of whether a presidential\nproclamation dissolving a state assembly could be challenged before the\nHigh Courts came up for consideration before different High Courts. Most\nof the High Courts, including those of Kerala, Calcutta, Punjab and\nHaryana, Andhra Pradesh, and Orissa, pronounced that a presidential\nproclamation is not justiciable before a court.\n\nThe question, in a slightly different form, came up for consideration\nbefore the Supreme Court in State of Rajasthan v. Union of India.* The bare\nfacts of the case are that in April 1977, the union home minister addressed a\nletter to the chief ministers of several states where the Congress party had\nsuffered reverses in the electoral poll, asking the respective governors of\nsuch states to dissolve the state assemblies and seek a fresh mandate. This\nwas followed by a broadcast by the union law minister that the governments\nin those states have lost the confidence of the electorate, and their\ncontinuance in power is undemocratic.\n\nSix out of those nine states petitioned the Supreme Court under Article\n32, urging that the home minister’s letter and the broadcast by the law\nminister posed a threat to the continuance of the state assemblies on\ngrounds which are dehors Article 356 of the Constitution. In that context,\nthe Supreme Court rejected the contention that a judicial review of the\npresidential proclamation was barred. The leading judgments of Justice\nBhagwati (as His Lordship then was) and of Justice Gupta expressly held\nthat merely because a question of political complexion had been raised, that\nby itself could not be a ground precluding the court from discharging its\nduty if the questions had raised issues of constitutional import.° The\nSupreme Court made it very clear that the area of judicial review in respect\nof an exercise of power under Article 356 may be narrow, but if the crucial\nsatisfaction for the exercise of that power was founded only on malafide,\n\nextraneous or irrelevant grounds, the court had the jurisdiction to examine\nit.\n\nHowever, subsequently, in A.K. Roy v. Union of India,’ the Constitution\nBench of the Supreme Court held that after deletion of clause (5) of Article\n356 by the 44th Constitution Amendment Act, which was in existence when\nthe Rajasthan case was decided, the statement of law in the Rajasthan case\non the basis of clause (5) was no longer good law.\n\nBefore Bommai was decided by the Supreme Court, Article 356(5),\nwhich banned judicial review of an order under Article 356, was repealed\nby the 44th Constitution Amendment Act.\n\nIn Bommai, as many as six judgments were delivered by nine judges\nand the judgments revealed some areas of divergence on key issues. The\nMajority judgment was by Justices Sawant, Kuldip Singh, Jeevan Reddy,\nAggarwal and Pandyan, while the minority comprised Justices Ahmadi,\nVerma, Dayal and K. Ramaswamy.\n\nIn Bommai, the Supreme Court enriched our constitutional\njurisprudence by upholding many constitutional values, like the\nparliamentary system, federalism, secularism and judicial control over\nexecutive function.\n\nOne of the most significant aspects of the judgment is that the majority\nheld that the emergent situation which called for the invocation of Article\n356 contemplated a situation of an impasse. Justice Sawant held, relying on\nthe word cannot occurring in Article 356, that this would only mean a\nsituation of physical impossibility which could not be remedied. Short of\nsuch a situation Article 356 cannot be invoked.® This interpretation\nstrengthened the roots of democracy in our country. The power conferred\nunder Article 356 is virtually similar to the powers under Article 58(2)(b) of\nthe Pakistan Constitution and is an extreme power. Therefore, the Supreme\nCourt held that this power can only be exercised when there is an actual or\nimminent breakdown of constitutional machinery.\n\nThis concept for reviewability of presidential power, which has been\naffirmed in Bommai, is virtually a facet of human rights jurisprudence. This\nconcept was developed by the European Commission and the European\nCourt of Human Rights under the European Convention of Human Rights\n(ECHR). It has been established at Strasbourg that the existence of Public\nEmergency is a justiciable issue.° Following the same, the Supreme Court,\nin Bommai, held that the satisfaction of the president in issuing a\n\nproclamation under Article 356 was open to judicial review. However, on\nthe extent of judicial review, there was some divergence. Justice Sawant\nopined that the use of the power under Article 356 would be improper if in\nsome situations set out by the learned judge the president gave no prior\nnotice or opportunity to the state government to correct itself.!° It is,\ntherefore, clear that the learned judge read in the requirement of observing\nprinciples of natural justice before exercise of power under Article 356.\n\nBut Justices Jeevan Reddy and Aggarwal, even though sharing the\nmajority view with Justice Sawant, adopted a lesser test of scrutiny of\npresidential power under Article 356 by holding that the satisfaction of the\npresident in issuing a proclamation under Article 356 is subjective in\nnature. The learned judges formulated the proposition as follows: ‘Since it\nis a case of subjective satisfaction, question of observing the principle of\nnatural justice does not and cannot arise.’\n\nThe learned judges clearly opined that natural justice principles cannot\nbe imported into the situation.'! From the discussion it appears that Justices\nSawant and Kuldeep Singh actually relied on the principle of\nreasonableness in examining the justiciability of a presidential proclamation\nunder Article 356. However, the judgment rendered by Justice Jeevan\nReddy on behalf of himself and Justice Aggarwal adopted a slightly\ndifferent test.\n\nThe importance of this judgment is that in answering the question that\nthe satisfaction of the president is judicially reviewable, the judges relied on\nthe basic structure doctrine and founded the principles as such:\n\nThe federal principle, social pluralism and pluralist democracy\nwhich formed the basic structure of our constitution demand that the\njudicial review of the proclamation issued under Article 356(1) is\nnot only an imperative necessity but is a stringent duty. 1?\n\nThe one remarkable thing about applying the basic structure test in Bommai\nis that prior to Bommai, the basic structure test was applied by the Supreme\nCourt in judging the validity of constitutional amendments. In Bommai,\nhowever, the satisfaction of the president in passing a presidential order,\nwhich is an executive order, was tested through the prism of the basic\nstructure doctrine.\n\nThe other important question laid down in Bommai was that the court\nused the preamble of the Constitution as a basis for formulating the basic\nstructure test. The court upheld the presidential action of the dismissal of\nthree state governments as it found that those state governments were\nincapable of complying with the principle of secularism, which is one of the\npreambular values in the Constitution. Initially, secularism did not figure in\nthe Preamble of the original Constitution but was added by the 42nd\nConstitution Amendment Act. However, the court held in Bommai that the\nprinciple of secularism was implicit in the constitutional principles and was\nmade explicit by the 42nd Constitution Amendment Act.\n\nThe view in the State of Rajasthan case was that a proclamation under\nArticle 356 is valid and the state legislature can be dissolved by the centre\nwithout waiting for the approval of the houses of Parliament.!? This view\nwas departed from in Bommai, and it was held that even if the proclamation\nis not approved by both houses of Parliament within two months, it would\nlapse automatically after that. Thus the dissolution of the legislative\nassembly in the state does not automatically happen with the presidential\nproclamation under Article 356.\n\nIt is therefore clear that the judgment in Bommai has really fortified the\ndemocratic fabric in the country. After Bommai, instances of invoking the\nprovision of Article 356 have been substantially curtailed.\n\nIn the case of the dissolution of the Bihar Assembly in 2005, the\nSupreme Court, being moved under Article 32 in Rameshwar Prasad (VI) v.\nUnion of India,‘* quashed the dissolution notification by holding that the\nuse of Article 356 cannot be justified on ‘mere ipse dixit, suspicion, whims\nand fancies of the Governor’. The principles in the Bommai decision were\nfollowed.\n\nAfter the decision in Bommai, two more decisions, each by a three-\njudge bench of the Honourable Supreme Court, have further toughened the\ndemocratic fabric of our country. Both these decisions—Union of India v.\nAssociation for Democratic Reforms & Another!> and People’s Union for\nCivil Liberties & Another (PUCL) v. Union of India & Another!®—are very\nimportant and brought about a fundamental paradigm shift in our election\nlaws. It is axiomatic that holding of a fair election is of the essence in any\ndemocracy.\n\nIn the first case, the Union of India challenged the decision of the Delhi\nHigh Court, which had directed the Election Commission to secure to the\n\nvoters certain information relating to each candidate seeking election.\nThereafter, the Supreme Court was petitioned by those who went before the\nDelhi High Court and prayed for similar directions, which were issued by\nthe Delhi High Court. They further prayed that the Supreme Court may\nframe guidelines under Article 141 of the Constitution by taking into\nconsideration the 170th Report of the Law Commission of India.\n\nWhile deciding the controversy, the Supreme Court held that in any\nelection the choice of the voter is of utmost importance, and in making an\neffective choice, the voters must know the background of the candidate they\nare choosing in the election. The Supreme Court traced this right to vote as\na natural right flowing from the concept of open democracy in Article 19(1)\nand 19(2) of the International Covenant of Civil and Political Rights. The\nSupreme Court also held that the right to know is a facet of the fundamental\nright of freedom of speech and expression of a voter under Article 19(1)(a)\nof the Constitution. The Supreme Court categorically held that the voter’s\nexpression in an election is articulated by the casting of a vote and that is\nhow the voter speaks in an election. This was the first time that the Supreme\nCourt equated the right to vote with the fundamental right of speech and\nexpression under Article 19(1)(a) of the Constitution and further held that\nfor a fair election in an open participatory democracy, proper information is\na must for voters to make a meaningful choice.\n\nProceeding on the aforesaid principles, the Supreme Court endorsed the\ndirections of the Election Commission by arguing that the reservoir of\npower in Article 324 of the Constitution empowers the Election\nCommission to issue necessary direction when the Representation of People\nAct is silent in that regard. Thus the Supreme Court upheld the directions\nissued by the High Court and directed that the Election Commission could\ncall for an affidavit by issuing an order in exercise of its power under\nArticle 324 of the Constitution from each candidate seeking election to\nParliament or a state legislature to furnish the following items of\ninformation:\n\n(1) Whether the candidate is convicted/acquitted/discharged of any\ncriminal offence in the past—if any, or whether he is punished with\nimprisonment or fine.\n\n(2) Prior to six months of filing of nomination, whether the candidate is\naccused in any pending case of any offence punishable with\n\nimprisonment for two years or more, and in which charge is framed or\ncognizance is taken by the court of law. If so, provide the details\nthereof.\n\n(3) The assets (immovable, movable, bank balance, etc.) of a candidate\nand of his/her spouse and that of dependants.\n\n(4) Liabilities, if any, particularly whether there are any overdues of any\npublic financial institution or government dues.\n\n(5) The educational qualifications of the candidate.\n\nThis is a path-breaking judgment of the Supreme Court in seeking to\nstreamline the election process, which is crucial in a democracy.\n\nIn view of the judgment of the Supreme Court in Union of India v.\nAssociation for Democratic Reforms & Another, the Representation of\nPeople Act was amended. By way of amendment, Section 33A was added\nunder the caption ‘Right to Information’. Section 33A, which came by way\nof amendment, did not give full effect to the judgment of the Supreme\nCourt in Union of India. Rather, the amendment gave effect to the same in a\ntruncated manner by providing that the candidate in an election has to\nfurnish information on (1) whether he is accused of any offence punishable\nwith imprisonment for two years or more in a pending case in which charge\nhas been framed by a competent court and (2) whether the candidate has\nbeen convicted of any offence other than the offence in sub-sections (1) and\n(2) of Section 8 of the Representation of People Act and sentenced to\nimprisonment for one year or more.\n\nSection 33B, which also came by way of the same amendment, on the\nother hand, imposed a ban on disclosure of any other information despite\nanything to the contrary in any judgment, decree or order of any court.\nChallenging Section 33B, as amended, People’s Union for Civil Liberties\nfiled a second case on several grounds in People’s Union for Civil Liberties\nv. Union of India.'”\n\nDealing with the said challenge, the Supreme Court held that the\namendment of Section 33 is ultra vires as it stifles free and fair elections.\nThe three learned judges delivered three separate opinions.\n\nJustice Shah held that the amended Section 33B was beyond the\nlegislative competence of Parliament as in the case of Union of India, the\nSupreme Court had held that the voter has the fundamental right under\nArticle 19(1)(a) of the Constitution to know the antecedents of a candidate\n\n\nand the said judgment had attained finality. The learned judge held that the\nvoter’s fundamental right to know the antecedents of a candidate was\nindependent of his statutory rights under election laws. The learned judge\nfurther held that there is no fixed content on fundamental rights and they are\nempty vessels, which generations of judges have filled up with their\nthoughts in the light of their experience and by way of constitutional\ninterpretation. Thus the contents of these rights have been expanded and\nenriched. Such a right cannot be ignored as a derivative fundamental right\nbut is part of the named fundamental right. Justice P. Venkatrama Reddy, in\nHis Lordship’s judgment, also concurred with the formulation of Justice\nShah and held that the right to vote in an election is not merely a statutory\nright but is a facet of a fundamental right under Article 19(1)(a) and\ntherefore held that the amended Section 33B was not valid, as it was\nimposing a blanket ban on the right to information of a voter.\n\nJustice Dharmadhikari also substantially agreed with the judgment of\nthe other two learned judges, with minor differences from the conclusion of\nJustice Reddy.\n\nThese two judgments have sought to transform the election process in\nthe largest democracy of the world by making it more transparent and\nparticipatory.\n\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "ACCESS TO EDUCATION AND ITS DENIAL\nBY THE FALLACIOUS DICTUM",
            "chapter_path": "./screenshots-images-2/chapter_6",
            "sections": [
                {
                    "section_name": "T.M.A. Pai and Two Subsequent Judgments; Part Restoration of\nAccess by Article 15(1) (5), RTE and Society’s Judgment",
                    "section_path": "./screenshots-images-2/chapter_6/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_6/section_1/e565ae6c-1bd2-4ee3-b4c7-d80c6e17b705.png",
                        "./screenshots-images-2/chapter_6/section_1/afc8b081-3ad9-449e-814a-2ff7ce9ca871.png",
                        "./screenshots-images-2/chapter_6/section_1/9c2abd04-518f-4f50-9254-78ae49f905e9.png",
                        "./screenshots-images-2/chapter_6/section_1/23fb3843-a1b4-4e29-b88c-ce9256e3bbc1.png",
                        "./screenshots-images-2/chapter_6/section_1/2321ae96-e543-47d5-a9bb-bb457b758647.png",
                        "./screenshots-images-2/chapter_6/section_1/eea7d832-96e9-4797-8954-bad0475a4d61.png",
                        "./screenshots-images-2/chapter_6/section_1/dbaa4efb-f233-4ef8-91df-d1f112885e5b.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "THE CONSTITUTION BENCH judgment of the Supreme Court in T.M.A. Pai\nFoundation v. State of Kerala‘ has been decided on such principles as to put\nsevere constraints on the right to education of ordinary citizens. The\njudgment has substantially affected the right to education, especially the\nhigher education of Indian citizens, by taking it beyond the means of most\nof us through a process of reasoning that, with utmost respect, is\nunconstitutional. T.M.A. Pai held that the right to establish an educational\ninstitution, whether for charity or for profit, being an occupation, is a\nfundamental right and is protected by Article 19(1)(g) of the Constitution.\nThe said judgment has also held that the imposition of quota of state seats\nin unaided professional institutions constitutes a serious encroachment on\nthe rights and autonomy of the private professional colleges and they are\nnot saved under reasonable restrictions under Article 19(6) of the\nConstitution. However, fortunately, this position has been neutralized by the\nConstitution (93rd Amendment) Act, 2005, (henceforth the 93rd\nConstitution Amendment Act) which introduced clause (5) in Article 15.\n\nThis finding in T.M.A. Pai, that the right to establish and administer an\neducational institution is available to all citizens under 19(1)(g), subject to\nthe restriction under Article 19(6), was reiterated by the Supreme Court in\nIslamic Academy of Education and Another v. State of Karnataka? and later\non in PA. Inamdar and Others v. State of Maharashtra and Others.?\n\nIn T.M.A. Pai, it has been held that both religious and linguistic\nminority status will be decided on the basis of the population of each state\nand not on the basis of the whole of India. The Supreme Court also held\nthat transfer of the item ‘education’ from the state list to the concurrent list\nof the 7th Schedule in our Constitution does not bring about any difference.\nThe same position has been reiterated in both Inamdar and Islamic\nAcademy (supra).\n\nThe aforesaid interpretation by the Supreme Court seems to run counter\nto the object and scope of Article 30 of the Constitution. The rights under\nArticle 30 are not given to citizens but have been given to minorities.\nArticle 30 does not seem to protect an educational entrepreneur who is a\nmajority in his own state, but if he crosses over to a neighbouring state, he\nbecomes a minority and enjoys the protection under the said article. In my\nhumble understanding, for coming under the protection of minorities under\nArticle 30, the vulnerability of a religion or a language is an essential\nelement. The article is meant to protect insulated sections of society.\nTherefore, minorities under Article 30 must necessarily mean those who\nform a distinct and identifiable group of citizens in India.\n\nA concomitant right of the right under Article 30 is recognized under\nArticle 30(1A) of the Constitution. The said article runs as under:\n\nIn making any law providing for the compulsory acquisition of any\nproperty of an educational institution established and administered\nby a minority, referred to in clause (1), the State shall ensure that the\namount fixed by or determined under such law for the acquisition of\nsuch property as would not restrict or abrogate the right guaranteed\nunder that clause.*\n\nA perusal of the Article 30(1A) makes it clear that the minorities\nestablishing and administering an educational institution have a\nfundamental right to the property of the educational institution, to such an\nextent that the state cannot acquire the said property in a manner which\nrestricts or abrogates the fundamental right granted under Article 30(1). In\nthe event of an acquisition, the Constitution’s mandate on the state is to fix\nsuch an amount of compensation which will not restrict or abrogate the\nright of minorities under Article 30(1). In other words, the property in\nwhich the minorities establish and run an educational institution gets\n\nprotection by way of Article 30(1A) from the ordinary mode of acquisition.\nIt is made clear that in the event of an acquisition, the right to establish and\nadminister the educational institution cannot be diluted; rather, it will have\nbe protected by the amount of compensation.\n\nTherefore, by holding that the right to establish an educational\ninstitution is a fundamental right of every citizen under Article 19(1)(g) of\nthe Constitution, T.M.A. Pai has conferred on every citizen the right which\nhas been conferred only on minorities under Articles 30(1) and 30(1A). By\nthe same logic, as discussed earlier, the property in which an educational\ninstitution is established by anyone qualifies for the same protection which\nis given under Article 30(1A). An educational institution can only be\nestablished on some immovable property. So the fundamental right of a\nperson to establish and run an educational institution is inextricably\nconnected to the fundamental right to hold and own the said property on\nwhich the educational institution is established and run. Thus a citizen who\nhas no fundamental right to property, in view of the express deletion of\nArticle 19(1)(f) by the 44th Constitution Amendment Act, is conferred with\nthe said fundamental right over property if he chooses to establish an\neducational institution on his property. This is also true on the principle of\nemanation as developed in Maneka Gandhi v. Union of India and Others.°\nIt is axiomatic that no one can enjoy the fundamental right of founding and\nrunning an educational institution if the property on which the institution is\nrun is acquired.\n\nWhile deleting the fundamental right to property from Article 19(1)(f)\nof the Constitution, the following relevant recitals have been made in the\nStatement of Objects and Reasons of the 44th Constitution Amendment\nAct:\n\nIn view of the special position sought to be given to fundamental\nrights, the right to property, which has been the occasion for more\nthan one amendment of the Constitution, would cease to be a\nfundamental right and become only a legal right. Necessary\namendments for this purpose are being made to Article 19 and\nArticle 31 is being deleted. It would however, be ensured that the\nremoval of property from the list of fundamental rights would not\naffect the rights of minorities to establish and administer educational\ninstitutions of their choice.®\n\nIt is thus clear that by recognizing the fundamental right to establish an\neducational institution of every citizen under Article 19(1)(g), T.M.A. Pai\nhas virtually revived the already deleted fundamental right to property of a\ncitizen if he is an educational entrepreneur. In addition, the distinction\nbetween an educational institution established by minorities and non-\nminorities in matters relating to acquisition of properties, as mentioned in\nArticle 30 (1-A) and the clear intentions expressed in the 44th Constitution\nAmendment Act while deleting Article 19(f), stand obliterated.\n\nThis interpretation that the right to establish educational institutions is a\nfundamental right under Article 19(1)(g), in my humble understanding, is\ntherefore not constitutionally sustainable as it seeks to revive a deleted\nfundamental right in respect of educational entrepreneurs and equates their\nproperty rights with those of the educational institutions set up by\nminorities. This is opposed to the tenets of the equality clause under Article\n14, as a citizen setting up a cultural society, a dancing school or a sports\ncomplex—all extensions of educational activity—does not have the right to\nbring the property on which these institutions are set up and run under the\nprotection of fundamental rights.\n\nApart from the aforesaid clear constitutional anomalies, the Supreme\nCourt, in T.M.A. Pai, has, with respect, given an erroneous interpretation to\nthe concept of education by equating it with a commercial venture and\nmade it clear that an entrepreneur setting up an educational institution can\nearn profit; however, profiteering is not permissible. In these times of\ncommercialization, it has become difficult to distinguish between earning\nlegitimate profit and profiteering. But by giving the private entrepreneur a\nfundamental right to establish an educational institution, which necessarily\nrecognizes his fundamental right over the property on which such an\neducational institution is administered, T.M.A. Pai encourages profiteering\nand property motives in the field of education, which has the effect of\ndenying access to education to the vast majority of Indians who are priced\nout of these educational institutions that are established to earn profit. The\nlogic which has been employed by T.M.A. Pai is that since an educational\ninstitution has been held to be an industry by the Supreme Court in\nBangalore Water Supply and Sewerage Board v. R. Rajappa,’ by the same\nparity of logic an educational institution is to be equated with an industrial\nestablishment. This is per se unsustainable. In my humble understanding,\nthe right to establish an educational institution must not be extended in such\n\na way as to circumscribe the common man’s access to education, as the\nconstitutional thrust is towards extending the ambit of such access which is\nclear from Article 21A of the Constitution. There may be some common\nfeatures between an industry and an educational institution; at the same\ntime, there are also some basic fundamental differences. To equate the two\nis like equating a tiger with an elephant, as both have tails. Such logic is\nvitiated by the fallacy of undistributed middle.\n\nNormally, setting up of an educational institution is a charitable venture\nin view of Article 26A of the Constitution, wherein such rights have been\nconferred on a religious denomination or any other section thereof. Relying\non this, even T.M.A. Pai recognized that education is an identified head of\ncharity.® Thereinafter, pronouncing that it is an entrepreneurial activity with\nprofit motive is inconsistent with the core constitutional values in the\nPreamble, which have been articulated in the fundamental rights and\ndirective principles.\n\nAfter the judgment of the Supreme Court in TMA. Pai several\nquestions arose, mostly concerning the fixation of fees structure in different\nminority and non-minority educational establishments, most of which were\nprofessional institutions. To clarify the various directions in T.M.A. Pai, the\nSupreme Court again constituted another Constitution Bench of five judges\nin Islamic Academy.\n\nIn that case, the court, after reiterating the judgment in T.M.A. Pai,\ndirected the setting up of a committee headed by a retired High Court judge\nto be nominated by the chief justice of the concerned state for fixing the\nproposed fee structure of the concerned institution. That direction was\npassed by the Supreme Court in Islamic Academy in exercise of its power\nunder Article 142 of the Constitution, as the educational institutions were\ncollecting exorbitant fees in a manner which did not meet the approval of\nthe Supreme Court. The judgment in Islamic Academy also sought to\nexplain the judgment in T.M.A. Pai on various other aspects.\n\nIn PA. Inamdar'® again, another Constitution Bench of the Supreme\nCourt, consisting of Chief Justice Lahoti and six other learned judges,\nexamined the reasons in T.M.A. Pai to find out whether the clarification\ngiven in Islamic Academy ran counter to the decision in T.M.A. Pai. By\ndoing so the court was aware of the situation that even if the bench in\nInamdar disagreed with the findings in T.M.A. Pai, it could not make any\n\ndeclaration to that effect since T.M.A. Pai was the decision of an eleven-\njudge bench.\n\nI am of the opinion that as the T.M.A. Pai reasoning is unfortunately\nbased, with respect, on unsound principles, as pointed out above, the\nSupreme Court was required to do the job of repairing the damage caused\nby the T.M.A. Pai decision through two subsequent Constitution Bench\njudgments—in Islamic Academy and in Inamdar.\n\nAbout the decision in T.M.A. Pai, the Supreme Court, in Inamdar,\nexpressed its unhappiness by quoting its observation in the Annual Survey\nof Indian Law on T. M.A. Pai, that ‘the judgment raises more questions than\nit has answered’.!! However, Inamdar was primarily concerned with\nsettling the procedure of admission in institutions offering professional\neducation, the aim being to evolve some methods to ensure that meritorious\nstudents are given access to education on ‘non-exploitative norms’. The\ndecision aimed at structuring the admission procedure to make it ‘fair,\ntransparent and non-exploitative’ so that it may promote merit and\nexcellence, and curb malpractices. The court therefore held that in matters\nof education, no capitation fee should be charged directly or indirectly and a\ncommittee was to be set up for regulating admission, apart from the\ncommittee which had been set up in Islamic Academy for regulating the fee\nstructure. All these had to be safeguarded by the Supreme Court by these\ntwo successive Constitution Bench decisions in Islamic Academy and\nInamdar, as the educational scenario after T.M.A. Pai became, so to say,\nvery elitist and, if I may add, claustrophobic.\n\nAn attempt has been made to salvage the situation by inserting Sub-\narticle (5) to Article 15 by the 93rd Constitution Amendment Act and then\nby enacting the Right of Children to Free and Compulsory Education Act,\n2009 (hereinafter RTE Act 2009) whereby the provisions of Article 15(5)\nread with Article 21A of the Constitution were implemented. Article 21A of\nthe Constitution recognized the fundamental right to free and compulsory\neducation of children between the ages of six and fourteen, and mandated\nthe state to make a provision for the same. Article 15(5) enabled the state to\nmake a special provision for admission to educational institutions, including\nprivate educational institution, other than minority institutions, despite\nanything to the contrary in 19(1)(g) of the Constitution.\n\nIn fact, the 93rd Constitution Amendment Act, which inserted clause (5)\nto Article 15, watered down the interpretation of Article 19(1)(g) as given\n\n\nin TM.A. Pai.\n\nThe constitutional validity of RTE was challenged in Society for\nUnaided Private Schools of Rajasthan v. Union of India,'? and was upheld\nby a majority verdict of 2:1.\n\nThis is a landmark judgment. In this judgment, the Supreme Court,\nspeaking through Chief Justice S.H. Kapadia, declared that Article 15(5) of\nthe Constitution is valid and virtually nullified the decision in PA. Inamdar\nin vital areas. PA. Inamdar held that (1) there will be no reservation in\nprivate unaided colleges and (2) there will be no difference between\nunaided minority and non-minority institutions.‘\n\nThese findings were reached in Inamdar in view of the decision in\nT.M.A. Pai.“ It is thus clear that Article 15(5) of the Constitution, read with\nRTE, as upheld in Society for Unaided Private Schools, widened the access\nto education for common people. The Supreme Court held in Society for\nUnaided Private Schools that an educational institution is charitable and\nthat the crucial role of universal elementary education is to strengthen the\nsocial fabric of democracy through equal opportunities to all. The court also\nmaintained that the duty of the court is to interpret fundamental rights in\nlight of the directive principles. These principles convey the message of\nsocial justice in the Constitution.\n\nThe Supreme Court, in Society for Unaided Private Schools, held that\nthe right to live, recognized in Article 21, covers access to education, but\nthat the high costs of education which make it unaffordable ‘defeats access’.\nThe court also decided to give such access to education, and Article 21A\nwas introduced to give effect to Article 45 of the directive principles.\n\nThus access to education, which was virtually impeded in T.M.A. Pai,\nwas somewhat restored in view of three factors: (1) Article 15(5) of the\nConstitution, which was inserted by the 93rd Constitution Amendment Act;\nand (2) the RTE Act 2009 and (3) the Supreme Court judgment in Society\nfor Unaided Private Schools, which upheld the RTE Act 2009.\n\nWhen access to education is shackled, it definitely retards human\ndevelopment and stifles social harmony. Tyrants and despots have always\nattempted to cramp opportunities of education. In this connection, Adolf\nHitler’s speech against universal education, quoted by the Supreme Court in\nUnnikrishnan, J.P. and Others v. State of Andhra Pradesh and Others,'° is\nvery pertinent.\n\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "AFFIRMATIVE STATE ACTION AND\nPROTECTION OF REVERSE\nDISCRIMINATION BY COURTS",
            "chapter_path": "./screenshots-images-2/chapter_7",
            "sections": [
                {
                    "section_name": "Protection of the Scheduled Castes, Scheduled Tribes and Other\nBackward Classes",
                    "section_path": "./screenshots-images-2/chapter_7/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_7/section_1/9c8d9884-973c-40d7-99cb-ca13063568be.png",
                        "./screenshots-images-2/chapter_7/section_1/14111a17-e750-4054-9066-f9efda8843c8.png",
                        "./screenshots-images-2/chapter_7/section_1/0f3d1a21-6c37-422f-91f0-b4cb1d893d52.png",
                        "./screenshots-images-2/chapter_7/section_1/3f16f9f2-77b9-42d7-832d-fd51ddd0cab2.png",
                        "./screenshots-images-2/chapter_7/section_1/775614ea-06d8-40d0-99b8-897641e77580.png",
                        "./screenshots-images-2/chapter_7/section_1/7cd00ce3-d3d4-474f-be8e-df186688761c.png",
                        "./screenshots-images-2/chapter_7/section_1/ea232821-08b5-48de-8b5d-1e9bac8b2381.png",
                        "./screenshots-images-2/chapter_7/section_1/c0c70e0a-555c-403d-b90d-1ceeb4dde79a.png",
                        "./screenshots-images-2/chapter_7/section_1/47de1d9e-33d5-42ab-b1fb-16fa51f08f31.png",
                        "./screenshots-images-2/chapter_7/section_1/75308b69-0906-4c0f-9985-430ae52e3e16.png",
                        "./screenshots-images-2/chapter_7/section_1/57d3a74d-8deb-4bcf-a08e-22651f78d25c.png",
                        "./screenshots-images-2/chapter_7/section_1/df9ece06-6e49-45a7-83d7-23b7fa9d52c0.png",
                        "./screenshots-images-2/chapter_7/section_1/920ca11c-2c56-4509-bc2b-b3b1dcb03e1d.png",
                        "./screenshots-images-2/chapter_7/section_1/25401114-0131-4c89-abf3-4443f921f605.png",
                        "./screenshots-images-2/chapter_7/section_1/5c1233ec-a80d-433c-b946-440f761a6c59.png",
                        "./screenshots-images-2/chapter_7/section_1/a93120b8-4696-47ea-84cf-8163517e7231.png",
                        "./screenshots-images-2/chapter_7/section_1/08158c16-3a28-4151-9c06-907c0fcdf195.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "AN APT PERCEPTION of the constitutional mandate of reverse discrimination\nin favour of Scheduled Castes (SCs), Scheduled Tribes (STs) and Other\nBackward Classes (OBCs), for bringing them within the sweep of equal\nopportunity, would require appreciating this constitutional imperative in the\nbackdrop of our national freedom movement, which gives legitimacy to\nthese concepts.\n\nThe seeds of constitutionalism, which blossomed in our National\nCharter, were sowed through our national independence movement which\nbegan in 1885 and culminated in 1947.\n\nThe chapters on fundamental rights and directive principles in our\nConstitution demonstrate a picture of India of the future, in which common\nmen and women are to be empowered. In our country, for a long time the\nHindu caste system divided people and determined the status of persons\naccording to the caste in which he/she was born. Dr B.R. Ambedkar, the\nchief of the drafting committee of our Constitution, experienced both caste-\nbased discrimination and colonial rule in the time of the British Raj. This\nera had two prominent vices—one was British dominance and the other,\nmore widespread and threatening, was the Brahminical order suppressing\nsocial equality. The two, more often than not, combined and crushed\ncommon Indians. Our Constitution tried to eradicate both, by asserting\n\nIndia’s sovereignty and resolving to establish a new social order based on\njustice of the widest dimension, encompassing the social, economic and\npolitical aspects.\n\nUnder our Constitution, India is a welfare state with an activist agenda.\nArticles 16(4), 16(4A), 17, 23, 24, 38 and 46 enjoin upon the state to\npromote, with special care, the educational and economic interests of the\nweaker sections and of SCs and STs. This is in order to protect them from\nsocial injustice and all forms of exploitation and to provide for their social\nadvancement by reserving posts for them in civil service if they are not\nadequately represented. Thus our Constitution endorses the state’s\naffirmative stance for ensuring social equality. That is why our fundamental\nrights are diverse enough to include both civil and political rights, as also\nsocial and economic rights, such as abolition of untouchability, prohibition\nof trafficking in human beings, prohibition of forced labour, non-\nemployment of children in hazardous jobs and now, compulsory free\neducation for children between the ages of six and fourteen. These articles\nembody social rights of the widest variety and call upon the state to pass\nsuitable laws for making these rights enforceable. Our Constitution thus\nunderscores the interventionist character of the state.\n\nThe provision of caste reservation in our Constitution comes in for\ncomparison with the racial preferences in the American Constitution. In the\nUS, caste is a matter of policy and not of right. Ronald Dworkin argued that\nit is a good policy to have social preferences in universities, in the interest\nof securing greater diversity in the social perspective. In the US, social\npreferences never figure in the text of the Constitution but are adopted as\nmeasures of policy long after the adoption of the Constitution and without\nany amendment in its text.\n\nIn India, provision for reservation by way of reverse discrimination was\nmade from the very inception and the Constitution was further amended to\nwiden its scope. Such provisions are of two types: mandatory provisions\nand enabling provisions. Article 330 of the Constitution, which provides for\nreservation of seats in the Lok Sabha, is a mandatory provision, but the ones\nunder Article 16(4) are enabling provisions. However, in the course of time,\nthe distinction between mandatory and enabling provisions became blurred\nin view of emphasis on social justice.\n\nThe Supreme Court of the United States dealt with this question of\nreservation as an affirmative action of the state in various celebrated\n\ndecisions, notable among them being Oliver Brown v. Board of Education\nof Topeka,' Spottswood Thomas Bolling v. C. Melvin Sharpe,2 Marco\nDeFunis v. Charles Odegaard,? Regents of the University of California v.\nAllan Bakke, H. Earl Fullilove v. Philip M. Klutznick® and Metro\nBroadcasting Inc. v. Federal Communications Commission.®\n\nAs such, the affirmative actions of the state have been endorsed by the\nSupreme Court of the United States as they seek to eradicate the continuing\neffects of past discrimination and make equal opportunities accessible to all\nmembers of society. The court states that such availability of access results\nin fuller participation in governance by the disadvantaged and discriminated\nsocial groups and balances the chronic under-representation of such groups.\nThe Supreme Court of the United States has held an adequate representation\nas an important governmental objective.\n\nIndia’s Supreme Court, in Indra Sawhney v. Union of India,’ held that\nthese principles of the Supreme Court of the United States apply ‘ex proprio\nvigore’ to Indian society and opined that discrimination in our society is\nmore chronic.\n\nHowever, our Supreme Court, in Ashoka Kumar Thakur v. Union of\nIndia and Others,® felt that in view of the structural difference between the\nIndian and American Constitutions, the principles of affirmative action in\nthe US would not automatically hold good in our Constitution. For instance,\nin our Constitution there are no principles of ‘suspect legislation’ or ‘strict\nscrutiny’ or ‘compelling state necessity’ as there are in the US Constitution.\n\nUnder our Constitution, every legislation passed by a competent\nlegislature is presumed to be valid unless the contrary is proved. Further, in\nour Constitution, the main goal is to achieve unity in our country through\nthe integration of different social groups, which cannot be achieved without\ngiving equal status to all. Neither democracy nor social integration can\nbecome real unless all sections of society have an equal voice in the affairs\nand governance of society.\n\nThis emphasis on social justice has been explained by the Supreme\nCourt in its Constitution Bench judgment in State of Kerala and Anr v. N.M.\nThomas and Ors? by His Lordship Justice K.K. Mathew. His Lordship\npointed out that the directive principles in Article 46 are binding not only\non the lawmakers. According to the learned judge, these principles should\ninform and guide the approach of the court when the court decides any\n\ncontroversy involving these questions as the court, being a state within the\nmeaning of Article 12, ‘makes law, even though interstitially, from the\nmolar to the molecular’. The learned judge explained that the egalitarian\nprinciples enshrined in the Constitution impose an affirmative duty on the\ngovernment to eliminate discrimination. That is made clear by the language\nused in Article 16, which, contrary to the negative phraseology of Article\n14, is couched in a positive mandate.!°\nThe learned judge observed very succinctly:\n\nToday the sense that Government has affirmative responsibility for\nelimination of inequalities, social, economic or otherwise, is one of\nthe dominant forces in Constitutional law.'!\n\nThe learned judge referred to Daniel P. Moynihan, an American scholar, to\nelaborate the concept of equality of opportunity for diverse social groups.\nHe quoted excerpts, which are strikingly relevant:\n\nThe point of semantics is that equality of opportunity now has a\ndifferent meaning for Negroes than it has for Whites. It is not (or at\nleast no longer) a demand for liberty alone but also for equality in\nterms of group results. In Bayard Rustin’s terms, ‘it is now\nconcerned not merely with removing the barriers to full opportunity\nbut with achieving the fact of equality.’ By equality Rustin means a\ndistribution of achievements among Negroes roughly comparable\nwith Whites.\n\nThe controversy over reservation came up before the Supreme Court in\nmany cases and the divergence of opinion was recorded therein. The most\nlandmark judgment on these issues was rendered in the case of Indra\nSawhney,‘ wherein a nine-judge Constitution Bench of the Supreme Court\ndecided the question by a 6:3 majority.\n\nArticle 16(4) of the Constitution does not define the backward class of\ncitizen as is elaborated in Article 15(4) by the expression ‘socially and\neducationally’. The SCs and STs are defined in Article 366(24) and 366(25)\nof the Constitution respectively as under:\n\nArticle 366 (24): ‘Scheduled Castes’ means such castes, races or\ntribes or parts of or groups within such castes, races or tribes as are\n\ndeemed under Article 341 to be Scheduled Castes for the purposes\nof this Constitution;\n\nArticle 366 (25): ‘Scheduled Tribes’ means such tribes or tribal\ncommunities or parts of or tribal communities as are deemed under\nArticle 342 to be Scheduled Tribes for the purposes of this\nConstitution.\n\nThe Constitution also does not define backward classes. Article 340\nprovides the appointment of a commission by the president of India to\ninvestigate the conditions of socially and educationally backward classes\n(SEBCs).\n\nThe factual background that led to the caste controversy commenced\nwith the appointment of the First Backward Classes Committee (the Kaka\nWelfare Commission) by the president, which submitted its report in 1955,\nidentifying 2,399 castes as socially and educationally backward. However,\nthe report was not accepted, as no objective criteria for identifying the\nOBCs were ever stated.\n\nThen, in 1979, by an order issued under Article 340 of the Constitution,\nthe president appointed a Second Backward Classes Committee to\ninvestigate matters relating to the socially and economically backward\nclasses in India. This commission came to be known as the Mandal\nCommission. The recommendations were given in December 1980. The\ncommission recommended 27 per cent reservation in favour of OBCs in\naddition to 22.5 per cent in favour of SCs and STs. The government did not\ntake any step to implement the report till 1990, when an office\nmemorandum dated 13 August 1990 was issued.\n\nThe first memorandum sought to implement the Mandal Commission\nreport by reserving 27 per cent vacancies in civil posts, to be filled in by\ndirect recruitment from SEBCs.\n\nThe issue of this memorandum led to widespread protests, leading to\ndamage of public properties and self-immolation by various young persons.\nProceedings were filed in the Supreme Court challenging the memorandum.\nBy an order dated 1 October 1990, the operation of the office memorandum\nwas stayed by the Supreme Court.\n\nWith the change of government in the first half of 1991, it was decided\nto implement the office memorandum in a modified form and another office\nmemorandum dated 25 September 1991 was issued.\n\nThe second memorandum referred to the poorer sections of SEBCS in\nrespect of 27 per cent reservation by the first memorandum and made an\nadditional reservation of 10 per cent vacancies for other economically\nbackward sections of people.\n\nThe controversy over the whole issue was then decided by the\nConstitution Bench of nine judges in Indra Sawhney.'4\n\nIt may be noted that the controversy in Indra Sawhney was not about\nrights under Article 15(4) but the ones under Article 16(4). Article 15(4)\nenables the state to make laws for the advancement of any SEBCs or for\nSCs or STs. Article 16(4) enables the state to provide for reservation of\nposts in favour of backward classes of citizens, which are inadequately\nrepresented in the employment under the state. By 6:3 majority, in Indra\nSawhney, the Supreme Court upheld the first memorandum but invalidated\nthe addition of the 10 per cent by the second.\n\nIn Indra Sawhney, the court had to deal with all the available groups,\nsections and classes in society since caste represented an existing,\nidentifiable social group/class encompassing an overwhelming majority of\nthe country’s population. One could, according to the court, well begin with\ncaste and then go to other groups, sections and classes. Caste, however, was\nnot an essential factor for determining social and educational backwardness.\nIt was also not necessary that the SEBCs should be similarly situated as the\nSCs and STs. Within SEBCs the classification between the backward and\nthe more backward was permissible. To maintain the cohesiveness and\ncharacter of a class, the ‘creamy layer’ could and must be excluded from\nSEBCs. The court also clarified that ‘backward class of citizens’ in Article\n16(4) was a wider category than SEBCs in articles 15(4) and 340. In the\nformer, the accent is on social backwardness while in the latter it is on both\nsocial and educational backwardness.\n\nAfter a very elaborate discussion, the majority judgment of Justice B.P.\nJeevan Reddy answered these questions by holding:!>\n\n69) (a) It is not necessary that the ‘provision’ under Article\n16(4) should necessarily be made by the\nParliament/Legislature. Such a provision can be\nmade by the Executive also. Local bodies, Statutory\nCorporations and other instrumentalities of the State\nfalling under Article 12 of the Constitution are\n\n(2)\n\n(3)\n\n()\n\n(a)\n\n()\n\n©\n\n(a)\n\n()\n\nthemselves competent to make such a provision, if\nso advised.!®\n\nAn executive order making a provision under\nArticle 16(4) is enforceable the moment it is made\nand issued.!”\n\nClause (4) of Article 16 is not an exception to clause\n(1). It is an instance and an illustration of the\nclassification inherent in clause (1).18\n\nArticle 16(4) is exhaustive of the subject of\nreservation in favour of backward class of citizens,\nas explained in this judgment.!9\n\nReservations can also be provided under clause (1)\nof Article 16. It is not confined to extending of\npreferences, concessions or exemptions alone. These\nreservations, if any, made under clause (1) have to\nbe so adjusted and implemented as not to exceed the\nlevel of representation prescribed for ‘backward\nclass of citizens’—as explained in this judgment.2°\nA caste can be and quite often is a social class in\nIndia. If it is backward socially, it would be a\nbackward class for the purposes of Article 16(4).\nAmong non-Hindus, there are several occupational\ngroups, sects and denominations, which for\nhistorical reasons are socially backward. They too\nrepresent backward social collectivities for the\npurposes of Article 16(4).!\nNeither the Constitution nor the law prescribes the\nprocedure or method of identification of backward\nclasses. Nor is it possible or advisable for the court\nto lay down any such procedures or method. It must\nbe left to the authority appointed to identify. It can\nadopt such method/procedure as it thinks convenient\nand so long as its survey covers the entire populace,\nno objection can be taken to it. Identification of the\nbackward classes can certainly be done with\nreference to castes among, and along with, other\n\n\n©\n\n@\n@)\n\n®\n\noccupational groups, classes and sections of people.\nOne can start the process either with occupational\ngroups or with castes or with some other groups.\nThus one can start the process with the castes and\nwhen they are found, apply the criteria (evolved for\ndetermining backwardness) and find out whether it\nsatisfies the criteria. If it does—what emerges is a\n‘backward class of citizen’ within the meaning of\nand for the purposes of Article 16(4).\nSimilar process can be adopted in the case of\nother occupational groups, communities and classes,\nso as to cover the entire populace. The central idea\nand overall objective should be to consider all\navailable groups, sections and classes in society and\nsince caste represents an existing, identifiable social\ngroup/class encompassing an overwhelming\nminorities [sic] of the country’s population one can\nwell begin with it and then go to other groups,\nsections and classes.”\nIt is not correct to say that the backward class of\ncitizen contemplated in Articles 16(4) is the same as\nthe socially and educationally backward classes\nreferred to in Article 15(4). It is much wider. The\naccent in Article 16(4) is on social backwardness.\nOf course, social, educational and economic\nbackwardness are closely intertwined in the Indian\ncontext.23\n‘Creamy layer’ can be, and must be excluded.?4\nIt is not necessary for a class to be designated as a\nbackward class that it is situated similarly to the\nScheduled Caste/Schedule Tribes.2°\nThe adequacy of representation of a particular class\nin the services under the State is a matter within the\nsubjective satisfactions of the appropriate\nGovernment. The judicial scrutiny in that behalf is\n\n\n(4)\n\n(5)\n\n(6)\n\n(7)\n\nthe same as with other matters within the subjective\nsatisfaction of an authority.2°\n\n(a) A backward class of citizens cannot be identified\nonly and exclusively with reference to economic\ncriteria.?”\n\n(b) It is, of course, permissible for the Government or\nother authority to indentify the backward class of\ncitizens on the basis of occupation-cum-Income,\nwithout reference to caste, if it is so advised.28\n\nThere is no constitutional bar to classify the backward\nclasses of the citizens into backward and more backward\ncategories.”9\n(a) and (b) The reservation contemplated in clause (4) of\nArticle 16 should not exceed 50%. While 50% shall be the\ntule, it is necessary not to put out of consideration certain\nextraordinary situations inherent in the great diversity of this\ncountry and the people. It might happen that in far-flung and\nremote areas the population inhabiting those areas might, on\naccount of their being out of the mainstream of national life\nand in view of the conditions peculiar to and characteristic\nof them need to be treated in a different way, some\nrelaxation in this strict rule may become imperative [sic]. In\ndoing so, extreme caution is to be exercised and a special\ncase made out.°°\n\n(c) The rule of 50% should be applied to each year. It\ncannot be related to the total strength of class,\ncategory, service or cadre, as the case may be.*!\n\n(d) —_ Devadasan was wrongly decided and is accordingly\noverruled to the extent it is inconsistent with this\njudgment.\n\nArticle 16(4) does not permit provision for reservations in\n\nthe matter of promotion. This rule shall, however, have\n\nonly prospective operation and shall not affect the\npromotions already made, whether made on regular basis\nor on any other basis. We direct that our decision on this\nquestion shall operate only prospectively and shall not\n\n(8)\n\n(9)\n\n(10)\n\n(1)\n\naffect promotions already made, whether on temporary,\nofficiating or regular/permanent basis. It is further directed\nthat wherever reservations are already provided in the\nmatter of promotion—be it Central Services, or for that\nmatter services under any Corporation, authority or body\nfalling under the definition of ‘State’ in Article 12—such\nreservations may continue in operation for a period of five\nyears from this day. Within this period, it would be open to\nthe appropriate authorities to revise, modify or reissue the\nrelevant rules to ensure the achievement or the objective of\nArticle 16(4). If any authority thinks that for ensuring\nadequate representation of ‘backward class of citizens’ in\nany service, class or category, it is necessary to do so.\n(Ahmadi, J expressed no opinion on this question\nupholding the preliminary objection of Union of India). It\nwould not be impermissible for the State to extend\nconcessions and relaxations to members of reserved\ncategories in the matter of promotion without\ncompromising the efficiency of the administration.*°\n\nWhile the rule of reservation cannot be called anti-\nmeritarian, there are certain services and posts to which it\nmay not be advisable to apply the rule of reservation.*+\nThere is no particular or special standard of judicial\nscrutiny applicable to matters arising under Article 16(4).°°\nThe distinction made in the impugned Office Memorandum\ndated September 25, 1991 between ‘poorer sections’ and\nothers among the backward classes is not invalid; if the\nclassification is understood and operated as based upon\nrelative backwardness among the several classes identified\nas Other Backward Classes.*°\n\nThe reservation of 10% of the posts in favour of ‘other\neconomically backward sections’ of the people who are not\ncovered by any of the existing schemes of the reservation\nmade in the impugned Office Memorandum dated\nSeptember 25, 1991 is constitutionally invalid and is\naccordingly struck down.°”\n\n(12) The Government of India and the State Governments have\nthe power to and ought to create a permanent mechanism,\nin the nature of a Commission, for examining requests of\ninclusion and complaints of over-inclusion or non-inclusion\nin the list of OBCs and to advise the Government, which\nshall ordinarily be binding upon the Government. Where,\nhowever, the Government does not accept the advice, it\nmust record its reasons thereunder.°®\n\n(13) In view of the answers given by us herein and the\ndirections issued herewith, it is not necessary to express\nany opinion on the correctness and adequacy of the\nexercise done by the Mandal Commission. It is equally\nunnecessary to send the matters back to the Constitution\nBench of five Judges.°°\n\nIn Indra Sawhney, the Supreme Court held by a majority that reservation\ncannot be applied in matters of promotion. To circumvent this finding, the\nConstitution (77th Amendment) Act, 1995 (henceforth the 77th\nConstitution Amendment Act) was introduced whereby Article 16(4A) was\nbrought in, providing that reservation could be applied in promotion in\nfavour of SCs and STs. Again, in 2001, by the Constitution (85th\nAmendment) Act, 2001 (henceforth the 85th Constitution Amendment Act)\nthe benefit of consequential seniority was also inserted in Article 16(4A)\nwith effect from 17 June 1995. This was done in order to give effect to the\nconstitutional amendment before the expiry of the time limit given in Indra\nSawhney, viz. five years from the date of the judgment for the rule\npermitting reservations in promotion to end. Prior to that, in 2000, Article\n16(4B) was introduced by the Constitution (81st Amendment) Act, 2000\n(henceforth the 81st Constitution Amendment Act) to ensure that with\nrespect to carry-forward vacancies too, the consequential benefits would be\ngiven in promotion in favour of the SC and ST candidates with\nretrospective effect. With the Constitution (82nd Amendment) Act, 1992,\n(henceforth the 82nd Constitution Amendment Act) Article 335 was\namended to introduce provisions for relaxation of qualifying marks or\nstandard of evaluation in relation to SC and ST candidates.\n\nIn the case of M. Nagaraj and Others v. Union of India and Others,*°\nthe validity of the 77th Constitution Amendment Act, the 81st Constitution\n\nAmendment Act and the 82nd Constitution Amendment Act was challenged\non the ground that these amendments sought to alter the basic structure of\nthe Constitution.\n\nRepelling the said contention, the Constitution Bench of the Supreme\nCourt, in its landmark decision in M. Nagaraj, held that a constitutional\nprovision must not be construed in a narrow, pedantic and constricted sense\nbut in a wide and liberal manner so as to anticipate and take account of\nchanging conditions and purposes, so that the constitutional provision does\nnot get fossilized but remains flexible enough to meet newly emerging\nproblems and challenges.\n\nWhile exercising the power of judicial review, the court felt that it\nshould ascertain whether a constitutional principle qualifies as an essential\nfeature. In order to be an essential feature it must be established that the\nsaid principle is a part of the constitutional law binding on the legislature.\nOnly thereafter is the second step to be considered, namely, whether the\nprinciple is so fundamental as to bind even the amending power of\nParliament to form a part of the basic structure. This is the standard of\njudicial review of constitutional amendments in the context of the doctrine\nof basic structure.\n\nThe theory of basic structure, therefore, is based on the concept of\nconstitutional identity. As has been noted in the case of Kesavananda\nBharati v. State of Kerala,*! the word ‘amendment’ postulates that the old\nConstitution survives without loss of its identity despite the change and it\ncontinues even though it has been subjected to alteration. To destroy its\nidentity is to abrogate the basic structure of the Constitution. The main\npurpose behind the theory of constitutional identity is continuity, and within\nthat continuity of identity changes are admissible, depending upon the\nsituation and circumstances of the day.\n\nTherefore, the court held that in the matter of application of the\nprinciple of basic structure, twin tests have to be satisfied, namely the\n‘width test’ and the test of ‘identity’.\n\nThe court, in M. Nagaraj, further went on to pronounce that basic\nstructure is based on the principle that a change in a thing does not involve\nits destruction, and destruction of a thing is a matter of substance and not of\nform. Therefore, one has to apply the test of overarching principle to be\ngathered from the scheme and the placement and the structure of an article\nin the whole scheme of the Constitution.\n\nThe court held that in the background of social justice, a constitutional\ncreed, reservation is necessary for transcending caste and not for\nperpetuating it. Reservation has to be used in a limited sense, otherwise it\nwill perpetuate casteism in the country. Equality in Article 16(1) is\nindividual-specific, whereas provisions for reservation in Article 16(4) and\nArticle 16(4A) are enabling. The discretion of the state is, however, subject\nto the existence of ‘backwardness’ and ‘inadequacy of representation’ in\npublic employment. Backwardness has to be based on objective factors,\nwhereas inadequacy has to factually exist. This is where judicial review\ncomes in. However, whether reservation in a given case is desirable or not,\nis not for the court to decide as long as the parameters mentioned in Articles\n16(4) and 16(4A) are maintained. THe court has to uphold the exercise of\nthe enabling power that provides for reservation.\n\nAs stated above, equity, justice, merit and efficiency contemplated in\nArticle 335 are variables which can only be identified and measured by the\nstate. Therefore, in each case a contextual case has to be made out,\ndepending upon different circumstances, which may exist state-wise.\n\nThe court, in upholding the validity of the impugned amendments, held\nthat they did not alter the structure of articles 14, 15 and 16. The parameters\nmentioned in Article 16(4) have been retained and clause (4A) is derived\nfrom clause (4) of Article 16. Clause (4A) is confined to SCs and STs alone.\nTherefore, the amendments do not change the identity of the Constitution.\nApplying the ‘width test’, and the test of ‘identity’, the court did not find\nany alteration in the existing structure of the equality code. Apart from that,\nnone of the axioms like secularism, federalism etc., which are overarching\nprinciples, had been violated by the impugned constitutional amendments.\n\nThe court concluded that Article 16(4A) and Article 16(4B) fell in the\npattern of Article 16(4) and as long as the parameters mentioned in those\narticles were complied with by the states, the provision of reservation could\nnot be faulted. Articles 16(4A) and 16(4B) are classifications within the\nprinciple of equality under Article 16(4).\n\nThe court also found that the object in enacting enabling provisions like\narticles 16(4), 16(4A) and 16(4B) was that the state was empowered to\nidentify and recognize the compelling interests. If the state had quantifiable\ndata to show backwardness and inadequacy then the state could make\nreservations in promotions keeping in mind the maintenance of efficiency,\nwhich is held to be a constitutional limitation on the discretion of the state\n\nin making reservation as indicated by Article 335. As stated above, the\nconcepts of efficiency, backwardness and inadequacy of representation are\nrequired to be identified and measured. That exercise was to be done by the\nstate, depending on the availability of data.\n\nAfter applying the above tests to the proviso to Article 335 inserted by\nthe 82nd Constitution Amendment Act, the court found that the said proviso\nhad a nexus with articles 16(4A) and 16(4B). Efficiency in administration is\nheld to be a constitutional limitation on the discretion vested in the state to\nprovide for reservation in public employment. Under the proviso to Article\n335, it is stated that nothing in Article 335 shall prevent the state from\nrelaxing qualifying marks or standards of evaluation for reservation in\npromotion. In the court’s view, even after insertion of this proviso, the\nlimitation of overall efficiency in Article 335 was not diluted.\n\nThis is a landmark decision, as it laid down the test for judging the\nvalidity of all future laws that may provide for reservation under Article 16.\nAs a result, no government can implement the amendments and provide\nreservation in promotion, with consequential seniority, without ensuring\nthat the creamy layer among the backward classes is kept out of the\nreservation scheme and the efficiency of administration under Article 335 is\nmaintained.\n\nAlso, all existing and future laws made under Article 16(4), that do not\nidentify the creamy layer, stand the risk of being declared unconstitutional.\nThis comes as a welcome step as governments now will have to produce\nconcrete data showing these required conditions before implementing any\nsuch reservation policy.\n\nIn Indra Sawhney and in M. Nagargj the concept of creamy layer came\nin for a lot of controversy. This concept is not in our Constitution, but\nevolved out of the experience in the implementation of the constitutional\nprinciple of reverse discrimination by way of reservations. The ground\nreality is that, in some cases, the benefits of reservation have been cornered\nby the elite among the backward, giving rise to a new class within the\nbackward class. Therefore, in both Indra Sawhney and M. Nagaraj the apex\ncourt opined that exclusion of those in the creamy layer from the benefits of\nreservation would really serve the constitutional mandate of Article 16(4) of\nthe Constitution.\n\nThe next landmark judgment rendered by the Supreme Court is in\nAshoka Kumar Thakur v. Union of India*? in the following background.\n\nTo give adequate educational opportunities to SEBCs and to SCs and\nSTs by way of admission to unaided educational institutions other than\nminority institutions, Parliament amended Article 15 of the Constitution by\nintroducing Article 15(5) by the 93rd Constitution Amendment Act. That\nbeing an enabling provision, Parliament passed the Central Educational\nInstitution (Reservation on Admission) Act 2006 (Act 5 of 2007) to provide\nfor greater access to higher education and professional education to SCs,\nSTs and OBCs.\n\nThe aforesaid 93rd Constitution Amendment Act and the vires of Act 5\nof 2007 were challenged inter alia on the ground that the 93rd Constitution\nAmendment Act was violative of the basic structure of the Constitution and\nAct 5 of 2007 was ultra vires the Constitution.\n\nRepelling those contentions, the Constitution Bench of the Supreme\nCourt in Ashoka Kumar Thakur, by a majority of 4:1, upheld the\nconstitutional amendment and the act.\n\nDelivering the majority verdict, Chief Justice K.G. Balakrishnan held\nthat the basic structure of the Constitution is to be taken as a larger principle\non which the Constitution itself is framed. If any constitutional amendment\nmoderately abridges or alters the equality principle or the principles under\nArticle 19(1) (g), it cannot be said that it violates the basic structure of the\nConstitution. The majority judgment held that if such a principle were\naccepted, the Constitution would not be able to adapt itself to the changing\nconditions of a dynamic human society.\n\nThe court further held that when a constitutional provision is\ninterpreted, the cardinal rule is to look to the Preamble to the Constitution\nas the guiding star and the directive principles of state policy as the ‘Book\nof Interpretation’. Hence, the 93rd Constitution Amendment Act does not\nviolate the basic structure of the Constitution insofar as it relates to aided\neducational institutions.\n\nThe learned chief justice very clearly opined that reservation is one of\nthe many tools used to preserve the essence of equality so that the\ndisadvantaged groups can be brought to the forefront of civil life. It is the\nduty of the state of promote positive measures to remove barriers of\ninequality. Justices Pasayat and Thakkar, sharing the majority view and\naffirming the verdict in what is commonly known as Cooper’s case*?, held\nthat all fundamental rights are to be read together and classification on the\nbasis of mere caste in the long run has the tendency of inherently becoming\n\npernicious. Therefore, affirmative action is nothing but a crucial component\nof social justice in the constitutional dispensation.\n\nThe Supreme Court further said that minority institutions are a separate\nclass and their rights are protected by other constitutional provisions.\nTherefore, exemption of minority educational institutions from the\napplication of Article 15(5) is consistent with the mandate of Article 30 of\nthe Constitution.\n\nThe court also upheld the constitutional validity of Act 5 of 2007 in\nview of the definition of ‘backward class’ and held that the identification of\nbackward class cannot be done solely based on caste. Other parameters are\nfollowed in identifying the backward class.\n\nThe court held that a social class is a homogeneous unit, from the point\nof view of status and mutual recognition, whereas a caste is a homogeneous\nunit from the point of view of common ancestry, religious rites and strict\norganizational control. Thus, the manner in which caste is structured, both\nin the organizational and biological sense, makes it different from social\nclass.\n\nThe chief justice, speaking for the majority, further held that both the\nconcept of social justice echoed in the Preamble and the object of directive\nprinciples had been secured by including Article 15(5) as a fundamental\nright in Part III of the Constitution. The chief justice further clarified that\nthe distinction between fundamental rights and directive principles had\nvirtually reached a vanishing point. The fundamental rights, the learned\nchief justice held, represented civil and political rights and the directive\nprinciples embodied social and economic rights. Merely because the\ndirective principles are non-justiciable does not mean that they are\nsubordinate.“\n\nThe Supreme Court further opined that the creamy layer was to be\nexcluded from SEBCs. Identification of SEBCs would not be complete\nwithout the exclusion of the creamy layer and such identification might not\nbe valid under Article 15(1) of the Constitution. Determination of backward\nclasses could not be exclusively based on caste and the principle of creamy\nlayer had been introduced merely to exclude a section of a particular caste\non the ground that they were economically advanced or educationally\nforward. They were excluded because unless this segment of caste was\nexcluded from that caste group, there could not be proper identification of\nthe backward class. The principle of creamy layer is applied not as a\n\n\ngeneral principle of reservation but for the purpose of identifying the\nsocially and educationally backward classes.*°\n\nThe Supreme Court held that the creamy layer principle was not\napplicable to SCs and STs.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "THE RAREST OF RARE DOCTRINE",
            "chapter_path": "./screenshots-images-2/chapter_8",
            "sections": [
                {
                    "section_name": "Death Penalty and the Evolving Mosaic of Fairness in Penology",
                    "section_path": "./screenshots-images-2/chapter_8/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_8/section_1/bf9272bb-c08d-426b-a1cc-b2a6ab89e765.png",
                        "./screenshots-images-2/chapter_8/section_1/82c965bd-1561-406f-a7f5-1badc668c63b.png",
                        "./screenshots-images-2/chapter_8/section_1/8d75abf1-87f6-4e60-9045-ecf20deaf19d.png",
                        "./screenshots-images-2/chapter_8/section_1/fc40a130-8b58-4c82-bcfb-ecb0e4ce0d69.png",
                        "./screenshots-images-2/chapter_8/section_1/721f0fb9-0da8-40c1-b5fd-cc63afccaa8c.png",
                        "./screenshots-images-2/chapter_8/section_1/975010cd-dad4-406f-81bb-5de68557dc1b.png",
                        "./screenshots-images-2/chapter_8/section_1/643fc39a-b682-4570-8332-4ea136f85617.png",
                        "./screenshots-images-2/chapter_8/section_1/df923124-2ec8-4618-bd7c-eabc7cf8cb5a.png",
                        "./screenshots-images-2/chapter_8/section_1/84b852f6-e1ea-43fc-a5f9-23a5d50a5de4.png",
                        "./screenshots-images-2/chapter_8/section_1/bc0b6121-a8b4-4220-bd02-0ad5bb1b5ad3.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "DESPITE CONTINUING INTERNATIONAL efforts to initiate and implement\npolicies aimed at complete abolition, or at least to impose a partial\nmoratorium on the death penalty, it is still very much enforced in various\ncountries.\n\nThe death penalty has always been an issue around which basic values\nand human rights are continuously discussed, since the age of\nEnlightenment till today. However, the current status of the death penalty\nworldwide indicates that there is still a great need to continue the debate on\nabolishing or retaining the death penalty, from international, normative,\nempirical and comparative angles in order to promote the international\ndiscourse on human rights.\n\nThe Law Commission of India, in an intensive study on the subject of\ndeath penalty, submitted its 35th Report in 1967! to the central government,\nstating that\n\n.. having regard, however, to the conditions in India, to the variety\nof the social upbringing of its inhabitants, to the disparity in the\nlevel of morality and education in the country, to the vastness of its\narea, to [the] diversity of its population and to the paramount need\nfor maintaining law and order of the country in the present juncture,\nIndia cannot risk the experiment of abolition of capital punishment.\n\nIt is clear from the opinion of the Law Commission that its report is not\nvalid for all time to come.\n\nThe statutory provisions for the death penalty under Indian laws are\nfound in several Indian statutes. Several sections of the Indian Penal Code\n(IPC) make provision for the death penalty.” There are other statutes as well\nthat provide for the death penalty.* The most frequently used section in\nawarding the death penalty is, of course, Section 302 of the IPC, a pre-\nconstitutional colonial piece of legislation.\n\nSection 302 falls under Chapter XVI of the IPC, which deals with\noffences affecting the human body. The human body is treated as an\nimpersonal entity and offences against it are treated separately. The law is\ntotally silent on the person against whom the crime is committed and the\nperson committing the crime.\n\nThe concept of personhood, which is the basic postulate and a value\nconsideration under Article 21 of the Constitution, has apparently no\nrelevance under Section 302 of the IPC.\n\nHowever, the validity of the death penalty provision was challenged\nbefore the Hon’ble Supreme Court in the case of Jagmohan Singh v. State of\nUttar Pradesh’ inter alia on the ground that the provision of Section 302 of\nthe IPC conferring absolute discretion on the judge to award the death\npenalty is violative of Article 14 of the Constitution and the same interferes\nwith the right to life of an accused awarded the death penalty. The\nConstitution Bench in Jagmohan rejected those contentions. In doing so the\ncourt considered and relied on the recommendations of the Law\nCommission’s 35th Report.\n\nThe next landmark judgment on the death penalty relating to female\ncriminals came up for consideration in Ediga Anamma v. State of Andhra\nPradesh° wherein Justice Krishna Iyer, speaking for a two-judge bench,\nnoticed the changes in the Criminal Procedure Code 1973 (hereinafter, the\nCode) with the insertion of Section 354(3), which mandates recording of\nthe special reasons for giving the death penalty.\n\nAccording to the learned judge, that provision made life imprisonment\nthe rule and death sentence an exception, in stark contrast to the provision\nof Section 367(5) of the Code of 1898, which required reasons to be\nrecorded as to why the death penalty is not given in a case where the\noffence is punishable by death. Section 367(5) of the old Code was deleted\nby the Amendment Act 26 of 1955.\n\nIn paragraph 21 of Ediga Anamma, Justice Iyer summed up the\nprogressive humanization of penology in India by observing: ‘It is obvious\n\n\nthat the disturbed conscience of the State on the vexed question of legal\nthreat to life by way of death sentence has sought to express itself\nlegislatively, the stream of tendency being towards cautions, partial\nabolition and a retreat from total retention’ .©\n\nAlthough the majority of countries in the world have abolished the\ndeath penalty—about 121 countries, to be precise—the legitimacy of the\ndeath penalty against the background of constitutional values continues to\nbe agitated in India.\n\nDespite the various decisions of the Supreme Court of India to uphold\nthe constitutional validity of capital punishment, the debate must continue\nand cannot be foreclosed on the abstract doctrine of stare decisis\n(determining points in litigation according to precedent). THe very nature\nof the problem is such that it must be the subject of review from time to\ntime in order to be in tune with the evolving standards of decency in a\nmaturing democracy.\n\nThe constitutionality of the death penalty was challenged again in the\ncase of Bachan Singh v. State of Punjab’ wherein it was upheld by a\nmajority of 4:1. The challenge was the result of some legal and\njurisprudential developments. The insertion of Section 354(3) in the Code\nby way of amendment made death penalty an exception. The doctrine of\n‘due process’ propounded in Maneka Gandhi v. Union of India and Ors®\ncompletely changed the connotation of our fundamental rights recognized\nunder articles 14, 19 and 21. The ‘substantive due process’ and the\n‘procedural due process’ principles introduced in Maneka Gandhi\ndemanded that unless a law is just, reasonable and fair in procedure, it\nwould fall foul of the above articles. In Bachan Singh, the majority held that\nafter the interpretation of Article 21 in Maneka Gandhi, it acquired a new\ndimension. Article 21 of the Constitution is couched as follows: ‘No person\nshall be deprived of his life or personal liberty except according to\nprocedure established by law’.\n\nIf this article is expanded in accordance with the interpretative principle\nindicated in Maneka Gandhi, it will read as follows: ‘No person shall be\ndeprived of his life or personal liberty except according to fair, just and\nreasonable procedure established by valid law.’\n\nIn the converse positive form, the expanded article will read thus: ‘A\nperson can only be deprived of his life or personal liberty in accordance\nwith fair, just and reasonable procedure established by valid law.’\n\n\nIn this changed jurisprudential context, the legality of the death penalty\nwas examined in the landmark judgment in Bachan Singh and Justice P.\nBhagwati, in a glowing dissent,!° held that the death penalty is\nunconstitutional.\n\nWe find that apart from the decision in Maneka Gandhi, which\nintroduced the concept of due process in our laws, the Indian government\nalso ratified the International Covenant on Civil and Political Rights\n(ICCPR) and thereby supported the move for progressive abolition of the\ndeath penalty. Also, the Supreme Court in Sunil Batra v. Delhi\nAdministration\", relying on the dictum in Rustom Cavasjee Cooper v.\nUnion of India!? and Maneka Gandhi, held that pre-Constitution laws have\nto be read so as to conform with the constitutional principles. The court also\nsaid that on such an interpretation, Section 302 of the IPC and Section\n354(3) of the Code must be read in the humane light of Parts III & IV of the\nConstitution as illuminated by the preambular values. Relying on these\nprinciples, the court in Bachan Singh explained the requirement of Section\n235(2) of the Code!? for pre-sentence hearing of the accused, read with\nSection 354(3) of the Code,'* which mandates recording of special reasons\nfor imposing the death sentence. The court explained that pre-sentence\nhearing would mean a full-fledged bifurcated hearing, in which further\nevidence could be adduced by the accused, which might not be related to\nthe crime but might be relevant to his socio-economic background. It was\nheld that this would provide a safeguard against the arbitrary imposition of\nthe death penalty and would allow the court to exercise discretion, being\ninformed with reasons based on the evidence on the socio-economic\nbackground of the accused collected in the bifurcated hearing.\n\nThe rationale of introducing Section 354(3) of the Code was considered\nby a Joint Committee of Parliament, after which the committee stated: ‘A\nsentence of death is the extreme penalty of law and it is but fair that when a\ncourt awards that sentence in a case where the alternative sentence of\nimprisonment for life is also available, it should give special reasons in\nsupport of the sentence.’\n\nThe Law Commission of India, in its 48th Report, pointed out the\ndeficiency of the sentencing procedure which led to the enactment of\nSection 354(3). In para 45 of the report, the Law Commission insisted on\nhaving sufficient information on, and background of, the offenders in the\nfollowing words: ‘It is now being increasingly recognized that a rational\n\nand consistent sentencing policy requires the removal of several\ndeficiencies in the present system. One such deficiency is the lack of\ncomprehensive information as to characteristics and background of the\noffender.’®\n\nWhile enacting Section 235(2) of the Code, the aforesaid\nrecommendations of the Law Commission were taken into consideration by\nParliament. About the nature of the hearing under Section 235(2) of the\nCode, the Supreme Court, in a number of judgments, emphasized its\nimportance and relevance in the sentencing procedure.\n\nExplaining the importance of pre-sentence hearing, the Supreme Court\nin Santa Singh v. State of Punjab‘ held that Section 235(2) is in accordance\nwith the modern trends in penology and the same is an effective stage in the\nprocess of administration of justice. The court held that in most countries of\nthe world, intensive study of sociology of crime has shifted the focus from\nthe crime to the criminal, thus widening the objectives of sentencing. It was\npointed out that a proper sentencing discretion calls for consideration of\nboth extenuating and aggravating circumstances, prior criminal record of\nthe criminal, his age, social adjustment, emotional and mental condition, his\nbackground, his education, his personal life and prospects for his\nrehabilitation. The court also held that non-compliance with a proper\nhearing under Section 235(2) is not curable under Section 465 of the Code.\nThe apex court opined that the new dimension in constitutional values must\nbe reflected in penology and sentencing procedure.\n\nChief Justice Chandrachud in Muniappan v. State of Tamil Nadu’’ held\nthat the obligation to hear the accused under Section 235(2) cannot be\ndischarged by just putting a few questions to the accused. There must be a\ngenuine effort to gain a clue to the genesis of the crime by casting aside the\nformalities of the court scene and approaching the question from a broad\nsociological point of view.\n\nIn Allauddin Mian and Ors, Sharif Mian and Anr v. State of Bihar,'® the\nSupreme Court expressed the same view and held that Section 235(2)\nconforms to the principles of natural justice and has a significant bearing on\nthe sentencing procedure. It is a salutary provision and not a matter of mere\nformality. In Rajesh Kumar v. State,!° the Supreme Court held that the\nobject of recording special reasons being intrinsically connected with the\nsentencing procedure, both Sections 235(2) and 354(3) of the Code must be\n\nread together. For effective recording of special reasons, a proper hearing\nhas to be accorded under Section 235(2) of the Code.\n\nImmediately after the decision in Maneka Gandhi, another Constitution\nBench of the Supreme Court rendered its decision in Sunil Batra. The\nConstitution Bench in Sunil Batra, speaking through Justice Krishna Iyer,\nheld: ‘True, our Constitution has no “due process” clause or the Eighth\nAmendment; but, in this branch of law, after Cooper and Maneka Gandhi,\nthe consequence is the same.’”°\n\nThe Eighth Amendment (1791) to the Constitution of the United States\nvirtually emanated from the English Bill of Rights (1689). The text of the\nEighth Amendment reads: ‘Excessive bail shall not be required, nor\nexcessive fines imposed, nor cruel and unusual punishments inflicted.’2+\n\nIn Bachan Singh, the Supreme Court also held that apart from the\naforesaid two procedural safeguards engrafted in Sections 235(2) of and\n354(3) of the Code, there are other statutory safeguards which are provided\nagainst arbitrary imposition of the death penalty. Section 366(1) of the Code\nprovides that no sentence of death shall be executed unless the same is\nconfirmed by the High Court. Sections 367 of the Code further provides\nthat in such confirmation proceedings, the High Court has the power to\ndirect further enquiry and take additional evidence. Section 368 empowers\nthe High Court to confirm the death sentence or pass any sentence\nwarranted by law, or to annul or alter the conviction or order a new trial or\nacquit the accused. Such confirmational proceeding has to be done under\nSection 369 by two judges of the High Court and, in case of difference, the\nmatter has to be referred to a third judge under Section 370 of the Code.\n\nIn Bachan Singh, the Supreme Court catalogued the aggravating and\nmitigating circumstances vide paragraphs 202 and 206 of the report and\nheld that life imprisonment is the rule and death penalty is an exception. It\nfurther made it clear that a real and abiding concern for the dignity of\nhuman life postulates resistance in taking a life through the law’s\ninstrumentality and ruled that it could only be done in the ‘rarest of rare’\ncases when the alternative option was unquestionably foreclosed.\n\nActually, the Supreme Court, by those observations, was showing the\nimportance of the principle of lenity—‘a common law principle that penal\nstatutes should be strictly construed against the government or parties\nseeking to enforce statutory penalties and in favour of the persons on whom\npenalties are sought to be imposed’.2? This principle of lenity encompasses\n\nthe widely held jurisprudential values developed in seventeenth-century\nEngland to thwart the will of legislature bent on seeing the statutory\nviolators hanged and was also developed by the Supreme Court of the\nUnited States of America.”°\n\nBut in the actual application of the said ‘rarest of rare’ doctrine,\nsubsequent smaller benches of the Supreme Court did not follow it\nuniformly. In Machhi Singh and Others v. The State of Punjab,”* the ‘rarest\nof rare’ doctrine was diluted inasmuch as the bench suggested two further\nquestions to be considered before awarding the death sentence. They are:\n\n(1) Is there something uncommon about the crime which renders\nsentence of imprisonment for life inadequate and calls for a\ndeath sentence?\n\n(2) Are the circumstances of the crime such that there is no\nalternative but to impose death sentence, even after according\nmaximum weightage of the mitigating circumstances which\nspeak in favour of the offender?\n\nThe reference to the balancing of aggravating and mitigating circumstances,\nand the questions posted by the judge, appear to show a dilution of the\nBachan Singh guidelines. This is not permissible as the Bachan Singh\ndecision was rendered by a five-judge Constitution Bench and the Machhi\nSingh one by a regular three-judge bench.\n\nFrom the subsequent judgments of the Supreme Court, it became clear\nthat the court was trying to articulate a doctrine of ‘cry for justice’ and of\nsocial necessity, which led to the fading impact of Bachan Singh’s ratio. In\nLok Pal Singh v. The State of Madhya Pradesh,”° a two-judge bench held\nthat once cruel, heinous murder was proved, the death sentence would\nfollow and thus turned the clock back without discussing the rarest of rare\ndoctrine. It held that there was no reason to show leniency. A similar\nattitude of the Supreme Court is discernible in Mahto s/o Ram Narain v.\nState of Madhya Pradesh?°, Darshan Singh v. State of Punjab?’ and in\nseveral other decisions of smaller benches. In Amrik Singh v. The State of\nPunjab,2® the Supreme Court opined that Machhi Singh was retrieving the\nvirtually abolitionist situation created in Bachan Singh.\n\nIn Amrik Singh, a smaller bench of the Supreme Court adversely\ncommented on the decision in Bachan Singh by saying that the unfortunate\n\nresult of the decision in Bachan Singh is that capital punishment is seldom\nemployed, even though it may be a crime against society and the brutality\nof the crime ‘shocks the judicial conscience’. Thus, the Bachan Singh ratio\nwas being slowly diluted by the Supreme Court till it reached its peak when\nthe Supreme Court rendered its decision in Ravji alias Ram Chandra v. The\nState of Rajasthan.?9 In Ravji, a two-judge bench concluded that the court\nwould be failing in its duty if it did not respond to society’s ‘cry for justice’\nagainst the criminal by giving the death sentence.\n\nIt is interesting to note that on 12 December 2006, a two-judge bench of\nthe Supreme Court, in Aloke Nath Dutta and Others v. State of West\nBengal®°, admitted the failure of the court to evolve a uniform sentencing\npolicy in capital cases. The court was critical of the fact that different\ncriteria had been adopted by different benches in awarding the death\nsentence even though the offences were similar in nature. But on the same\nday, in a startling contrast, another two-judge bench of the Supreme Court\nin Bablu alias Mubarak Hussain v. State of Rajasthan*! upheld the death\nsentence without discussing the Bachan Singh principle. This shows the\ndisparity in sentencing standards even at the level of the Supreme Court,\nwhich is very frustrating and virtually makes the awarding of the death\npenalty a ‘lethal lottery’.\n\nIn a rather recent judgment, the Supreme Court, in the case of Santosh\nKumar Satishbhushan Bariyar v. State of Maharashtra,*? pointed out that\nthe Ravji case and six other subsequent judgments which followed it were\ndecided per incuriam, that is, in the exercise of sentencing discretion, it\nfollowed principles that are contrary to the law laid down by the\nConstitution Bench of the Supreme Court in Bachan Singh.\n\nThe Supreme Court made it very clear in Bariyar that in those six\ncases*? it did not consider any mitigating circumstances or a circumstance\nrelating to criminals at the sentencing phase and thus, by judgments\nrendered contrary to law, the death sentence was imposed.\n\nIn a way, the two-judge bench judgment in Bariyar is a landmark\ndecision on sentencing in our laws. In Bariyar, the rarest of rare doctrine\nwas further restricted by an added criterion that it has to be proved by the\nstate that the accused is beyond reform. It has also laid down that post-\nBachan, capital sentencing has come within the fold of constitutional\nadjudication by virtue of the safeguards entrenched in articles 14 and 21 of\nthe Constitution. In Bariyar, the Supreme Court interpreted the rarest of\n\nrare doctrine to say that it has breathed fresh life into ‘special reasons’ in\nSection 354(3) of the Code by imposing a wide-ranging embargo on the\ndeath penalty.\n\nThe court also emphasized that justice must be the first virtue in\nsentencing and the sentencing court must consider itself a ‘forum of\nprinciple’. The sentencing court has to follow ‘principled reasoning’\nflowing from judicial precedent or from legislation and draw power from\nthem.\n\nThe court in Bariyar bemoaned the state of uncertainty in the capital\nsentencing law and held that it thus falls foul of ‘constitutional due process\nand equality’. The court wanted, and rightly so, that judicial discretion only\nbe exercised within defined principles and on the basis of clarity.\n\nA similar view has been expressed in Swamy Shraddananda @ Murali\nManohar Mishra v. The State of Karnataka**, wherein the court lamented\nthat ‘no standards’ can be culled out from the judge-made law which\ngoverns selection of death penalty, apart from the broad guidelines of rarest\nof rare case in Bachan Singh. This has created a total uncertainty in the\nmanner of giving death sentences following the concept of ‘rarest of rare’\ndoctrine. Even though the decision in Bachan Singh has received approval\nfrom the international legal community and has been favourably referred to\nby David Pannick®> and by Roger Hood and Carolyn Hoyle*® in their\ntreatise on the death penalty, this has not been uniformly applied by the\nSupreme Court.\n\nReference in this connection may also be made to the right-based\napproach in exercising discretion in the death penalty, as suggested by\nEdward Fitzgerald,°’ the British barrister. It has been suggested by him that\nthe right approach towards exercising discretion in capital cases is to start\nfrom a strong presumption against death penalty. It is argued that ‘the\npresence of any significant mitigating factor justifies exemption from the\ndeath penalty even in the most gruesome cases’ and Fitzgerald further says:\n\nSuch a restrictive approach can be summarized as follows: The\nnormal sentence should be life imprisonment. The death sentence\nshould only be imposed instead of the life sentence in the ‘rarest of\nrare’ cases where the crime or crimes are of exceptional heinousness\nand the individual has no significant mitigation and is considered\nbeyond reformation.*®\n\nJustice Bhagwati anticipated that the doctrine of rarest of rare cases\nformulated in Bachan Singh*9 would vary from judge to judge depending\nupon the ‘value system, responses and social philosophy of the judges’\nconstituting the benches in the Supreme Court and feared that there would\nbe ‘chaotic arbitrariness in imposition of death sentence’. The learned judge\nagreed with the observation of Justice Krishna Iyer in Rajendra Prasad Etc.\nEtc. v. State of Uttar Pradesh“°, where it was held that various factors ‘play\na part in swinging the pendulum of sentencing justice erratically’. The\napprehensions of both these great judges have come true.\n\nA penalty which is irrevocable and a damage which is beyond repair on\nthe most precious right of a human being—the right to life—cannot be left\nat the present state of uncertainty in which freakish and arbitrary modes of\ndeath sentencing is currently exercised. This has been repeatedly\nacknowledged by the last court in the largest democracy of the world.\n\nThe matter should be examined by the Law Commission of India fully\nand from all angles. In a recent exercise, the Law Commission focused on\nperipheral issues by discussing whether hanging was the most humane way\nof carrying out the death sentence.*! But the matter needs to be addressed in\nmuch greater depth.\n\nTherefore, Parliament cannot ignore such a vital aspect of constitutional\nvalues involving the death penalty. It is urgently required that Parliament\naddress the issue adequately and put the matter on a statutory basis, thereby\nstructuring the sentencing process in the imposition of the death penalty in\naccordance with the constitutional values of human dignity and the right to\nlife. The sooner it is done, the better.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "POWERS OF THE PRESIDENT AND THE\nGOVERNOR TO GRANT PARDON AND\nREMISSION",
            "chapter_path": "./screenshots-images-2/chapter_9",
            "sections": [
                {
                    "section_name": "The Doctrine in Maru Ram and the Conflicting Trend in Swamy\nShraddananda and Subsequent Judgments",
                    "section_path": "./screenshots-images-2/chapter_9/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_9/section_1/2be900d3-f40c-4e51-aeaf-3bff119b4b79.png",
                        "./screenshots-images-2/chapter_9/section_1/90e83a7b-18b0-4ae6-ab47-bcefbe7f0f38.png",
                        "./screenshots-images-2/chapter_9/section_1/9afafc10-176b-4613-8531-fab34a4f2f37.png",
                        "./screenshots-images-2/chapter_9/section_1/828906b8-0aef-47f2-9f38-502fafee5115.png",
                        "./screenshots-images-2/chapter_9/section_1/f9d4a99b-2ec6-45b2-b0e2-a95e27dc47a1.png",
                        "./screenshots-images-2/chapter_9/section_1/ca135b9f-30a9-41e9-bc2b-4fe4b8fa5165.png",
                        "./screenshots-images-2/chapter_9/section_1/01be66d9-7bb1-485e-87d6-242331decc40.png",
                        "./screenshots-images-2/chapter_9/section_1/e510cb84-3152-4ecb-b6dc-f598b508d086.png",
                        "./screenshots-images-2/chapter_9/section_1/74bfde09-7e1d-4f8b-8b61-6ce36c91aec7.png",
                        "./screenshots-images-2/chapter_9/section_1/e967742a-c186-4fc7-977c-7421294d2599.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "THE PROVISION OF the Constitution under Article 72 empowers the president\nto grant pardons, reprieves, respites or remission of punishment, or to\nsuspend or commute the sentence of any person convicted of any offence in\nall cases where punishment or sentence is by a court martial. It is also\napplicable in all cases where the punishment or sentence is for an offence\nagainst any law to which the executive power of the Union of India extends;\nand in all cases where the sentence is one of death. Similar provisions have\nbeen made to enable the governor of a state under Article 161 to grant\npardon, reprieve, etc., but that power is confined only to a matter to which\nthe executive power of a state extends, which obviously includes the power\nto remit or grant pardon in respect of a death sentence.\n\nThe law relating to the exercise of this power by the president of India\nor the governor of a state, which is known as clemency power, and its\nimpact on the sentencing procedure, has given rise to some recent debate in\nview of the conflict of decisions in the Supreme Court. This concerns public\ninterest in very vital areas of crime and punishment.\n\nOne of the leading decisions on the exercise of clemency power was\nrendered by the Constitution Bench of the Supreme Court in Maru Ram Etc.\nEtc. v. Union of India and Another'. Here, the Constitution Bench of the\nSupreme Court construed the provision of the Code of Criminal Procedure\n\n(Amendment Act, 1978) whereby Parliament inserted Section 433A in the\ncode, which makes a full fourteen-year term of imprisonment on a prisoner\nmandatory for two classes of prisoners—those prisoners who are to be\npunished by death and those who are sentenced to death but whose sentence\nwas commuted to life imprisonment under Section 433. As a result of this\namendment, a convict must undergo fourteen years’ imprisonment till his\nrelease is sanctioned under Article 72/161 of the Constitution.\n\nThe Constitution Bench in Maru Ram made it clear that Section 433A\ndoes not affect the pardon power under articles 72 and 161 of the\nConstitution. The Supreme Court opined that in the exercise of its\nconstitutional power under articles 72 and 161, neither the president nor the\ngovernor is to act on his own judgement but should act in accordance with\nthe aid and advice of the council of ministers. Such power cannot be\nexercised arbitrarily since it is an exercise of constitutional power. In the\nexercise of such power, Section 433A itself is to be treated as a guideline.\nJustice Krishna Iyer, in the concluding part of his judgment, speaking for\nthe bench in Maru Ram, made this position very clear by saying:\n\nConsiderations for exercise of power under Articles 72/161 may be\nmyriad and their occasions protean, and are left to the appropriate\nGovernment, but no consideration nor occasion can be wholly\nirrelevant, irrational, discriminatory or mala fide. Only in these rare\ncases will the court examine the exercise.”\n\nThe Supreme Court, in Maru Ram, also felt that for proper exercise of the\npardon power, till rules are framed, Section 433A can be treated as a\nguideline. In most countries where the death penalty is retained, clemency\ncan be sought even when appeal and confirmation proceedings are pending\nand even after a final judgment is pronounced. In the opinion of the Privy\nCouncil in the case of Neville Lewis v. The Attorney General of Jamaica\nand Others? it was held that the exercise of prerogative mercy should, in\nlight of Jamaica’s international obligation, be exercised by procedures that\nwere fair and proper, such as disclosure to the applicant of all materials to\ngo before the review committee and making them amenable to judicial\nreview. The same principles have been virtually accepted in Maru Ram.\nAbout the clemency procedure, the US Supreme Court in Herrera v.\nCollins held that ‘clemency is the historic remedy for preventing\n\nmiscarriages of justice where judicial process has been exhausted—the fail\nsafe in our criminal justice system’*. Across the United States as a whole,\nclemency authorities have stopped some executions and commuted\nsentences on the grounds of lingering doubt.\n\nIn a rather recent judgment, a three-judge bench of the Supreme Court,\nin the case of Swamy Shraddananda@Murali Manohar Mishra v. State of\nKarnataka®, dwelt elaborately on the question of remission of sentences.\nBefore doing so, the Supreme Court referred to its judgment in the case of\nSubash Chander v. Krishan Lal and Ors.° In Krishan Lal, the Supreme\nCourt, on the invitation of the counsel for the accused, sentenced Krishan\nLal, the accused, to imprisonment for the rest of his life and made it clear\nthat Krishan Lal shall not be entitled to any commutation or premature\nrelease under Section 401 of the Code of Criminal Procedure or the\nPrisoner’s Act, Jail Manual, or any other standard or rules made for the\npurpose of granting commutation and remission. Recording this stand, the\ncourt in Shraddananda came to the conclusion that in some cases\nimprisonment for a term of twenty years with further direction that the\nconvict must not be released from the prison for the rest of his life, or\nbefore actually serving out the term fixed by the court means imprisonment\nfor the rest of the life of the prisoner and a convict undergoing such\nextended term of imprisonment has no right to claim remission.\n\nIt was argued before the Supreme Court in Shraddananda that it is not\nopen to the court to direct the appropriate government not to consider a case\nfor the grant of remission of sentence. It was also contended that giving the\npunishment for an offence is a judicial function, but the execution of the\npunishment passes into the hands of the executive and the court cannot\ncontrol the execution of sentences.\n\nHowever, the court, repelling those contentions, came to a very\ninnovative conclusion after considering the unsound way in which\nremission is allowed in cases of life sentence. The court opined that a strong\ncase should be made out for creating a special category for the punishment\nfor life in excess of a period of fourteen years and put that category beyond\nthe application of remission.’ The court found that in cases when an\nappellant comes before the Supreme Court challenging the death sentence\nawarded by the High Court, and the Supreme Court finds that the case falls\nshort of the ‘rarest of rare’ category and feels reluctant to endorse the death\n\nsentence, then the death sentence should be substituted with such a ‘special\ncategory of punishment’.\n\nWith great respect to the learned judges, this proposition appears legally\nunsustainable.\n\nSection 302 of the IPC runs as follows: Punishment for murder\n—‘Whoever commits murder shall be punished with death or imprisonment\nfor life, and shall also be liable to fine.’ It is clear that the word ‘or’ placed\nbetween these two punishments has to be treated disjunctively, meaning\nthereby that these two punishments fall under two totally different\ncategories, both quantitatively and qualitatively. The concept of substitution\ncan only apply in a situation when there is some degree of equivalence or\nresemblance between the two options.\n\nAccording to the Oxford Advanced Learner’s Dictionary, the word\n‘substitute’ means ‘a person or thing that you use or have instead of the one\nyou normally use or have’. The word ‘substitution’ is very close to the word\n‘similar’, but under Section 302 of the IPC, the two punishments have been\nreferred to as two substantively different punishments, both qualitatively\nand quantitatively, and one cannot be a substitute for the other.\n\nBoth in Bachan Singh® and Maru Ram, the Constitution Benches treated\nthese two sentences as qualitatively different. One can never be a substitute\nfor the other by way of judicial interpretation. Apart from Section 302 of\nthe IPC, the Code of Criminal Procedure also treats them differently by\nmandating in Section 354(3) of the Code that for giving death sentence in a\njudgment special reasons are to be recorded.\n\nSection 53 of the IPC also treats death penalty differently from life\nimprisonment while grouping punishments. Death penalty and\nimprisonment for life are placed in different classifications:\n\nPunishments.—The punishments to which offenders are liable under\nthe provisions of this Code are—\n\nFirst—Death;\n\nSecondly—Imprisonment for life;?\n\nIt is therefore clear that the death penalty stands at the forefront in the\ncategory of punishment. It is of a different genus and cannot be a substitute\nfor imprisonment for life. They are in two completely separate leagues.\n\nTherefore, the jurisprudential strategy in Shraddananda to earmark a\n‘special category’ of punishment on the premise of substituting death\npenalty with life imprisonment beyond remission militates against deeply\nentrenched values in constitutionalism and penology.\n\nLooked at from another point of view, if death penalty and life\nimprisonment are considered as substituting one another, this seriously\naffects the integrity and clarity in the sentencing structure and will\nunfortunately introduce an element of uncertainty and arbitrariness in\nchoosing over the other without the objective considerations evolved in\nBachan Singh.\n\nThe trend in Shraddananda has been followed subsequently in some\njudgments of the Supreme Court. In Haru Ghosh,'° the Supreme Court\ndirected that the life imprisonment of Haru Ghosh shall not be less than\nthirty-five years of actual jail sentence. Subsequently, in another judgment\nin Sandeep v. State of Uttar Pradesh,'' the Bench, relying on the\nShraddananda principle, directed that Sandeep should serve a minimum of\nthirty years in jail without remission.\n\nHowever, in a subsequent decision in Sangeet and Anr v. State of\nHaryana’ a two-judge bench of the Supreme Court, after considering\nShraddananda, struck a different note, saying: ‘The appropriate government\ncannot be told that it is prohibited from granting remission of a sentence.\nSimilarly a convict cannot be told that he cannot apply for a remission in\nhis sentence, whatever the reason’!3,\n\nIn paragraph 59 of Sangeet, the bench made it clear that a convict does\nnot have the right to get a remission of sentence, although he certainly has\nthe right to have his case considered for the grant of remission. In saying so,\nthe bench rightly relied on the principle laid down in State of Haryana v.\nMahinder Singh\" and State of Haryana v. Jagdish.'°\n\nIn the concluding portion of the judgment, the bench in Sangeet\nsummed up its finding on the question of remission as follows: ‘The grant\nof remissions is statutory. However, to prevent its arbitrary exercise, the\nlegislature has built in some procedural and substantive checks in the\nstatute. These need to be faithfully enforced’.!®\n\nThis seems to be a legally sustainable opinion formulated by the\nSupreme Court on the structure of sentencing.\n\nIf we examine the principle in Shraddananda and other cases that\nfollowed it from a more fundamental standpoint, it also appears seriously\n\n\nflawed.\n\nOne of the non-derogable fundamental rights given to any person under\nour Constitution is protection against ex post facto laws. This common law\nprinciple of great antiquity has been assimilated and summed up in Article\n20(1) in the following words:\n\nProtection in respect of conviction for offences: 1) No person shall\nbe convicted of any offense except for violation of the law in force\nat the time of the commission of the act charged as an offence, nor\nbe subjected to a penalty greater than that which might have been\ninflicted under the law in force at the time of commission of the\noffence.\n\nIt has been held by the Constitution Bench of the Supreme Court in Kerdar\nNath Bajoria and Anr v. State of West Bengal*’ that the prohibition under\nArticle 20(1) will operate not only against the passing of any retroactive\nlaw but also against punishment under such law.\n\nIn cases relating to murder, the relevant law of punishment, Section 302\nof the IPC, has remained the same. It provides for two different kinds of\npunishment—death penalty or imprisonment for life with fine. THey are not\nsubstitutes.\n\nIn all these cases, namely in Shraddananda, Haru Ghosh and Sandeep,\nthe Supreme Court dealt with appeals filed by appellants against the orders\nof the High Court imposing the death penalty. In each of these cases, the\nlearned judges of the Supreme Court found that the death penalty could not\nbe awarded as the facts and circumstances did not bring the cases of the\nappellants within the category of ‘rarest of rare’ case. The Hon’ble Supreme\nCourt did not approve of the death penalty. Instead, the court did not merely\naward imprisonment for life; rather, it awarded a ‘special category’ of\npunishment evolved in Shraddananda and fixed a specified period of life\nimprisonment, either for the rest of life of the appellant, or for thirty years\nor thirty-five years, with a mandate that there would be no remission of the\nsentence. The obvious question is this: can the sentencing court, ignoring\nthe statutory provision and the fundamental guarantee in the Bill of Rights\n(Articles 20[1] and 21 of the Constitution) which corresponds with the\nstatute, evolve a new sentencing structure in the name of a special category\nof sentence? The answer seems to be decidedly in the negative.\n\n\nThe guarantee of fundamental rights, a non-derogable right, recognized\nunder Article 20(1) of the Constitution of these appellants, is thus violated.\nIt is clear that life imprisonment includes the prospect of remission, as is\nevident from the wordings of Section 55 of the IPC and also sections 432,\n433 and 433-A of the Code of Criminal Procedure.\n\nTherefore, a prayer for grant of remission of life sentence by a convict\nis certainly provided in the procedure established under law. In view of\nArticle 21 of the Constitution, the appellants in those cases are entitled to\navail of the same.\n\nTherefore, the guarantee of Article 20(1), read with Article 21 of the\nConstitution, stands violated by this exercise of judicial discretion. The\nprocedure of remission is one established under law and the penalty of life\nimprisonment of a convict would include all the procedural safeguards in\nthe awarding of such a penalty. A court, in the exercise of its discretion,\ncannot denude a convict of the benefits of statutory safeguards, which are\ncovered within the sweep of ‘procedure established under law’ and are\nprotected under Article 21 of the Constitution, by awarding a special\ncategory of sentence. In view of the decision in Maneka Gandhi v. Union of\nIndia and Others,'® the procedure established under law has been equated\nto due process in our jurisprudence. Therefore, such ‘special category of\nsentence’ violates the due process guarantee of the convicts.\n\nThe guarantees contemplated under articles 20(1) and 21 of the\nConstitution are included within the basic structure of the Constitution and\ncannot be curtailed by law in view of the injunction against it under Article\n13(2) of the Constitution. Such a guarantee cannot be abridged even by a\nconstitutional amendment under Article 368 of the Constitution in view of\nthe majority decision in Kesavananda Bharati, which is now part of our\njurisprudence. The decision in Shraddananda, and the judgments which\nfollowed it, with respect, seem to have bypassed these principles.\n\nIt may be noted that the rights under articles 20(1) and 21 are so basic\nthat they cannot be suspended even during a period of Emergency in view\nof the Constitution (44th Amendment) Act, 1978, whereby it has been\nspecifically stated that during the period when a proclamation of an\nEmergency is in operation, the rights conferred by Part III, except articles\n20 and 21, may cease to operate. These rights are non-derogable rights and\ngiven to every person, whether he or she is a citizen or not, and enjoy the\nstatus of ‘jus cogens’ in international law.\n\nHowever, these rights of the appellants in the aforementioned cases\nhave been apparently breached and taken away by an exercise of judicial\ndiscretion. If the convicts in those cases apply before the president/governor\nunder Articles 72 and 161 of the Constitution, a fair consideration of their\ncase for clemency also stands stultified and impeded in view of the mandate\ngiven by the Supreme Court while giving them life imprisonment. With due\nrespect, this is clearly against the rule of law.\n\nTherefore, this confusion and divergence in the sentencing policy\ncreated by the Supreme Court in Shraddananda and subsequent cases\nshould be re-examined by a larger bench of the Supreme Court. This is a\nmatter of immense public importance from both the constitutional point of\nview and in view of the larger public interest involved in maintaining a\nuniform sentencing structure that is not judge-centric, but is based on\nconstitutional values and rule of law.\n\nIn this connection, it is appropriate to keep in mind what was said by\nJustice Black in Williams v. People of State of New York.'°\n\nA sentencing judge, however, is not confined to the narrow issue of\nguilt. His task, within fixed statutory or constitutional limits, is to\ndetermine the type and extent of punishment after the issue of guilt\nhas been determined. Highly relevant—if not essential—to his\nselection of an appropriate sentence is the possession of the fullest\ninformation possible concerning the defendant’s life and\ncharacteristics. And modern concepts individualizing punishment\nhave made it all the more necessary that a sentencing judge not be\ndenied an opportunity to obtain pertinent information by a\nrequirement of rigid adherence to restrictive rules of evidence\nproperly applicable to the trial.\n\nHowever, some recent judgments of the Supreme Court have considerably\nenlarged the scope of clemency jurisdiction, based on broad principles of\nconstitutionalism.\n\nFirst came the two-judge bench decision of the Supreme Court in\nDevendra Pal Singh Bhullar v. State of NCT, Delhi,?° which was a setback\nto the developing trends of penology. In that decision the court held that\neven though the mercy petition of Bhullar for commutation of death penalty\nto life was kept pending before the president of India for eight years (it\n\nshould have been disposed of in 2005 but instead it was decided upon in\n2011), that is not a ground of commutation in view of the nature of crime\ncommitted by Bhullar.\n\nThe court held that even though there was no undue delay on Bhullar’s\npart, he was, inter alia, an accused under the Terrorist and Disruptive\nActivities (Prevention) Act, 1987. Therefore the court would not judicially\nreview the exercise of mercy by the president, even if there was undue and\nunexplained delay in the disposal of the petition. This was decided on 12\nApril 2013.\n\nWithin a year, precisely on 21 January 2014, came a three-judge bench\njudgment of the Supreme Court in Shatrughan Chauhan and Another v.\nUnion of India and Others,?' overruling the ratio in Bhullar. In Shatrughan\nChauhan, a landmark decision, the court held that the power to pardon is\nneither a matter of grace nor a matter of privilege, but it is a constitutional\nresponsibility reposed by the people on the highest authority? and a limited\njudicial review is permitted over exercise of such power.\n\nThe court held that the right enshrined in Article 21 of the Constitution\ninheres in every prisoner and is available to him ‘till his last breath’, even\nwhen ‘the noose is being tied on the condemned prisoner’s neck’. The court\nalso held that international covenants on human rights, to which India is a\nparty, are parts of our domestic law unless they are contrary to any specific\nlaw in force.73\n\nOn these premises, the court held that where there is undue and\nunexplained delay in the execution of death sentence for the pendency of\nmercy petition before the authority, it is within its right to commute death\nsentence to life.24 The unanimous court, speaking through Chief Justice\nSathasivam, held that this jurisprudence is based on our constitutionalism,\nmeshed with various international covenants of the United Nations. The\ncourt thus held that the ratio in Bhullar (supra) was rendered per incuriam.2°\n\nFollowing the Shatrughan ratio, the court, on a curative petition filed by\nNavneet Kaur,”° wife of Bhullar, commuted Bhullar’s death penalty to life\nimprisonment in a judgment rendered on 31 March 2014.\n\nAnother judgment of far-reaching significance was delivered by the\nConstitution Bench of the Supreme Court in Md Arif@ Ashfaq v. Registrar,\nSupreme Court of India and Ors.’ Delivering the majority opinion, Justice\nRF, Nariman traced, possibly for the first time, the genesis of the principles\n\nin Article 21 from the precepts of Magna Carta of thirteenth-century\nEngland. The learned judge admirably compared the halting odyssey of the\ngreat liberating principles enshrined in both till they reached their bloom.\n\nDiscussing the developing jurisprudence of Article 21, the learned judge\nfound that the ‘wheel has turned full circle’ and ‘substantive due process\nmust be applied to fundamental rights to life and liberty’. He also opined\nthat ‘death sentence cases are a distinct category of cases altogether’\nprimarily for two reasons: (1) irreversibility of death penalty and (2)\ndifferent judicially trained minds arriving at diametrically opposite\nconclusions on the same facts.\n\nThe learned judge noted, and rightly so, that unlike in many countries\nthere is no statutory sentencing policy in India.\n\nConsidering all these factors, Justice Nariman ruled that when a convict,\nwho has been given death sentence, files a review petition, granting an oral\nhearing to him is an integral part of reasonable procedure under Article 21\nof the Constitution.\n\nIt is clear that the irreversible nature of the death sentence weighed so\nheavily on the conscience of the learned judge that His Lordship held that\ndenial of ‘limited oral hearing’ in a review petition to a convict on death\nrow amounts to denial of fairness and falls short of the fair procedure\ncontemplated under Article 21. This is a judgment of great moment, which\nmakes our sentencing procedure compatible with the evolving human rights\nnorms against the death penalty. In formulating his propositions, the learned\njudge took refuge to the profound relevance of Justice Holmes’s\npronouncement that the life of law is not logic, but experience.\n\nConsistent with this judicial thinking, there has been a modification of\nSupreme Court rules in 2013, which mandate that every cause, appeal or\nproceeding, arising out of a death sentence awarded by a High Court, shall\nbe heard by a bench of not less than three judges.\n\nThese are post-Bachan Singh judicially evolved safeguards by the\nSupreme Court to prevent gross miscarriage of justice by freakish infliction\nof death sentence.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "FAST-CHANGING SOCIAL PERSPECTIVE",
            "chapter_path": "./screenshots-images-2/chapter_10",
            "sections": [
                {
                    "section_name": "Creative Jurisprudence by the Supreme Court to Promote Equal\nJustice and Gender Equality",
                    "section_path": "./screenshots-images-2/chapter_10/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_10/section_1/fd8e975e-e660-4196-bc17-5e88cb684e6b.png",
                        "./screenshots-images-2/chapter_10/section_1/36284ca1-b27f-46d5-9ada-588c706adf38.png",
                        "./screenshots-images-2/chapter_10/section_1/50beb36b-646b-493f-a93e-bf148280acb3.png",
                        "./screenshots-images-2/chapter_10/section_1/e464462c-e5b7-4a79-9649-03dc32ba38e2.png",
                        "./screenshots-images-2/chapter_10/section_1/3ba79436-1d89-4537-a20e-3512fa52c2ab.png",
                        "./screenshots-images-2/chapter_10/section_1/ed5c3c1d-3653-4288-9bec-fc24709f08eb.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "THE JUDGMENT OF the Supreme Court in Vishaka v. The State of Rajasthan‘\nby Chief Justice J.S. Verma is a landmark decision and is a benchmark in\nconstitutionalism in more ways than one. First, it very adequately addressed\nan age-old social evil, of harassment of women and female workers in the\nworkplace, against which there was no specific legal protection. Apart from\nstrategizing such protection, this decision also enlivened our jurisprudence\nwith human rights values and highlighted the doctrine that our laws, in the\nabsence of a contrary municipal law, should absorb and assimilate the\nconcerns of the international community expressed through covenants and\ntreaties to march towards a global jurisprudence of shared values.\n\nReading the decision in Vishaka, a discerning reader may remember\nwhat was said by Justice Benjamin Cardozo.”\n\n‘The judge,’ Cardozo wrote, ‘interprets the social conscience, and gives\neffect to it in law, but in so doing he helps to form and modify the\nconscience he interprets. Discovery and creation react upon each other’?.\n\nThe interpretation of social conscience was very meaningfully done in\nVishaka by ensuring the women workers and employees a safe space in\ntheir workplace and by holding that they are, in view of the fundamental\nrights in our Constitution, entitled to it.\n\nA writ petition under Article 32 of the Constitution was filed by social\nactivists and a non-governmental organization (NGO) as a class action\nbefore the Supreme Court, for the enforcement of the rights of working\n\nwomen under articles 14, 19 and 21, in view of the prevailing conditions in\nworkplaces, where violation of these rights was very common. The petition\nwas filed for the realization of gender equality and to prevent sexual\nharassment of working women in workplaces through the ‘judicial process’,\nin the absence of any suitable legislation to prevent such harassment. The\nincident which triggered the filing of the petition was the brutal gang rape\nof a social worker in a village in Rajasthan.\n\nThe Supreme Court found that the violation of working women’s rights,\napart from giving rise to a criminal trial, also violates the provisions of\narticles 14, 15, 19(1)(g) and 21 of the Constitution, and the filing of a\npetition under Article 32, being a fundamental right itself, is a potent\nredressal mechanism.\n\nThe Vishaka judgment made it clear that gender equality and the right to\na safe and secure working place is part of the fundamental rights guaranteed\nby the Constitution and it is the duty of the judiciary to ensure that the state\nenforces these rights. This the judiciary has to ensure as it is a part of the\nconstitutional machinery. It will also to make our jurisprudence compatible\nwith the global jurisprudence on human rights by reading the nation’s\nobligation to comply with international treatises and covenants into our\nlaws.\n\nIn paragraph 14 of the judgment in Vishaka the following principles\nhave been enunciated:\n\nThe meaning and content of the fundamental rights guaranteed in\nthe Constitution of India are of sufficient amplitude to encompass\nall the facets of gender equality including prevention of sexual\nharassment or abuse. Independence of judiciary forms a part of our\nconstitutional scheme. The international conventions and norms are\nto be read into them in the absence of enacted domestic law\noccupying the field when there is no inconsistency between them. It\nis now an accepted rule of judicial construction that regard must be\nhad to international conventions and norms for construing domestic\nlaw when there is no inconsistency between them and there is a void\nin the domestic law.\n\nThe Supreme Court found that there was an absence of a domestic law\nprotecting the rights of women in working places and therefore the court, in\n\nthe exercise of its power under Article 32, gave some guidelines and norms.\nIn so doing it considered the definition of ‘human rights’ under Section 2(d)\nof the Protection of Human Rights Act, 1993.\n\nIn this process, the court took into consideration the objectives of the\njudiciary, which were accepted in the Conference of the Chief Justices of\nAsia and the Pacific at Beijing in 1995. Those objectives are mentioned\nbelow:\n\n(1) To ensure that all persons are able to live securely under the rule of\nlaw.\n\n(2) To promote, within the proper limits of the judicial function, the\nobservance and the attainment of human rights.\n\n(3) To administer the law impartially among persons and between persons\nand the state.\n\nThe court also took into consideration the provisions of the Convention on\nthe Elimination of all Forms of Discrimination against Women (CEDAW).\nThe court also noted that the government ratified those conventions.\n\nAgainst the background of all these facts and the position held in the\ninternational covenants, the court fixed certain guidelines for protecting\nwomen from sexual harassment in the workplace, and directed that those\nguidelines should hold the field till a law was made.\n\nIn terms of the Vishaka judgment, guidelines were formed to protect\nwomen workers from harassment in working places and in various\nuniversities and other places.\n\nA legislation under the name of Sexual Harassment of Women at\nWorkplace (Prevention, Prohibition and Redressal) Bill, 2012, was\nintroduced in Parliament. There was no debate in Parliament when the bill\nwas introduced on 3 September 2012 and the matter was sent before the\nRajya Sabha for approval. Ultimately, it was assented to by the president on\n22 April 2013 and gazetted on 23 April 2013. This is a social welfare\nlegislation of far-reaching consequence, giving protection and the right to\nwork with dignity to women, and is the result of the judicial intervention in\nVishaka.\n\nAgain, in Apparel Export Promotion Council v. A.K. Chopra‘ the\nprinciples laid down in Vishaka were followed in a case of sexual\nharassment of a female employee in her workplace.\n\nA female employee, who was working as a clerk-cum-typist, spurned\nsome repeated sexual overtures by her superior in the office. Ultimately, the\nlady lodged a formal complaint with the management and a regular\ndepartmental proceeding was initiated against the offending male officer.\nThis led to the dismissal of the officer and thereupon several proceedings\nwere taken by the officer to challenge his order of dismissal. On a writ\npetition filed by that officer, a learned judge of the Delhi High Court opined\nthat the officer tried to molest the female employee but had not, in fact,\nactually done so and as such, the dismissal order of that officer was\nquashed. The Division Bench of the Delhi High Court also maintained the\nsame judgment and thereupon a special leave petition (SLP) was filed by\nthe employer. After admitting the said SLP, and overturning the judgment of\nthe Delhi High Court, the Supreme Court gave a landmark decision\nfollowing the principles of Vishaka.\n\nChief Justice Dr Anand, delivering the judgment, held that each incident\nof sexual harassment at the workplace results in violation of the\nfundamental right of gender equality for female employees and is also an\ninvasion of their right to life and liberty. The learned chief justice referred\nto an International Labour Organization (ILO) seminar held in Manila and\nopined that the sexual harassment of female workers at the workplace is\nincompatible with their dignity and honour. He also referred to international\ncovenants of CEDAW and also to the International Covenant on Economic,\nSocial and Cultural Rights. A special reference was made to Article 7 of the\nsaid convention, in para 27 of the judgment. It was made clear that in cases\ninvolving the violation of human rights, the court must be alive to\ninternational instrumentation and covenants and apply the same to a given\ncase where there is no inconsistency between the international norms and\nthe domestic law.\n\nIn a subsequent judgment, in the case of Chairman Railway Board and\nOrs. v. Chandrima Das and Ors,° a very proactive court gave a very\nexpansive definition of ‘life’ by bringing it at par with the interpretation of\n‘life’ in the Universal Declaration of Human Rights, 1948.\n\nIn brief, the facts of the case are as follows: one Bangladeshi national\ncame to Howrah station to catch a train for Ajmer. Being new to the busy\nrailway station, she was misled by some employees of the railways and was\nultimately taken to a room in the Railway Yatri Niwas which had been\nbooked by some railway employees previously. She was raped there by the\n\nrailway employees. Later on she was taken to a rented house by another\nrailway employee and was raped again. In view of the hue and cry raised by\nher, she was rescued by the police. Ms Chandrima Das, a practicing\nadvocate of Calcutta High Court, filed a public interest litigation (PIL),\nasking for compensation for the victim. A Division Bench of Calcutta High\nCourt, after hearing the parties, granted compensation of 10 lakh to be\npaid to the victim by the Union of India, of which the railways is a wing.\n\nChallenging the said judgment, the chairman of the Railway Board\napproached the Supreme Court. Upholding the High Court judgment, the\nSupreme Court laid down that in view of the expanding horizon of Article\n14 read with other articles, every executive action of the government is now\namenable to the scrutiny of the writ jurisdiction of the High Court and the\nSupreme Court in appropriate cases. The Supreme Court held that the writ\njurisdiction of the High Court is wide enough to be extended in the realm of\ntort in the matters of granting compensation to a victim who had suffered\npersonal injuries at the hands of the officers of the government.\n\nThe court held that where public functionaries are involved in matters\nof invasion of fundamental rights or of enforcement of public duties, the\nremedy of compensation by writ is available. A case of rape does not\nmerely violate an ordinary right of a victim but it violates a fundamental\nright to life of the victim and such a right is protected under Article 21 of\nthe Constitution.\n\nIn coming to the said conclusion, the court relied on the judgment of the\nSupreme Court in Bodhisattwa Gautam v. Subhra Chakraborty.° The\nlearned judges held that international covenants and declarations adopted by\nthe United Nations are to be respected by all signatory states and the\nmeaning given to the provisions of those declarations and covenants have to\nbe such that would help in effective implementation of those rights. The\nSupreme Court made a very significant ruling by holding that the Universal\nDeclaration of Human Rights and the principles thereof, if need be, ought to\nbe read into our domestic jurisprudence.”\n\nIn arriving at the said conclusion, the Supreme Court drew support from\nthe dictum of Lord Diplock in Salomon v. Commissioner of Customs and\nExcise® and the opinion of Lord Bridge in the decision of the House of\nLords in Brind v. Secretary of State for the Home Department.° Referring to\nthese decisions, the Supreme Court held that where there is a domestic legal\nprovision which admits of some ambiguity and does not conflict with an\n\ninternational convention, the court should presume that Parliament intends\nto legislate in conformity with the convention and not in conflict with it.1°\n\nProceeding on this basis, in Paragraph 32, the Supreme Court held that\nthe word ‘life’ has been prominently used in the Universal Declaration of\nHuman Rights, 1948 and that the fundamental rights in our Constitution are\nin consonance with the rights in the said declaration and also the rights\nrecognized in the Covenant of Civil and Political Rights and Covenant of\nEconomic, Social and Cultural Rights. In that view of the matter, right to\nlife is considered a basic human right in the Universal Declaration of\nHuman Rights, 1948, and must have the same meaning and interpretation as\nhas been placed by the Supreme Court on ‘life’ in various decisions. The\nmeaning of the word ‘life’ cannot be narrowed down. Thus the Supreme\nCourt, for the first time, interpreted an international covenant through the\nprism of our constitutional jurisprudence. This is a landmark step in\ninternationalizing our laws by fostering the trend of a globalized human\nrights regime of shared values.\n\nThis judgment has great significance as it brings about a fusion between\nour constitutional law and the Universal Declaration of Human Rights,\nwhich is considered the Magna Carta of mankind. In a way, this judgment\nhas taken forward the jurisprudential strategy in Vishaka of reading into our\nconstitutional law the global concepts of human rights, which are\ninseparable and inalienable from the evolving standards of decency in a\nripening democracy.\n",
                    "extracted-code": ""
                }
            ]
        }
    ]
}