{
    "chapters": [
        {
            "chapter_name": "Introduction",
            "chapter_path": "./screenshots-images-2/chapter_1",
            "sections": [
                {
                    "section_name": "Introduction",
                    "section_path": "./screenshots-images-2/chapter_1/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_1/section_1/5957e0b8-3f43-4915-bb70-681ae481d447.png",
                        "./screenshots-images-2/chapter_1/section_1/18ea4aef-1b6b-484d-9645-975a700f06f0.png",
                        "./screenshots-images-2/chapter_1/section_1/be16cab7-f800-43c4-9365-fd1d457d5f5e.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Billions of dollars have been wasted on marketing programs that couldn’t\npossibly work, no matter how clever or brilliant. Or how big the budgets.\n\nMany managers assume that a well-designed, well-executed, well-\nfinanced marketing program will work. It’s not necessarily so. And you\ndon’t have to look further than IBM, General Motors, and Sears, Roebuck\nto find examples.\n\nThe tools and techniques used at Sears, Roebuck might have been right,\nsometimes even spectacular. And the managers who ran the GM programs\nmight have been the best and the brightest. Certainly the best and the\nbrightest people traditionally have been attracted to the biggest and the best\ncompanies, like GM and IBM. But the programs themselves were based on\nassumptions that were flawed.\n\nJohn Kenneth Galbraith, when asked what he believed was America’s\nperception of the country’s giant corporations, said that we feared corporate\npower. Today, we fear corporate incompetence!\n\nAll companies are in trouble. Especially big companies. General Motors\nis a good example. Over the past decade the company paid a terrible price\nfor destroying the identity of its brands. (It priced them alike as well as\nmade them look alike.) Ten share points evaporated, which translates into\nabout $10 billion a year in sales.\n\nGM’S problem wasn’t a competitive problem, although competition did\nincrease. It wasn’t a quality problem either, although GM obviously wasn’t\ndelivering top-notch quality. It was very definitely a marketing problem.\n\nWhen a company makes a mistake today, footprints quickly show up on\nits back as competition runs off with its business. To get the business back,\nthe company has to wait for others to make mistakes and then figure out\nhow to exploit the situation.\n\nSo how do you avoid making mistakes in the first place? The easy\nanswer is to make sure your programs are in tune with the laws of\nmarketing. (Although we have defined our ideas and concepts under the\n“marketing” banner, they are useful no matter where you are in a company,\nand no matter what product or service your company is selling.)\n\nWhat are these marketing laws? And who brought them down from\nMount Sinai on a set of stone tablets?\n\nThe fundamental laws of marketing are those described in this book.\n\nBut who says so? How come two guys from Connecticut have discovered\nwhat thousands of others have overlooked? There are, after all, many\nsophisticated marketing practitioners and academics. Why have they missed\nwhat we think is so obvious?\n\nThe answer is simple. As far as we can tell, almost no one is willing to\nadmit that there are any laws of marketing—certainly none that are\nimmutable.\n\nThere are laws of nature, so why shouldn’t there be laws of marketing?\nYou can build a great-looking airplane, but it’s not going to get off the\nground unless it adheres to the laws of physics, especially the law of\ngravity. You can build an architectural masterpiece on a sand dune, but the\nfirst hurricane will undermine your creation. So it follows that you can\nbuild a brilliant marketing program only to have one of the immutable laws\nknock you flat if you don’t know what they are.\n\nPerhaps it’s human nature not to admit there are things you can’t do.\nCertainly most marketers believe that anything is achievable if you are\nenergetic enough, or creative enough, or determined enough. Especially if\nyou are willing to spend enough money.\n\nOnce you open your mind to the possibility that there are laws of\nmarketing, it’s easy to see what they are. In truth, they are obvious.\n\nWe have been studying what works in marketing and what doesn’t for\nmore than 25 years. What we have found is that programs that work are\nalmost always in tune with some fundamental force in the marketplace.\n\nIn our books, articles, speeches, and videos we have analyzed marketing\nprinciples in some detail. We have developed strategic models of the\nmarketing process, including a physical model of the human mind, which\nwe helped popularize under the concept of “positioning.” We also\ndeveloped a military model of the marketplace, which assigns companies\n\nand brands to either defensive, offensive, flanking, or guerrilla modes of\nmarketing warfare.\n\nAfter years of working on marketing principles and problems, we have\ndistilled our findings into the basic laws that govern success and failure in\nthe marketplace.\n\nWe call these principles the Immutable Laws of Marketing, and there are\n22 of them. Violate them at your own risk.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Leadership",
            "chapter_path": "./screenshots-images-2/chapter_2",
            "sections": [
                {
                    "section_name": "It’s better to be first than it is to be better.",
                    "section_path": "./screenshots-images-2/chapter_2/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_2/section_1/a443f342-ca5e-4ffc-92ef-16726d771a6f.png",
                        "./screenshots-images-2/chapter_2/section_1/4a1c7d6c-25ed-4459-9370-27ea6693cea4.png",
                        "./screenshots-images-2/chapter_2/section_1/f1696040-1d16-43af-81e7-a786114e7ef3.png",
                        "./screenshots-images-2/chapter_2/section_1/0eac8b37-6c7b-4f1b-a9c6-cce86dbf1a0d.png",
                        "./screenshots-images-2/chapter_2/section_1/ca816a25-bf79-41cc-9305-ebdbd6ab0d3f.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Many people believe that the basic issue in marketing is convincing\nprospects that you have a better product or service.\n\nNot true. If you have a small market share and you have to do battle with\nlarger, better-financed competitors, then your marketing strategy was\nprobably faulty in the first place. You violated the first law of marketing.\n\nThe basic issue in marketing is creating a category you can be first in. It’s\nthe law of leadership: It’s better to be first than it is to be better. It’s much\neasier to get into the mind first than to try to convince someone you have a\nbetter product than the one that did get there first.\n\nYou can demonstrate the law of leadership by asking yourself two\nquestions:\n\n1) What’s the name of the first person to fly the Atlantic Ocean solo?\nCharles Lindbergh, right?\n\n2) What’s the name of the second person to fly the Atlantic Ocean solo? Not\nso easy to answer, is it?\n\nThe second person to fly the Atlantic Ocean solo was Bert Hinkler. Bert\nwas a better pilot than Charlie—he flew faster, he consumed less fuel. Yet\nwho has ever heard of Bert Hinkler? (He left home and Mrs. Hinkler hasn’t\nheard from him since.)\n\nIn spite of the evident superiority of the Lindbergh approach, most\ncompanies go the Bert Hinkler route. They wait until a market develops.\nThen they jump in with a better product, often with their corporate name\nattached. In today’s competitive environment, a me-too product with a line\nextension name has little hope of becoming a big, profitable brand (chapter\n12: The Law of Line Extension).\n\nThe leading brand in any category is almost always the first brand into\nthe prospect’s mind. Hertz in rent-a-cars. IBM in computers. Coca-Cola in\ncola.\n\nAfter World War II, Heineken was the first imported beer to make a name\nfor itself in America. So four decades later, what is the No. 1 imported\nbeer? The one that tastes the best? Or Heineken? There are 425 brands of\nimported beer sold in America. Surely one of these brands must taste better\nthan Heineken, but does it really matter? Today, Heineken is still the No.1\nimported beer, with 30 percent of the market.\n\nThe first domestic light beer was Miller Lite. So what is the largest-\nselling light beer in America today? The one that tastes the best? Or the one\nthat got into the mind first?\n\nNot every first is going to become successful, however. Timing is an\nissue—your first could be too late. For example, USA Today is the first\nnational newspaper, but it is unlikely to succeed. It has already lost $800\nmillion and has never had a profitable year. In a television era, it may be too\nlate for a national newspaper.\n\nSome firsts are just bad ideas that will never go anywhere. Frosty Paws,\nthe first ice cream for dogs, is unlikely to make it. The dogs love it, but the\nowners are the ones who buy the groceries, and they think that dogs don’t\nneed an ice cream of their own. They should be happy just to lick the plates.\n\nThe law of leadership applies to any product, any brand, any category.\nLet’s say you didn’t know the name of the first college founded in America.\nYou can always make a good guess by substituting leading for first. So\nwhat’s the name of the leading college in America? Most people would\nprobably say Harvard, which is also the name of the first college founded in\nAmerica. (What’s the name of the second college founded in America? The\nCollege of William and Mary, which is only slightly more famous than Bert\nHinkler.)\n\nNo two products are any similar than twins are. Yet twins often complain\nthat the first of the two whom a person meets always remains their favorite,\neven though the person also gets to know the other one.\n\nPeople tend to stick with what they’ve got. If you meet someone a little\nbetter than your wife or husband, it’s really not worth making the switch,\nwhat with attorneys’ fees and dividing up the house and kids.\n\nThe law of leadership also applies to magazines. Which is why Time\nleads Newsweek, People leads Us, and Playboy leads Penthouse. Take TV\nGuide, for example. Back in the early fifties the then-powerful Curtis\nPublishing Company tried to field a television-listings magazine to compete\nwith the fledgling TV Guide. Even though TV Guide had only a minuscule\nhead start, and despite the awesome strength of Curtis, the Curtis\npublication never really got off the ground. TV Guide had preempted the\nfield.\n\nThe law of leadership applies equally as well to hard categories like\nautomobiles and computers as it does to soft categories like colleges and\nbeer. Jeep was first in four-wheel-drive off-the-road vehicles. Acura was\nfirst in luxury Japanese cars. IBM was first in mainframe computers. Sun\nMicrosystems was first in workstations. Jeep, Acura, IBM, and Sun are all\nleading brands.\n\nThe first minivan was introduced by Chrysler. Today Chrysler has 10\npercent of the car market and 50 percent of the minivan market. Is the\nessence of car marketing making better cars or getting into the market first?\n\nThe first desktop laser printer was introduced by a computer company,\nHewlett-Packard. Today the company has 5 percent of the personal\ncomputer market and 45 percent of the laser printer market.\n\nGillette was the first safety razor. Tide was the first laundry detergent.\nHayes was the first computer modem. Leaders all.\n\nOne reason the first brand tends to maintain its leadership is that the\nname often becomes generic. Xerox, the first plain-paper copier, became the\nname for all plain-paper copiers. People will stand in front of a Ricoh or a\nSharp or a Kodak machine and say, “How do I make a Xerox copy?” They\nwill ask for the Kleenex when the box clearly says Scott. They will offer\nyou a Coke when all they have is Pepsi-Cola.\n\nHow many people ask for cellophane tape instead of Scotch tape? Not\nmany. Most people use brand names when they become generic: Band-Aid,\nFiberglas, Formica, Gore-Tex, Jello, Krazy Glue, Q-tips, Saran Wrap,\nVelcro—to name a few. Some people will go to great lengths to turn a brand\nname into a generic. “FedEx this package to the Coast.” If you’re\nintroducing the first brand in a new category, you should always try to\nselect a name that can work generically. (Lawyers advise the opposite, but\nwhat do they know about the laws of marketing?)\n\nNot only does the first brand usually become the leader, but also the sales\norder of follow-up brands often matches the order of their introductions.\nThe best example is ibuprofen. Advil was first, Nuprin was second,\nMedipren was third. That’s exactly the sales order they now enjoy: Advil\nhas 51 percent of the ibuprofen market, Nuprin has 10 percent, and\nMedipren has 1 percent.\n\nThe fourth brand that entered the market was Motrin IB. Even though it\nhas the powerful prescription name for ibuprofen, Motrin’s market share is\nonly 15 percent. (Keep in mind that Advil was introduced with a “Same as\nthe prescription drug Motrin” theme.) And note the generic substitution.\nConsumers use Advil as a generic term. Rarely do they use the word\nibuprofen. Even an M.D. will tell a patient, “Take two Advil and call me in\nthe morning.”\n\nAlso consider Tylenol, the first brand of acetaminophen. Tylenol is so far\nahead of the No. 2 brand that it’s hard to determine who is No. 2.\n\nIf the secret of success is getting into the prospect’s mind first, what\nstrategy are most companies committed to? The better-product strategy. The\nlatest and hottest subject in the business management field is benchmarking.\nTouted as the “ultimate competitive strategy,” benchmarking is the process\nof comparing and evaluating your company’s products against the best in\nthe industry. It’s an essential element in a process often called “total quality\nmanagement.”\n\nUnfortunately, benchmarking doesn’t work. Regardless of reality, people\nperceive the first product into the mind as superior. Marketing is a battle of\nperceptions, not products.\n\nSo what’s the name of the first brand of aspirin? The first brand of\nacetaminophen? The first brand of ibuprofen? (Hint: Substitute leading for\nfirst and you’ll have the answers to these three questions.)\n\nCharles Schwab bills itself as “America’s largest discount broker.” Are\nyou surprised that the Charles Lindbergh of the discount brokerage business\nis Charles Schwab?\n\nNeil Armstrong was the first person to walk on the moon. Who was\nsecond?\n\nRoger Bannister was the first person to run a four-minute mile. Who was\nsecond?\n\nGeorge Washington was the first president of the United States. Who was\nsecond?\n\nThomas’ was the first brand of English muffin. What was second?\n\nGatorade was the first sports drink. What was second?\n\nIf you’re second into the prospect’s mind, are you doomed to languish\nforever with Buzz Aldrin, John Landy, John Adams, some unknown\nEnglish muffin, and some unknown sports drink? Not necessarily.\nFortunately, there are other laws.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of the Category",
            "chapter_path": "./screenshots-images-2/chapter_3",
            "sections": [
                {
                    "section_name": "If you can’t be first in a category, set up a new category you can\nbe first in.",
                    "section_path": "./screenshots-images-2/chapter_3/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_3/section_1/46f0dc6a-a77d-4f86-a364-7b19806d3cba.png",
                        "./screenshots-images-2/chapter_3/section_1/aa6b9a9b-2b89-45af-98e5-4ee658ff4a4b.png",
                        "./screenshots-images-2/chapter_3/section_1/204360bd-1808-4539-884f-f3f76ad5a99b.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "What’s the name of the third person to fly the Atlantic Ocean solo?\n\nIf you didn’t know that Bert Hinkler was the second person to fly the\nAtlantic, you might figure you had no chance at all to know the name of the\nthird person. But you do. It’s Amelia Earhart.\n\nNow, is Amelia known as the third person to fly the Atlantic Ocean solo,\nor as the first woman to do so?\n\nAfter Heineken became a big success, the people at Anheuser-Busch\ncould have said, “We should bring in an imported beer, too.” But they\ndidn’t. Instead they said, “If there’s a market for a high-priced imported\nbeer, maybe there’s a market for a high-priced domestic beer.” And so they\nstarted to promote Michelob, the first high-priced domestic beer, which\ntoday out-sells Heineken two to one. (Actually, Anheuser-Busch also\n\nbrought in an imported beer, Carlsberg, which has a very good reputation in\nEurope. In the United States, however, the me-too Carlsberg never went\nanywhere.)\n\nMiller Lite was the first domestic light. It took an importer five years to\nsay, “If there’s a market for a domestic light beer, maybe there’s a market\nfor an imported light beer.” The result was Amstel Light, which became the\nlargest-selling imported light beer.\n\nIf you didn’t get into the prospect’s mind first, don’t give up hope. Find a\nnew category you can be first in. It’s not as difficult as you might think.\n\nAfter IBM became a big success in computers, everybody and his brother\njumped into the field. Burroughs, Control Data, General Electric,\nHoneywell, NCR, RCA, Sperry. Snow White and the seven dwarfs, they\nwere called.\n\nWhich dwarf grew up to become a worldwide powerhouse, with 126,000\nemployees and sales of $14 billion, a company often dubbed “the second\nlargest computer company in the world”? None of them. The most\nsuccessful computer company of the seventies and eighties, next to IBM,\nwas Digital Equipment Corporation. IBM was first in computers. DEC was\nfirst in minicomputers.\n\nMany other computer companies (and their entrepreneurial owners)\nbecame rich and famous by following a simple principle: If you can’t be\nfirst in a category, set up a new category you can be first in.\n\nTandem was first in fault-tolerant computers and built a $1.9 billion\nbusiness. So Stratus stepped down with the first fault-tolerant\nminicomputer. Today Stratus is a $500 million company.\n\nAre the laws of marketing difficult? No, they are quite simple. Working\nthings out in practice is another matter, however.\n\nCray Research went over the top with the first supercomputer. Today,\nCray is an $800 million company. So Convex put two and two together and\nlaunched the first mini supercomputer. Today, Convex is a $200 million\ncompany.\n\nSometimes you can turn an also-ran into a winner by inventing a new\ncategory. Commodore was just another manufacturer of home personal\ncomputers that wasn’t going anywhere until it positioned the Amiga as the\nfirst multimedia computer. Today the Commodore Amiga is a big success,\nwith more than $500 million worth sold annually.\n\nThere are many different ways to be first. Dell got into the crowded\npersonal computer field by being the first to sell computers by phone.\nToday Dell is a $900 million company.\n\nWhen you launch a new product, the first question to ask yourself is not\n“How is this new product better than the competition?” but “First what?” In\nother words, what category is this new product first in?\n\nCharles Schwab didn’t open a better brokerage firm. He opened the first\ndiscount broker.\n\nLear’s was not the first woman’s magazine. It was the first magazine for\nthe mature woman. (The magazine for the woman who wasn’t bom\nyesterday.)\n\nThis is counter to classic marketing thinking, which is brand oriented:\nHow do I get people to prefer my brand? Forget the brand. Think\ncategories. Prospects are on the defensive when it comes to brands.\nEveryone talks about why their brand is better. But prospects have an open\nmind when it comes to categories. Everyone is interested in what’s new.\nFew people are interested in what’s better.\n\nWhen you’re the first in a new category, promote the category. In\nessence, you have no competition. DEC told its prospects why they ought to\nbuy a minicomputer, not a DEC minicomputer.\n\nIn the early days, Hertz sold rent-a-car service. Coca-Cola sold\nrefreshment. Marketing programs of both companies were more effective\nback then.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of the Mind",
            "chapter_path": "./screenshots-images-2/chapter_4",
            "sections": [
                {
                    "section_name": "It’s better to be first in the mind than it is to be first in the\nmarketplace",
                    "section_path": "./screenshots-images-2/chapter_4/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_4/section_1/bc2cef64-d663-4de7-a333-217b343ef961.png",
                        "./screenshots-images-2/chapter_4/section_1/ad2074a0-91ff-4d3f-a34d-a760f7ba7668.png",
                        "./screenshots-images-2/chapter_4/section_1/1ae8cde5-0c40-40f1-afa1-ab27bb5a5a7d.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "The world’s first personal computer was the MITS Altair 8800.\n\nThe law of leadership would suggest that the MITS Altair 8800 (an\nunfortunate choice of names) ought to be the No. 1 personal computer\nbrand. Unfortunately, the product is no longer with us.\n\nDu Mont invented the first commercial television set. Duryea introduced\nthe first automobile. Hurley introduced the first washing machine. All are\ngone.\n\nIs something wrong with the law of leadership in chapter 1? No, but the\nlaw of the mind modifies it. It’s better to be first in the prospect’s mind than\nfirst in the marketplace. Which, if anything, understates the importance of\nbeing first in the mind. Being first in the mind is everything in marketing.\n\nBeing first in the marketplace is important only to the extent that it allows\nyou to get in the mind first.\n\nFor example, IBM wasn’t first in the marketplace with the mainframe\ncomputer. Remington Rand was first, with UNIVAC. But thanks to a\nmassive marketing effort, IBM got into the mind first and won the computer\nbattle early.\n\nThe law of the mind follows from the law of perception. If marketing is a\nbattle of perception, not product, then the mind takes precedence over the\nmarketplace.\n\nThousands of would-be entrepreneurs are tripped up every year by this\nlaw. Someone has an idea or concept he or she believes will revolutionize\nan industry, as well it may. The problem is getting the idea or concept into\nthe prospect’s mind.\n\nThe conventional solution to the problem is money. That is, the resources\nto design and build product or service organizations plus the resources to\nhold press conferences, attend trade shows, run advertisements, and conduct\ndirect mail programs (chapter 22: The Law of Resources).\n\nUnfortunately, this gives rise to the perception that the answer to all\nmarketing questions is the same: money. Not true. More money is wasted in\nmarketing than in any other human activity (outside of government\nactivities, of course).\n\nYou can’t change a mind once a mind is made up. It’s like going head-to-\nhead against an entrenched enemy, the charge of the Light Brigade at\nBalaclava being history’s most famous example, closely followed by\nPickett’s fiasco at Gettysburg.\n\nWang was first in word processors. But the world passed such machines\nby and went on to computers. Wang, however, wasn’t able to make the\ntransition. In spite of spending millions of dollars promoting its personal\ncomputers and minicomputers, Wang is still perceived as a word processor\ncompany.\n\nXerox was first in copiers and then tried to get into the computer\nbusiness. Twenty-five years and $2 billion later, Xerox is nowhere in\ncomputers.\n\nYou want to change something in a computer? Just type over or delete the\nexisting material. You want to change something in a mind? Forget it. Once\na mind is made up, it rarely, if ever, changes. The single most wasteful thing\nyou can do in marketing is try to change a mind.\n\n“If you want to make a big impression on another person, you cannot\nworm your way into their mind and then slowly build up a favorable\nopinion over a period of time. The mind doesn’t work that way. You have to\nblast your way into the mind.\n\nThe reason you blast instead of worm is that people don’t like to change\ntheir minds. Once they perceive you one way, that’s it. They kind of file you\naway in their minds as a certain kind of person. You cannot become a\ndifferent person in their minds.\n\nOne of the mysteries of marketing is the role of money. One day a few\ndollars can work a major miracle. The next day millions of dollars can’t\nsave a company from going under. When you have an open mind to work\nwith, even a small amount of money can go a long way. Apple got off the\ncomputer ground with $91,000 contributed by Mike Markkula.\n\nApple’s problem in getting into its prospects’ minds was helped by its\nsimple, easy-to-remember name. On the other hand, Apple’s competitors\nhad complicated names that were difficult to remember. In the early days,\nfive personal computers were in position on the launching pad: Apple II,\nCommodore Pet, IMSAI 8080, MITS Altair 8800, and Radio Shack TRS-\n80. Ask yourself, which name is the simplest and easiest to remember?\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Perception",
            "chapter_path": "./screenshots-images-2/chapter_5",
            "sections": [
                {
                    "section_name": "Marketing is not a battle of products, it’s a battle of perception.",
                    "section_path": "./screenshots-images-2/chapter_5/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_5/section_1/bb5ac2f8-a290-4f6e-8d86-cbf861325cf7.png",
                        "./screenshots-images-2/chapter_5/section_1/2e346669-694d-470a-855c-ea74429cc56e.png",
                        "./screenshots-images-2/chapter_5/section_1/5f385e5c-4002-414a-b042-9f94b42d577f.png",
                        "./screenshots-images-2/chapter_5/section_1/2daa36a6-b3ac-4e06-8d91-a382f0f168c3.png",
                        "./screenshots-images-2/chapter_5/section_1/51ca3f6c-458c-49f4-81bb-0a5e92fe2d9e.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Many people think marketing is a battle of products. In the long run, they\nfigure, the best product will win.\n\nMarketing people are preoccupied with doing research and “getting the\nfacts.” They analyze the situation to make sure that truth is on their side.\nThen they sail confidently into the marketing arena, secure in the\nknowledge that they have the best product and that ultimately the best\nproduct will win.\n\nIt’s an illusion. There is no objective reality. There are no facts. There are\nno best products. All that exists in the world of marketing are perceptions in\nthe minds of the customer or prospect. The perception is the reality.\nEverything else is an illusion.\n\nAll truth is relative. Relative to your mind or the mind of another human\nbeing. When you say, “I’m right and the next person is wrong,” all you’re\n\nreally saying is that you’re a better perceiver than someone else.\n\nMost people think they are better perceivers than others. They have a\nsense of personal infallibility. Their perceptions are always more accurate\nthan those of their neighbors or friends. Truth and perception become fused\nin the mind, leaving no difference between the two.\n\nIt’s not easy to see that this is so. To cope with the terrifying reality of\nbeing alone in the universe, people project themselves on the outside world.\nThey “live” in the arena of books, movies, television, newspapers,\nmagazines. They “belong” to clubs, organizations, institutions. These\noutside representations of the world seem more real than the reality inside\ntheir own minds.\n\nPeople cling firmly to the belief that reality is the world outside of the\nmind and that the individual is one small speck on a global spaceship.\nActually it’s the opposite. The only reality you can be sure about is in your\nown perceptions. If the universe exists, it exists inside your own mind and\nthe minds of others. That’s the reality that marketing programs must deal\nwith.\n\nThere may well be oceans, rivers, cities, towns, trees, and houses out\nthere, but there just isn’t any way for us to know these things except\nthrough our own perceptions. Marketing is a manipulation of those\nperceptions.\n\nMost marketing mistakes stem from the assumption that you’re fighting a\nproduct battle rooted in reality. All the laws in this book are derived from\nthe exact opposite point of view.\n\nWhat some marketing people see as the natural laws of marketing are\nbased on a flawed premise that the product is the hero of the marketing\nprogram and that you’ll win or lose based on the merits of the product.\nWhich is why the natural, logical way to market a product is invariably\nwrong.\n\nOnly by studying how perceptions are formed in the mind and focusing\nyour marketing programs on those perceptions can you overcome your\nbasically incorrect marketing instincts.\n\nEach of us (manufacturer, distributor, dealer, prospect, customer) looks at\nthe world through a pair of eyes. If there is objective truth out there, how\nwould we know it? Who would measure it? Who would tell us? It could\nonly be another person looking at the same scene through a different pair of\neye-windows.\n\nTruth is nothing more or less than one expert’s perception. And who is\nthe expert? It’s someone who is perceived to be an expert in the mind of\nsomebody else.\n\nIf truth is so illusive, why is there so much discussion in marketing about\nthe so-called facts? Why are so many marketing decisions based on factual\ncomparisons? Why do so many marketing people assume that truth is on\ntheir side, that their job is to use truth as a weapon to correct the\nmisperceptions that exist in the mind of the prospect?\n\nMarketing people focus on facts because they believe in objective reality.\nIt’s also easy for marketing people to assume that truth is on their side. If\nyou think you need the best product to win a marketing battle, then it’s easy\nto believe you have the best product. All that’s required is a minor\nmodification of your own perceptions.\n\nChanging a prospect’s mind is another matter. Minds of customers or\nprospects are very difficult to change. With a modicum of experience in a\nproduct category, a consumer assumes that he or she is right. A perception\nthat exists in the mind is often interpreted as a universal truth. People are\nseldom, if ever, wrong. At least in their own minds.\n\nIt’s easier to see the power of perception over product when the products\nare separated by some distance. For example, the three largest-selling\nJapanese imported cars in America are Honda, Toyota, and Nissan. Most\nmarketing people think the battle between the three brands is based on\nquality, styling, horsepower, and price. Not true. It’s what people think\nabout a Honda, a Toyota, or a Nissan that determines which brand will win.\nMarketing is a battle of perceptions.\n\nJapanese automobile manufacturers sell the same cars in the United\nStates as they do in Japan. If marketing were a battle of products, you\nwould think the same sales order would hold true for both countries. After\nall, the same quality, the same styling, the same horsepower, and roughly\nthe same prices hold true for Japan as they do for the United States. But in\nJapan, Honda is nowhere near the leader. There, Honda is in third place,\nbehind Toyota and Nissan. Toyota sells more than four times as many\nautomobiles in Japan as Honda does.\n\nSo what’s the difference between Honda in Japan and Honda in the\nUnited States? The products are the same, but the perceptions in customers’\nminds are different.\n\n\nIf you told friends in New York you bought a Honda, they might ask you,\n“What kind of car did you get? a Civic? an Accord? a Prelude?” If you told\nfriends in Tokyo you bought a Honda, they might ask you, “What kind of\nmotorcycle did you buy?” In Japan, Honda got into customers’ minds as a\nmanufacturer of motorcycles, and apparently most people don’t want to buy\na car from a motorcycle company.\n\nHow about an opposite situation? Would Harley-Davidson be successful\nif it launched a Harley-Davidson automobile? You might think it would\ndepend on the car. Quality, styling, horsepower, pricing. You might even\nbelieve the Harley-Davidson reputation for quality would be a plus. We\nthink not. Its perception as a motorcycle company would undermine a\nHarley-Davidson car—no matter how good the product (chapter 12: The\nLaw of Line Extension).\n\nWhy is Campbell’s soup No. 1 in the United States and nowhere in the\nUnited Kingdom? Why is Heinz soup No. 1 in the United Kingdom and a\nfailure in the United States? Marketing is a battle of perceptions, not\nproducts. Marketing is the process of dealing with those perceptions.\n\nSome soft-drink executives believe that marketing is a battle of taste.\nWell, New Coke is No. 1 in taste. (The Coca-Cola Company conducted\n200,000 taste tests that “proved” that New Coke tastes better than Pepsi-\nCola and Pepsi tastes better than their original formula, now called Coca-\nCola Classic.) But who is winning the marketing battle? The drink that\nresearch has proven to taste the best, New Coke, is in third place. The one\nthat research shows tastes the worst, Coca-Cola Classic, is in first place.\n\nYou believe what you want to believe. You taste what you want to taste.\nSoft-drink marketing is a battle of perceptions, not a battle of taste.\n\nWhat makes the battle even more difficult is that customers frequently\nmake buying decisions based on second-hand perceptions. Instead of using\ntheir own perceptions, they base their buying decisions on someone else’s\nperception of reality. This is the “everybody knows” principle.\n\nEverybody knows that the Japanese make higher-quality cars than the\nAmericans do. So people make buying decisions based on the fact that\neverybody knows the Japanese make higher-quality cars. When you ask\nshoppers whether they have had any personal experience with a product,\nmost often they say they haven’t. And, more often than not, their own\nexperience is often twisted to conform to their perceptions.\n\n\nIf you have had a bad experience with a Japanese car, you’ve just been\nunlucky, because everybody knows the Japanese make high-quality cars.\nConversely, if you have had a good experience with an American car,\nyou’ve just been lucky, because everybody knows that American cars are\npoorly made.\n\nEverybody knows there’s a problem with Audi cars. On November 23,\n1986, CBS broadcast a “60 Minutes” segment called “Out of Control.” It\ncalled attention to a number of complaints about Audi’s “unintended\nacceleration.” American sales of Audis fell through the floorboards—from\n60,000 in 1986 to 12,000 in 1991. But have you ever personally had any\nproblems with “unintended acceleration” while test-driving an Audi? It is\nunlikely. Every single automobile expert who has tested the car has failed to\nduplicate the complaint. Yet the perception lingers on.\n\nRecently Audi has been running advertisements comparing its cars to\ncomparable cars made by Mercedes-Benz and BMW. According to the ads,\nGerman automotive experts rated Audi cars ahead of both Mercedes and\nBMW.\n\nDo you believe that? Probably not. Is it true? Does it matter?\n\nMarketing is not a battle of products. It’s a battle of perceptions.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Focus",
            "chapter_path": "./screenshots-images-2/chapter_6",
            "sections": [
                {
                    "section_name": "The most powerful concept in marketing is owning a word in\nthe prospect’s mind.",
                    "section_path": "./screenshots-images-2/chapter_6/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_6/section_1/9c3e0285-eea2-4a29-8642-a0b6d3a0a3f9.png",
                        "./screenshots-images-2/chapter_6/section_1/ccc5d95c-852c-477b-a6e8-b7f183c8d877.png",
                        "./screenshots-images-2/chapter_6/section_1/93c72e77-6f16-4129-b019-53c53b0cf8d1.png",
                        "./screenshots-images-2/chapter_6/section_1/9c6e4999-2aa2-4d4d-861d-9891d6b11f2e.png",
                        "./screenshots-images-2/chapter_6/section_1/58ec14b0-4ea9-4b25-8332-feb353c90eb9.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "A company can become incredibly successful if it can find a way to own\na word in the mind of the prospect. Not a complicated word. Not an\ninvented one. The simple words are best, words taken right out of the\ndictionary.\n\nThis is the law of focus. You “burn” your way into the mind by\nnarrowing the focus to a single word or concept. It’s the ultimate marketing\nsacrifice.\n\nFederal Express was able to put the word overnight into the minds of its\nprospects because it sacrificed its product line and focused on overnight\npackage delivery only.\n\nIn a way, the law of leadership—it’s better to be first than to be better—\nenables the first brand or company to own a word in the mind of the\n\nprospect. But the word the leader owns is so simple that it’s invisible.\n\nThe leader owns the word that stands for the category. For example, IBM\nowns computer. This is another way of saying that the brand becomes a\ngeneric name for the category. “We need an IBM machine.” Is there any\ndoubt that a computer is being requested?\n\nYou can also test the validity of a leadership claim by a word association\ntest. If the given words are computer, copier, chocolate bar, and cola, the\nfour most associated words are IBM, Xerox, Hershey’s, and Coke.\n\nAn astute leader will go one step further to solidify its position. Heinz\nowns the word ketchup. But Heinz went on to isolate the most important\nketchup attribute. “Slowest ketchup in the West” is how the company is\npreempting the thickness attribute. Owning the word slow helps Heinz\nmaintain a 50 percent market share.\n\nIf you’re not a leader, then your word has to have a narrow focus. Even\nmore important, however, your word has to be “available” in your category.\nNo one else can have a lock on it.\n\nYou don’t have to be a linguistic genius to find a winner. Prego went\nagainst leader Ragu in the spaghetti sauce market and captured a 27 percent\nshare with an idea borrowed from Heinz. Prego’s word is thicker.\n\nThe most effective words are simple and benefit oriented. No matter how\ncomplicated the product, no matter how complicated the needs of the\nmarket, it’s always better to focus on one word or benefit rather than two or\nthree or four.\n\nAlso, there’s the halo effect. If you strongly establish one benefit, the\nprospect is likely to give you a lot of other benefits, too. A “thicker”\nspaghetti sauce implies quality, nourishing ingredients, value, and so on. A\n“safer” car implies better design and engineering.\n\nWhether the result of a deliberate program or not, most successful\ncompanies (or brands) are the ones that “own a word” in the mind of the\nprospect. (Some words, like Volkswagen’s fahrvergnugen, are not worth\nowning.) Here are a few examples:\n\nCrest ... cavities\n\nMercedes ... engineering\nBMvV ... driving\n\nVolvo ... safety\n\nDomino’s ... home delivery\n\nPepsi-Cola ... youth\nNordstrom ... service\n\nWords come in different varieties. They can be benefit related (cavity\nprevention), service related (home delivery), audience related (younger\npeople), or sales related (preferred brand).\n\nAlthough we’ve been touting that words stick in the mind, nothing lasts\nforever. There comes a time when a company must change words. It’s not\nan easy task. The recent history of Lotus Development Corporation\ndemonstrates the nature of the problem.\n\nFor a number of years, Lotus has owned the word spreadsheet. Lotus was\nsynonymous with 1-2-3 and spreadsheet. But the world of spreadsheets is\ngetting competitive, and the potential for growth is limited. Like other\ncompanies, Lotus wants to grow. How is the company to get beyond its\nsingle-product business?\n\nThe conventional answer is to expand in all directions, as IBM and\nMicrosoft did. As a matter of fact, Lotus did some conventional line\nextension with the purchase of Ami Pro word processing software and the\nintroduction of a number of new software products. Then Lotus regrouped\nto focus on a new concept called “groupware,” software products for\nnetworked PCs.\n\nLotus was the first software company to develop a successful groupware\nproduct. If things work out, the company will eventually own a second\nword in the minds of its prospects.\n\nUnlike Microsoft, Lotus now has a corporate focus. It won’t happen\novernight, but Lotus could develop a powerful long-term position in the\nsoftware field. What overnight did for Federal Express and safety did for\nVolvo, groupware could do for Lotus Development Corporation.\n\nYou can’t take somebody else’s word. What makes the Lotus strategy\nplausible is that the groupware word is not owned by any other company.\nFurthermore, there is an enormous industry trend toward networked\ncomputers. (More than half of all business computers are connected to a\nnetwork. There’s even a new magazine called Network Computing.) Many\ncompanies see the advantage of owning a single word or concept (often\ncalled “the corporate vision”), but they neglect to be the first to preempt the\nword.\n\nWhat won’t work in marketing is leaving your own word in search of a\nword owned by others. This was the case with Atari, which owned the\nwords video game. But the business turned out to be faddish, so in 1982 it\nsailed off in a new direction. It wanted Atari to mean computers. CEO\nJames Morgan laid it all out: “Atari’s strength as a name also tends to be its\nweakness. It is synonymous with video games. Atari must redefine its\nimage and broaden its business definition to electronic consumer products.”\n\nUnfortunately for Mr. Morgan’s strategy a host of other companies,\nincluding Apple and IBM, owned the word he was after. Atari’s\ndiversification was a disaster. But the real irony was in that another\ncompany arrived in 1986 and took over the concept Atari walked away\nfrom. The company was Nintendo, which today has 75 percent of a\nmultibillion-dollar market. Who knows where Atari is these days?\n\nThe essence of marketing is narrowing the focus. You become stronger\nwhen you reduce the scope of your operations. You can’t stand for\nsomething if you chase after everything.\n\nSome companies accept the need to narrow the focus and try to\naccomplish this strategy in ways that are self-defeating. “We’ll focus on the\nquality end of the market. We won’t get into the low end where the\nemphasis is on price.” The problem is that customers don’t believe you\nunless you restrict your business to high-priced products only, like\nMercedes-Benz or BMW.\n\nGeneral Motors tries to sell quality at all price levels. “Putting quality on\nthe road” is their latest corporate slogan. Every GM product includes the\n“Mark of Excellence.” Guess what they’re doing at Ford? The same thing.\n“Quality is Job 1,” say the Ford ads. Over at Chrysler, Lee Iacocca\nproclaimed, “We don’t want to be the biggest, we just want to be the best.”\n(Does anyone really believe that Iacocca doesn’t want to be the biggest?)\n\nThis is great stuff inside the corporation. Total quality, the path to\ngreatness. It makes a terrific theme at dealer meetings, especially with the\ntrumpet flourishes and the dancers. But outside the corporation, the message\nfalls apart. Does any company proclaim itself as the “unquality”\ncorporation? No, everybody stands for quality. As a result, nobody does.\n\nYou can’t narrow the focus with quality or any other idea that doesn’t\nhave proponents for the opposite point of view. You can’t position yourself\nas an honest politician, because nobody is willing to take the opposite\nposition (although there are plenty of potential candidates). You can,\n\nhowever, position yourself as the pro-business candidate or the pro-labor\ncandidate and be instantly accepted as such because there is support for the\nother side.\n\nWhen you develop your word to focus on, be prepared to fend off the\nlawyers. They want to trademark everything you publish. The trick is to get\nothers to use your word. (To be a leader you have to have followers.) It\nwould be helpful for Lotus to have other companies get into the groupware\nbusiness. It would make the category more important and people would be\neven more impressed with Lotus’s leadership.\n\nOnce you have your word, you have to go out of your way to protect it in\nthe marketplace. The case of BMW illustrates this very well. For years,\nBMW was the ultimate “driving” machine. Then the company decided to\nbroaden its product line and chase Mercedes-Benz with large, 700-series\nsedans. The problem is, how can a living room on wheels be the ultimate\ndriving machine? Not only can you not feel the road, but you’ll also crush\nall the pylons in your driving commercials.\n\nAs a result, things started downhill for BMW. Luckily, it has recently\nintroduced a new small BMW and is emphasizing “driving” once again.\nThe company has regained its focus.\n\nThe law of focus applies to whatever you’re selling, or even whatever\nyou’re unselling. Like drugs, for example. The antidrug crusade on\ntelevision and in magazines suffers from a lack of focus. There is no one\nword driven into the minds of drug users that could begin to unsell the drug\nconcept. Antidrug advertising is all over the map.\n\nYou’d think the antidrug forces (who, after all, are professionals) would\nhave taken a leaf from the amateurs fighting the abortion issue. Both sides\nof the abortion issue have focused on single, powerful words—pro-life and\npro-choice.\n\nThe antidrug forces should do the same—focus on a single powerful\nword. What the campaign ought to do is make drugs what cigarettes are\ntoday, socially unacceptable. One word that could do this is the ultimate\ndown word, loser. Since drug usage causes all kinds of losses (of job,\nfamily, self-esteem, freedom, life), a program that said “Drugs are for\nlosers” could have a very powerful impact, especially on the recreational\nuser, who is more concerned with social status than with getting high.\n\nThe law of focus, a marketing law, could help solve one of society’s\nbiggest problems.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Exclusivity",
            "chapter_path": "./screenshots-images-2/chapter_7",
            "sections": [
                {
                    "section_name": "Two companies cannot own the same word in the prospect’s\n\nmind.",
                    "section_path": "./screenshots-images-2/chapter_7/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_7/section_1/f07bbd25-9351-4013-b9ff-7f6208d02746.png",
                        "./screenshots-images-2/chapter_7/section_1/c1207149-ae60-4b1f-9009-74ce57bcdb95.png",
                        "./screenshots-images-2/chapter_7/section_1/c0fc5e4f-b199-40e9-b57b-8946a2f10f7b.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "When a competitor owns a word or position in the prospect’s mind, it is\nfutile to attempt to own the same word.\n\nAs we mentioned earlier, Volvo owns safety. Many other automobile\ncompanies, including Mercedes-Benz and General Motors, have tried to run\nmarketing campaigns based on safety. Yet no one except Volvo has\nsucceeded in getting into the prospect’s mind with a safety message.\n\nThe Atari story shows the futility of attempting to move in on the home\ncomputer position against well-entrenched competitors. A variation called\ngame computer might have been possible because it would have taken\nadvantage of the perception of Atari as a creator of computer games. But\n\nthat’s about it. The home computer position belonged to Apple,\nCommodore, and others.\n\nDespite the disaster stories, many companies continue to violate the law\nof exclusivity. You can’t change people’s minds once they are made up. In\nfact, what you often do is reinforce your competitor’s position by making its\nconcept more important.\n\nFederal Express has walked away from overnight and is in the middle of\ntrying to take worldwide away from DHL. “Overnight Letter” used to be\nemblazoned on Federal Express envelopes. Today you’ll find “FedEx\nLetter” instead. And its advertising no longer says, “When it absolutely,\npositively has to be there overnight.” Lately the word that has been\nappearing in Federal Express advertising is worldwide.\n\nThis raises the all-important question: Can Federal Express ever own the\nworldwide word? Probably not. Someone else already owns it: DHL\nWorldwide Express. Its concept: Faster to more of the world. To succeed,\nFederal Express must find a way to narrow the focus against DHL. The\ncompany can’t do it by trying to own the same word in the prospect’s mind.\n\nAnother massive marketing effort aimed at someone else’s word can be\nfound in bunny land—to be specific, the pink Energizer bunny that is trying\nto take the “long-lasting” concept away from Duracell. No matter how\nmany bunnies Eveready throws into the fray, Duracell will still be able to\nhang onto the long-lasting word. Duracell got into the mind first and\npreempted the concept. Even the Dura part of the name communicates it.\n\nWhat often leads marketers down this booby-trapped lane is that\nwonderful stuff called research. Armies of researchers are employed, focus\ngroups conducted, questionnaires tabulated—and what comes back in a\nthree-pound report is a wish list of attributes that users want from a product\nor service. So if that’s what people want, that’s what we should give them.\n\nWhat’s the biggest problem people have with batteries? They go dead at\nthe most inconvenient times. So what’s the No. 1 battery attribute? Long-\nlasting, of course. If long-lasting is what people want, that’s what we should\nadvertise. Right? Wrong.\n\nWhat researchers never tell you is that some other company already owns\nthe idea. They would rather encourage clients to mount massive marketing\nprograms. The theory is that if you spend enough money, you can own the\nidea. Right? Wrong.\n\nSome years ago Burger King started down this slippery slope from which\nit has never quite recovered. A market study showed that the most popular\nattribute for fast food was “fast” (no big surprise there). So Burger King did\nwhat most red-blooded marketers do. It turned to its advertising agency and\nsaid, “If the world wants fast, our advertising should tell them we’re fast.”\n\nWhat was overlooked in the research was that McDonald’s was already\nperceived as being the fastest hamburger chain in the country. Fast\nbelonged to McDonald’s. Undaunted by this, Burger King launched its\ncampaign with the slogan “Best food for fast times.” The program quickly\nbecame a disaster very nearly on a par with the one that involved “Herb.”\nThe advertising agency was fired, management was fired, the company was\nsold, and downward momentum was maintained.\n\nMany people have paid the price for violating the law of exclusivity.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of the Ladder",
            "chapter_path": "./screenshots-images-2/chapter_8",
            "sections": [
                {
                    "section_name": "The strategy to use depends on which rung you occupy on the\nladder.",
                    "section_path": "./screenshots-images-2/chapter_8/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_8/section_1/6346e467-bae3-4c95-866b-e7b510f234ce.png",
                        "./screenshots-images-2/chapter_8/section_1/8b02344c-93e3-4fd0-b2ba-64d5edab4345.png",
                        "./screenshots-images-2/chapter_8/section_1/cb8b3e7d-2d7a-4b74-bd59-d3f58253a882.png",
                        "./screenshots-images-2/chapter_8/section_1/10043132-f156-4c5f-a8fa-7d4127f37914.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "While being first into the prospect’s mind ought to be your primary\nmarketing objective, the battle isn’t lost if you fail in this endeavor. There\nare strategies to use for No. 2 and No. 3 brands.\n\nAll products are not created equal. There’s a hierarchy in the mind that\nprospects use in making decisions.\n\nFor each category, there is a product ladder in the mind. On each rung is\na brand name. Take the car rental category. Hertz got into the mind first and\nwound up on the top rung. Avis got in second and National got in third.\n\nYour marketing strategy should depend on how soon you got into the\nmind and consequently which rung of the ladder you occupy. The higher the\nbetter, of course.\n\nTake Avis, for example. For years the company advertised the high\nquality of its rent-a-car service. “Finest in rent-a-cars” was one of its\ncampaigns. The reader looked at the ad and wondered, How could they\nhave the finest rent-a-car service when they’re not on the top rung of my\nladder?\n\nThen Avis did the one thing you have to do to make progress inside the\nmind of the prospect. They acknowledged their position on the ladder. “Avis\nis only No. 2 in rent-a-cars. So why go with us? We try harder.”\n\nFor 13 years in a row, Avis had lost money. Then, when it admitted to\nbeing No. 2, it started to make money, lots of money. Shortly thereafter, the\ncompany was sold to ITT, which promptly ordered up the advertising\ntheme, “Avis is going to be No. 1.”\n\nNo, they’re not, said the prospect. They’re not on the top rung of my\nladder. And to make the point, many picked up the phone and called Hertz.\nThe campaign was a disaster.\n\nMany marketing people have misread the Avis story. They assume the\ncompany was successful because it tried harder (ie., it had the better\nservice). But that wasn’t it at all. Avis was successful because it related\nitself to the position of Hertz in the mind. (If trying harder were the secret\nof success, Harold Stassen would have been president many times over.)\n\nMany marketers make the same mistake as Avis did. Currently, Adelphi\nUniversity in Garden City, Long Island, is comparing itself (favorably) with\nHarvard. Wait a minute, says the high school senior, Adelphi is not on my\ncollege ladder. As you might expect, Adelphi is not very successful in\nattracting the top students.\n\nThe mind is selective. Prospects use their ladders in deciding which\ninformation to accept and which information to reject. In general, a mind\naccepts only new data that is consistent with its product ladder in that\ncategory. Everything else is ignored.\n\nWhen Chrysler compared its cars with Honda, very few people traded in\ntheir Preludes and Accords for Plymouths and Dodges. The headline of one\nChrysler ad said: “Comparing a used Dodge Spirit to a new Honda Accord\nseemed a little ridiculous. Until we saw the results.” According to the ad,\n100 people were asked to compare a Dodge Spirit with 70,000 miles on it to\nanew Honda Accord. The majority (58 out of 100) chose the used Dodge.\n\nRidiculous. (But not necessarily untrue.)\n\nWhat about your product’s ladder in the prospect’s mind? How many\nrungs are there on your ladder? It depends on whether your product is a\nhigh-interest or a low-interest product. Products you use every day\n(cigarettes, cola, beer, toothpaste, cereal) tend to be high-interest products\nwith many rungs on their ladders. Products that are purchased infrequently\n(furniture, lawn mowers, luggage) usually have few rungs on their ladders.\n\nProducts that involve a great deal of personal pride (automobiles,\nwatches, cameras) are also high-interest products with many rungs on their\nladders even though they are purchased infrequently.\n\nProducts that are purchased infrequently and involve an unpleasant\nexperience usually have very few rungs on their ladders. Automobile\nbatteries, tires, and life insurance are three examples.\n\nThe, ultimate product that involves the least amount of pleasure and is\npurchased once in a lifetime has no rungs on its ladder. Ever hear of\nBatesville caskets? Probably not, although the brand has almost 50 percent\nof the market.\n\nThere’s a relationship between market share and your position on the\nladder in the prospect’s mind. You tend to have twice the market share of\nthe brand below you and half the market share of the brand above you.\n\nFor example, Acura was the first Japanese luxury car Lexus was second.\nInfiniti was third. In a recent year, Acura sold 143,708 cars in the United\nStates, Lexus sold 71,206 cars, and Infiniti sold 34,890. The relationship\namong the three brands is almost a mathematically correct 4-2-1. (The\nAcura-Lexus-Infiniti battle is in its early stages, where the cars are new and\nthere’s a lot of interest among the public and the press. In the long run,\nwhen the products are no longer exciting, another phenomenon occurs. See\nthe next chapter: The Law of Duality.)\n\nMarketing people often talk about the “three leading brands” in a\ncategory as if it were a battle of equals. It almost never is. The leader\ninevitably dominates the No. 2 brand and the No. 2 brand inevitably\nsmothers No. 3. In baby food, it’s Gerber, Beech-Nut, and Heinz. In beer,\nit’s Budweiser, Miller, and Coors. In long-distance telephone service it’s\nAT&T, MCI, and Sprint.\n\nWhat’s the maximum number of rungs on a ladder? There seems to be a\ntule of seven in the prospect’s mind. Ask someone to name all the brands he\nor she remembers in a given category. Rarely will anyone name more than\nseven. And that’s for a high-interest category.\n\nAccording to Harvard psychologist Dr. George A. Miller, the average\nhuman mind cannot deal with more than seven units at a time. Which is\nwhy seven is a popular number for lists that have to be remembered. Seven-\ndigit phone numbers, the seven wonders of the world, seven-card stud,\nSnow White and the seven dwarfs, the seven danger signals of cancer.\n\nSometimes your own ladder, or category, is too small. It might be better\nto be a small fish in a big pond than to be a big fish in a small pond. In other\nwords, it’s sometimes better to be No. 3 on a big ladder than No. 1 ona\nsmall ladder.\n\nThe top rung of the lemon-lime soda ladder was occupied by 7-Up.\n(Sprite was on the second rung.) In the soft-drink field, however, the cola\nladder is much bigger than the lemon-lime ladder. (Almost two out of three\nsoft drinks consumed in America are cola drinks.) So 7-Up climbed on the\ncola ladder with a marketing campaign called “The Uncola.”\n\nAs tea is to coffee, 7-Up became the alternative to a cola drink. And 7-Up\nsales climbed to where the brand was the third largest-selling soft drink in\nAmerica.\n\nUnfortunately, in recent years 7-Up lost its grip on third place by\nviolating one of the laws yet to be discussed (chapter 12: The Law of Line\nExtension).\n\nThe ladder is a simple, but powerful, analogy that can help you deal with\nthe critical issues in marketing. Before starting any marketing program, ask\nyourself the following questions: Where are we on the ladder in the\nprospect’s mind? On the top rung? On the second rung? Or maybe we’re\nnot on the ladder at all.\n\nThen make sure your program deals realistically with your position on\nthe ladder. More on how to do this later.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Duality",
            "chapter_path": "./screenshots-images-2/chapter_9",
            "sections": [
                {
                    "section_name": "In the long run, every market becomes a two-horse race.",
                    "section_path": "./screenshots-images-2/chapter_9/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_9/section_1/27abb82a-3dbd-40df-8146-890bc07d29a7.png",
                        "./screenshots-images-2/chapter_9/section_1/8729eb46-df9d-4828-b6ac-b25747838916.png",
                        "./screenshots-images-2/chapter_9/section_1/42ebde98-4c6d-4582-b09c-cb34f259492b.png",
                        "./screenshots-images-2/chapter_9/section_1/7d2be618-272a-4e60-ab4e-d181e4bb3276.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Early on, a new category is a ladder of many rungs. Gradually, the ladder\nbecomes a two-rung affair.\n\nIn batteries, it’s Eveready and Duracell. In photographic film, it’s Kodak\nand Fuji. In rent-a-cars, it’s Hertz and Avis. In mouthwash, it’s Listerine and\nScope. In hamburgers, it’s McDonald’s and Burger King. In sneakers, it’s\nNike and Reebok. In toothpaste, it’s Crest and Colgate.\n\nWhen you take the long view of marketing, you find the battle usually\nwinds up as a titanic struggle between two major players—usually the old\nreliable brand and the upstart.\n\nBack in 1969, there were three major brands of a certain product. The\nleader had about 60 percent of the market, the No. 2 brand had a 25 percent\nshare, and the No. 3 brand had a 6 percent share. The rest of the market\nincluded either private label or minor brands. The law of duality suggests\n\nthat these market shares are unstable. Furthermore, the law predicts that the\nleader will lose market share and No. 2 will gain.\n\nTwenty-two years later, the leader dropped down to 45 percent of the\nmarket. The No. 2 brand has 40 percent, and No. 3 has 3 percent. The\nproducts are Coca-Cola, Pepsi-Cola, and Royal Crown cola, respectively,\nbut the principles apply to brands everywhere.\n\nLook at the three long-distance telephone companies. AT&T has 65\npercent of the market, MCI has 17 percent, and Sprint has 10 percent. Who\nwill win and who will lose in the telephone wars? While the future is\nunknowable (chapter 17: The Law of Unpredictability), a betting person\nwould put his or her money on MCI. MCI has won the battle with Sprint for\nsecond place, so now MCI ought to become the upstart alternative to old,\nreliable AT&T.\n\nSprint is probably feeling very comfortable on the third rung of the\nladder. Nine percent doesn’t sound like much, but it translates to $6 billion\nin annual sales. And the market has been growing rapidly.\n\nFor the long term, however, Sprint is in serious trouble. Look what\nhappened to Royal Crown cola. Back in 1969, the Royal Crown company\nrevitalized its franchise system, 350 bottlers strong, and hired the former\npresident of Rival Pet Foods and a veteran of both Coke and Pepsi. The\ncompany also retained Wells, Rich, Greene, a high-powered New York\nadvertising agency. “We’re out to kill Coke and Pepsi,” declared Mary\nWells Lawrence, the agency’s head, to the Royal Crown bottlers. “I hope\nyou’ ll excuse the word, but we’re really out for the jugular.”\n\nThe only brand that got killed was Royal Crown. In a maturing industry,\nthird place is a difficult position to be in.\n\nTake the domestic automobile industry. In spite of heroic measures\nundertaken by Lee Iacocca, Chrysler is in trouble. In the long run,\nmarketing is a two-car race.\n\nTake video games. In the late eighties, the market was dominated by\nNintendo with a 75 percent share. The two also-rans were Sega and NEC.\nToday Nintendo and Sega are neck and neck, and NEC is way behind. In\nthe long run, marketing is a two-game race.\n\nTime frames, however, can vary. The fast-moving video game market\nplayed itself out in two or three seasons. The long-distance telephone\nmarket might take two or three decades.\n\nTake the airline industry. American Airlines, with 20 percent of the\nmarket, got its nose out in front and will probably wind up as the Coca-Cola\nof the skies. The interesting battle is between Delta and United, tied at 18\npercent apiece. One of these two will take off like Pepsi—the other is\nheaded down with Royal Crown. In the long run, marketing is a two-airline\nrace.\n\nAre these results preordained? Of course not. There are other laws of\nmarketing that can also affect the results. Furthermore, your marketing\nprograms can strongly influence your sales, provided they are in tune with\nthe laws of marketing. When you’re a weak No. 3, like Royal Crown, you\naren’t going to make much progress by going out and attacking the two\nstrong leaders. What they could have done is carved out a profitable niche\nfor themselves (chapter 5: The Law of Focus).\n\nKnowing that marketing is a two-horse race in the long run can help you\nplan strategy in the short run.\n\nIt often happens that there is no clearcut No. 2. What happens next\ndepends upon how skillful the contenders are. Take the laptop computer\nfield. Toshiba is in first place with 21 percent of the market. But there are\nfive companies in second place. Zenith, Compaq, NEC, Tandy, and Sharp\neach have between 8 and 10 percent of the market. It ought to be fun to\nwatch six horses come around a turn where there’s room for only two.\nToshiba and who? Which one will finish second?\n\nWhat’s especially tragic from the economy’s point of view are the\nresources wasted in many high-visibility categories like laptop computers.\nCurrently there are 130 laptop brands on the market. The law of duality will\nsee to it that very few of these brands will be around in the twenty-first\ncentury.\n\nLook at the history of the automobile in the United States. In 1904, 195\ndifferent cars were assembled by 60 companies. Within the following 10\nyears, 531 companies were formed and 346 perished. By 1923, only 108 car\nmakers remained. This number dropped to 44 by 1927. Today, Ford and\nGeneral Motors dominate the domestic industry, with Chrysler’s future in\ndoubt.\n\nSuccessful marketers concentrate on the top two rungs. Jack Welch, the\nlegendary chairman and CEO of General Electric, said recently: “Only\nbusinesses that are No. 1 or No. 2 in their markets could win in the\nincreasingly competitive global arena. Those that could not were fixed,\n\nclosed, or sold.” It’s this kind of thinking that built companies like Procter\n& Gamble into the powerhouses they are. In 32 of its 44 product categories\nin the United States, P&G commands the No. 1 or No. 2 brands.\n\nEarly on, in a developing market, the No. 3 or No. 4 positions look\nattractive. Sales are increasing. New, relatively unsophisticated customers\nare coming into the market. These customers don’t always know which\nbrands are the leaders, so they pick ones that look interesting or attractive.\nQuite often, these turn out to be the No. 3 or No. 4 brands.\n\nAs time goes on, however, these customers get educated. They want the\nleading brand, based on the naive assumption that the leading brand must be\nbetter.\n\nWe repeat: The customer believes that marketing is a battle of products.\nIt’s this kind of thinking that keeps the two brands on top: “They must be\nthe best, they’re the leaders.”\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of the Opposite",
            "chapter_path": "./screenshots-images-2/chapter_10",
            "sections": [
                {
                    "section_name": "If you’re shooting for second place, your strategy is determined\nby the leader.",
                    "section_path": "./screenshots-images-2/chapter_10/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_10/section_1/911fe029-c0d9-4e56-9d32-318515f430fa.png",
                        "./screenshots-images-2/chapter_10/section_1/4df521db-bb1d-48d6-856a-886eeaf305bd.png",
                        "./screenshots-images-2/chapter_10/section_1/8aeb3cf5-c0a9-4a70-8baa-8e5cd54da991.png",
                        "./screenshots-images-2/chapter_10/section_1/0de9516a-cf4a-4b52-8dc9-a711db269205.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "In strength there is weakness. Wherever the leader is strong, there is an\nopportunity for a would-be No. 2 to turn the tables.\n\nMuch like a wrestler uses his opponent’s strength against him, a company\nshould leverage the leader’s strength into a weakness.\n\nIf you want to establish a firm foothold on the second rung of the ladder,\nstudy the firm above you. Where is it strong? And how do you turn that\nstrength into a weakness?\n\n‘You must discover the essence of the leader and then present the prospect\nwith the opposite. (In other words, don’t try to be better, try to be different.)\nIt’s often the upstart versus old reliable.\n\nCoca-Cola is a 100-year-old product. Only seven people in the history of\nthe world have known the Coke formula, which is kept locked in a safe in\nAtlanta. Coca-Cola is the old, established product. However, using the law\nof the opposite, Pepsi-Cola reversed the essence of Coca-Cola to become\nthe choice of a new generation: the Pepsi Generation.\n\nWhen you look at customers in a given product category, there seem to\nbe two kinds of people. There are those who want to buy from the leader\nand there are those who don’t want to buy from the leader. A potential No. 2\nhas to appeal to the latter group.\n\nIn other words, by positioning yourself against the leader, you take\nbusiness away from all the other alternatives to No. 1. If old people drink\nCoke and young people drink Pepsi, there’s nobody left to drink Royal\nCrown cola.\n\nYet, too many potential No. 2 brands try to emulate the leader. This\nusually is an error. You must present yourself as the alternative.\n\nTime built its reputation on colorful writing. So Newsweek turned the idea\naround and focused on a straightforward writing style: “We separate facts\nfrom opinions.” In other words, Newsweek puts its opinions in the editorial\ncolumns, not in the news columns.\n\nSometimes you need to be brutal. Scope, the good-tasting mouthwash,\nhung the “medicine breath” label on its Listerine competition.\n\nBut don’t simply knock the competition. The law of the opposite is a\ntwo-edge sword. It requires honing in on a weakness that your prospect will\nquickly acknowledge. (One whiff of Listerine and you know that your\nmouth would smell like a hospital.) Then quickly twist the sword. (Scope is\nthe good-tasting mouthwash that kills germs.)\n\nAlso in the mouthwash field is an interesting example of the futility of\ntrying to emulate the leader. In 1961, Johnson & Johnson introduced Micrin\nmouthwash, focusing on its “scientific” virtues. Within months Micrin\nbecame the No. 2 brand. But with its germ-fighting approach, Listerine was\nalso a scientific brand. So in 1965, when Procter & Gamble introduced\nScope, it had the “opposite” position to itself. Scope went on to become the\nNo. 2 mouthwash. By 1978, when Johnson & Johnson withdrew the product\nfrom the market, Micrin’s share had fallen to 1 percent.\n\nWhen Beck’s beer arrived in the United States, it had a problem. It\ncouldn’t be the first imported beer (that was Heineken), nor could it be the\nfirst German imported beer (that was Lowenbrau). It solved its problem by\n\nrepositioning Lowenbrau. “You’ve tasted the German beer that’s the most\npopular in America. Now taste the German beer that’s the most popular in\nGermany.”\n\nToday Beck’s is the second largest-selling European beer in America.\n(When it comes to beer, Americans trust German mouths more than they do\ntheir own mouths.) This is a rare example of overturning the law of\nleadership and manipulating perceptions in the mind. (All this is academic\ntoday, since Lowenbrau is now brewed in America.)\n\nAs a product gets old, it often accrues some negative baggage. This is\nespecially true in the medical field. Take aspirin, a product introduced in\n1899. With thousands of medical studies conducted on aspirin, someone\nwas bound to find flaws in the product. Sure enough, they found stomach\nbleeding—just in time for the 1955 launch of Tylenol.\n\nWith all the “stomach bleeding” publicity, Tylenol quickly was able to set\nitself up as the alternative. “For the millions who should not take aspirin,”\nsaid the Tylenol advertising. Today Tylenol outsells aspirin and is the\nlargest-selling single product in American drugstores.\n\nStolichnaya was able to hang the label of “fake Russian vodka” on\nAmerican vodkas such as Smirnoff, Samovar, and Wolfschmidt by simply\npointing out that they come from places like Hartford (Connecticut),\nSchenley (Pennsylvania), and Lawrenceburg (Indiana). Stolichnaya comes\nfrom Leningrad (Russia), making it the real thing.\n\nThere has to be a ring of truth about the negative if it is to be effective.\nOne of the classic examples of hanging a negative on a competitor is an\nadvertisement that Royal Doulton China ran about its main U.S. competitor.\nThe headline said it all: “Royal Doulton, the china of Stoke-on-Trent,\nEngland vs. Lenox, the china of Pomona, New Jersey.” The ad exploited the\nfact that many people thought Lenox was an imported china. By\nrepositioning Lenox where it really belonged, in Pomona, New Jersey,\nRoyal Doulton was able to establish itself as the “real English china.”\nReason: Most people have a hard time imagining craftsmen making fine\nwhite-bone china in a tacky-sounding place like Pomona, New Jersey.\n(When the folks in England saw the ad, they howled with laughter. It turns\nout that Stoke-on-Trent is just as tacky as Pomona.)\n\nMarketing is often a battle for legitimacy. The first brand that captures\nthe concept is often able to portray its competitors as illegitimate\npretenders.\n\nA good No. 2 can’t afford to be timid. When you give up focusing on No.\n1, you make yourself vulnerable not only to the leader but to the rest of the\npack. Take the sad story of Burger King in recent years. Times have been\ndifficult for this No. 2 in hamburgers. It has been through many\nmanagement changes, new owners, and a parade of advertising agencies. It\ndoesn’t take much of a history review to see what went wrong.\n\nBurger King’s most successful years came when it was on the attack. It\nopened with “Have it your way,” which twitted McDonald’s mass-\nmanufacturing approach to hamburgers. Then it hit McDonald’s with\n‘Broiling, not frying” and “The Whopper beats the big Mac.” All these\nprograms reinforced the No. 2, alternative position.\n\nThen, for some unknown reason, Burger King ignored the law of the\nopposite. It got timid and stopped attacking McDonald’s. The world was\nintroduced to “Herb the nerd,” “The best food for fast times,” “We do it the\nway you do it,” “You’ve got to break the rules,” and on and on. It even\nstarted a program to attract little kids, the mainstay of McDonald’s strength.\n\nThis is no way to stay a strong No. 2. Burger King’s sales per unit\ndeclined and have never returned to the level they were when it was on the\nattack.\n\nBurger King made the mistake of not taking the opposite tack.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Division",
            "chapter_path": "./screenshots-images-2/chapter_11",
            "sections": [
                {
                    "section_name": "Over time, a category will divide and become two or more\ncategories.",
                    "section_path": "./screenshots-images-2/chapter_11/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_11/section_1/401bc764-b262-4a4e-be2f-e1d176012b94.png",
                        "./screenshots-images-2/chapter_11/section_1/e8df4f2f-f39a-4ce7-adee-c82c572ae6ba.png",
                        "./screenshots-images-2/chapter_11/section_1/192a6373-eba4-4f87-af0c-d2062ecb078b.png",
                        "./screenshots-images-2/chapter_11/section_1/7c912188-9d0c-4b73-94bd-9c850b48cc05.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Like an amoeba dividing in a petri dish, the marketing arena can be\nviewed as an ever-expanding sea of categories.\n\nA category starts off as a single entity. Computers, for example. But over\ntime, the category breaks up into other segments. Mainframes,\nminicomputers, workstations, personal computers, laptops, notebooks, pen\ncomputers.\n\nLike the computer, the automobile started off as a single category. Three\nbrands (Chevrolet, Ford, and Plymouth) dominated the market. Then the\ncategory divided. Today we have luxury cars, moderately priced cars, and\ninexpensive cars. Full-size, intermediates, and compacts. Sports cars, four-\nwheel-drive vehicles, RVs, and minivans.\n\nIn the television industry, ABC, CBS, and NBC once accounted for 90\npercent of the viewing audience. Now we have network, independent, cable,\npay, and public television, and soon we’ll have instore and interactive\ntelevision.\n\nBeer started the same way. Today we have imported and domestic beer.\nPremium and popular-priced beers. Light, draft, and dry beers. Even\nnonalcoholic beer.\n\nThe law of division even affects countries. (Witness the mess in\nYugoslavia.) In 1776, there were about 35 empires, kingdoms, countries,\nand states in the world. By World War II, the number had doubled. By 1970,\nthere were more than 130 countries. Today, some 190 countries are\ngenerally recognized as sovereign nations.\n\nLook at the music field. It used to be classical and popular music. To stay\non top of the popular music field you could watch “Your Hit Parade,” which\nfeatured the top 10 hits of the week. Radio adopted the same idea with a\n“Top 40” format. Today Top 40 is falling apart because there isn’t one list\nanymore.\n\nBillboard, the bible of the music business, has 11 separate hit lists:\nclassical, contemporary jazz, country, crossover, dance, Latin, jazz, pop,\nrap, rhythm and blues, and rock. And 11 leaders for the 11 categories. They\nrecently included Itzhak Perlman, Four-play, Garth Brooks, Luciano\nPavarotti, Michael Jackson, Mi Mayor Necesidad, Dave Grusin, Enya,\nPublic Enemy, Vanessa Williams, and Bruce Springsteen.\n\nEach segment is a separate, distinct entity. Each segment has its own\nreason for existence. And each segment has its own leader, which is rarely\nthe same as the leader of the original category. IBM is the leader in\nmainframes, DEC in minis, Sun in workstations, and so on.\n\nInstead of understanding this concept of division, many corporate leaders\nhold the naive belief that categories are combining. Synergy and its kissing\ncousin the corporate alliance are the buzzwords in the boardrooms of\nAmerica. IBM, according to the New York Times, is poised “to take\nadvantage of the coming convergence of whole industries, including\ntelevision, music, publishing and computing.”\n\n“IBM’s strongest suit,” says the Times, “in the expected convergence of\ncable and telephone networks with computer and television manufacturers\nmay be technology that it has developed to create extremely high-speed\nnetworks.” (See chapter 20: The Law of Hype.)\n\nIt won’t happen. Categories are dividing, not combining.\n\nAlso look at the much-touted category called “financial services.” In the\nfuture, according to the press, we won’t have banks, insurance companies,\nstockbrokers, or mortgage lenders. We’ll have financial services companies.\nIt hasn’t happened yet.\n\nPrudential, American Express, and others have fallen into the financial\nservices trap. Customers don’t buy financial services. They buy stocks or\nlife insurance or bank accounts. And they prefer to buy each service from a\ndifferent company.\n\nThe way for the leader to maintain its dominance is to address each\nemerging category with a different brand name, as General Motors did in\nthe early days with Chevrolet, Pontiac, Oldsmobile, Buick, and Cadillac\n(and recently with Geo and Saturn).\n\nCompanies make a mistake when they try to take a well-known brand\nname in one category and use the same brand name in another category. A\nclassic example is the fate that befell Volkswagen, the company that\nintroduced the small-car category to America. Its Beetle was a big winner\nthat grabbed 67 percent of the imported-car market in the United States.\n\nVolkswagen was so successful that it began to think it could be like\nGeneral Motors and sell bigger, faster, and sportier cars. So it swept up\nwhatever models it was making in Germany and shipped them all to the\nUnited States. But unlike GM, it used the same brand, Volkswagen, for all\nof its models.\n\n“Different Volks for different folks,” said the advertising, which featured\nfive different models, including the Beetle, the 412 Sedan, the Dasher, the\nThing, and even a station wagon. Needless to say, the only thing that kept\nselling was the “small” thing, the Beetle.\n\nWell, Volkswagen found a way to fix that. It stopped selling the Beetle in\nthe United States and started selling a new family of big, fast, expensive\nVolkswagens. Now you had the Vanagon, the Sirocco, the Jetta, the Golf\nGL, and the Cabriolet. It even built a plant in Pennsylvania to build these\nwondrous new cars.\n\nUnfortunately for Volkswagen, the small-car category continued to\nexpand. And since people couldn’t buy a long-lasting, economical VW, they\nshifted to Toyota, Honda, and Nissan.\n\nToday Volkswagen’s 67 percent share has shrunk to less than 4 percent.\n\nVolkswagen isn’t some minor European brand like Saab or Alfa Romeo.\nVolkswagen is the largest-selling automotive brand in Europe. The cars VW\nsells in the United States are the same as the ones it sells in Europe. Only\nthe minds of the people buying them are different. In America, Volkswagen\nmeans small and ugly. Nobody here wants to buy a big, beautiful\nVolkswagen (chapter 4: The Law of Perception).\n\nOne of Volkswagen’s competitors, Honda, decided to go up-market.\nRather than use the Honda name in the luxury-car market, it introduced the\nAcura. It even took the expensive step of setting up separate Acura\ndealerships to avoid confusion with Honda.\n\nThe Acura became the first Japanese luxury car in the United States,\nwhere today Honda sells many more Acuras than Volkswagen sells\nVolkswagens. Honda now has the leading brand in two categories.\n\nWhat keeps leaders from launching a different brand to cover a new\ncategory is the fear of what will happen to their existing brands. General\nMotors was slow to react to the super premium category that Mercedes-\nBenz and BMW established. One reason was that a new brand on top of\nCadillac would enrage GM’s Cadillac dealers.\n\nEventually, GM tried to take Cadillac up-market with the $54,000\nAllante. It bombed. Why would anyone spend that kind of money on a so-\ncalled Cadillac, since their neighbors would probably think they paid only\n$30,000 or so? No prestige.\n\nA better strategy for General Motors might have been to put a new brand\ninto the Mercedes market. (They might have brought back the classic\nLaSalle.)\n\nTiming is also important. You can be too early to exploit a new category.\nBack in the fifties the Nash Rambler was America’s first small car. But\nAmerican Motors didn’t have either the courage or the money to hang in\nthere long enough for the category to develop.\n\nIt’s better to be early than late. You can’t get into the prospect’s mind first\nunless you’re prepared to spend some time waiting for things to develop.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Perspective",
            "chapter_path": "./screenshots-images-2/chapter_12",
            "sections": [
                {
                    "section_name": "Marketing effects take place over an extended period of time.",
                    "section_path": "./screenshots-images-2/chapter_12/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_12/section_1/4eeca70a-2bd0-48c7-a1f1-0c502db3e9f3.png",
                        "./screenshots-images-2/chapter_12/section_1/a953ce98-64d7-438f-8594-985437f4c103.png",
                        "./screenshots-images-2/chapter_12/section_1/295a223f-4d26-4a4d-9861-aab49a06c028.png",
                        "./screenshots-images-2/chapter_12/section_1/8a2246cf-1d8f-423b-aebc-192a1be2e7ec.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Is alcohol a stimulant or a depressant?\n\nIf you visit almost any bar and grill on a Friday night after work, you’d\nswear that alcohol was a stimulant. The noise and laughter are strong\nevidence of alcohol’s stimulating effects. Yet at 4:00 in the morning, when\nyou see a few happy-hour customers sleeping it off in the streets, you’d\nswear that alcohol is a depressant.\n\nChemically, alcohol is a strong depressant. But in the short term, by\ndepressing a person’s inhibitions, alcohol acts like a stimulant.\n\nMany marketing moves exhibit the same phenomenon. The long-term\neffects are often the exact opposite of the short-term effects.\n\nDoes a sale increase a company’s business or decrease it? Obviously, in\nthe short term, a sale increases business. But there’s more and more\n\nevidence to show that sales decrease business in the long term by educating\ncustomers not to buy at “regular” prices.\n\nAside from the fact that you can buy something for less, what does a sale\nsay to a prospect? It says that your regular prices are too high. After the sale\nis over, customers tend to avoid a store with a “sale” reputation.\n\nTo maintain volume, retail outlets find they have to run almost\ncontinuous sales. It’s not unusual to walk down a retail block and find a\ndozen stores in a row with “Sale” signs in their windows.\n\nHave the automobile rebate programs increased sales? The rise of auto\nrebates have coincided with a decline in auto sales. U.S. vehicle sales have\ndeclined for five straight years in a row.\n\nThe largest furniture company in the New York City area, Seamans, has\nbeen running a sale every week. Recently, Seamans went bankrupt.\n\nThere is no evidence that couponing increases sales in the long run.\nMany companies find they need a quarterly dose of couponing to keep sales\non an even keel. Once they stop couponing, sales drop off.\n\nIn other words, you keep those coupons rolling out not to increase sales\nbut to keep sales from falling off if you stop. Couponing is a drug. You\ncontinue to do it because the withdrawal symptoms are just too painful.\n\nAny sort of couponing, discounts, or sales tends to educate consumers to\nbuy only when they can get a deal. What if a company never started\ncouponing in the first place? In the retail field the big winners are the\ncompanies that practice “everyday low prices”— companies like Wal-Mart\nand K Mart and the rapidly growing warehouse outlets.\n\nYet almost everywhere you look you see yo-yo pricing. The airlines and\nthe supermarkets are two examples. Recently, however, Procter & Gamble\nmade a bold move to establish uniform pricing, which could become the\nstart of a trend.\n\nIn everyday life there are many examples of short-term gains and long-\nterm losses, crime being a typical example. If you rob a bank for $100,000\nand wind up spending 10 years in jail, you either made $100,000 for a day’s\nwork or $10,000 a year for 10 years of labor. It depends on your point of\nview.\n\nInflation can give an economy a short-term jolt, but in the long run,\ninflation leads to recession. (The nuts in Brazil haven’t figured this out yet.)\n\nIn the short term, overeating satisfies the psyche, but in the long run it\ncauses obesity and depression.\n\nIn many other areas of life (spending money, taking drugs, having sex)\nthe long-term effects of your actions are often the opposite’ of the short-\nterm effects. Why then is it so hard to comprehend that marketing effects\ntake place over an extended period of time?\n\nTake line extension. In the short term, line extension invariably increases\nsales. The beer industry clearly illustrates this effect. In the early seventies,\nMiller High Life was barreling along with sales increases averaging 27\npercent a year. Miller’s success was fueled by “Miller Time,” a blue-collar\ncampaign focused on rewarding yourself at the end of the day with a Miller\nbeer. Then Miller got greedy and in 1974 introduced Miller Lite, a brilliant\nconcept (chapter 2: The Law of the Category) buried under a line extended\nname.\n\nIn the short term the two Millers could coexist: the blue-collar beer (High\nLife) and the yuppie beer (Lite). But in the long term, line extension was\nbound to undermine one or the other brand.\n\nThe high-water mark for Miller High Life was 1979, five years after the\nintroduction of Miller Lite. In those five years Miller High Life’s annual\nsales almost tripled, from 8.6 million to 23.6 million barrels. This was the\nshort-term effect of line extension.\n\nThe long-term effect was grim. From a high of 23.6 million barrels in\n1979, Miller High Life declined 13 years in a row to just 5.8 million barrels\nin 1991. And the decline is bound to continue.\n\nNor has Miller Lite been immune to the ravages of line extension. In\n1986, the brewer introduced Miller Genuine Draft. The brand took because\nit was the first beer in a new category. Unfortunately, the brand also carried\nthe Miller name. (See the next chapter: The Law of Line Extension.)\nHistory repeats itself. Five years later, Miller Lite peaked in sales and then\nstarted to decline. Once started, the decline is almost impossible to stop.\n\nUnless you know what to look for, it’s hard to see the effects of line\nextension, especially for managers focused on their next quarterly report. (If\na bullet took five years to reach a target, very few criminals would be\nconvicted of homicide.)\n\nThe same thing that happened to Miller happened to Michelob. Three\nyears after the introduction of Michelob Light, regular Michelob peaked in\nsales and then declined 11 years in a row. Today the four Michelob flavors\ncombined (regular, light, dry, and classic dark) sell 25 percent fewer barrels\nthan Michelob alone did in 1978, the year Michelob Light was introduced.\n\nThe same thing happened to Coors. The introduction of Coors Light\ncaused the collapse of Coors regular, which today sells one-fourth of what it\nused to.\n\nEven the king is down. After annual sales increases stretching back to the\nend of Prohibition, Budweiser has been slipping the last three years in a\nrow. The cause? Bud Light.\n\nYou might be thinking that Miller, Coors, and Anheuser-Busch had to\nline extend because light beer has taken over the market. If you believe\nwhat you read in the papers, you’d think that everyone is drinking light\nbeer. Not true. Today, 18 years after the introduction of Miller Lite, light\nbeer still accounts for only 31 percent of the beer market.\n\nIn other areas of marketing, the short-term/long-term line extension\neffects occur much more rapidly. Coca-Cola clothes were introduced by\nMurjani in 1985. Two years later wholesale volume reached $250 million.\nThe following year, the line dried up virtually overnight, saddling Murjani\nwith millions of dollars’ worth of inventory.\n\nWhat happened to Coca-Cola clothes also happened to Donald Trump. At\nfirst, The Donald was successful. Then he branched out and put his name on\nanything the banks would lend him money for. What’s a Trump? A hotel,\nthree casinos, two condominiums, one airline, one shopping center.\n\nFortune magazine called Trump “an investor with a keen eye for cash\nflow and asset values, a smart marketer, a cunning wheeler-dealer.” Time\nand Newsweek put The Donald on their covers.\n\nToday Trump is $1.4 billion in debt. What made him successful in the\nshort term is exactly what caused him to fail in the long term. Line\nextension.\n\nIt looks easy, but marketing is not a game for amateurs.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Line Extension",
            "chapter_path": "./screenshots-images-2/chapter_13",
            "sections": [
                {
                    "section_name": "There’s an irresistible pressure to extend the equity of a brand.",
                    "section_path": "./screenshots-images-2/chapter_13/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_13/section_1/9d7820a5-3562-4a0d-bae6-d39071fe3b94.png",
                        "./screenshots-images-2/chapter_13/section_1/ebb249f8-881c-4246-9b17-d27dbc0dfdd0.png",
                        "./screenshots-images-2/chapter_13/section_1/80f7f7b0-4fdb-4d19-b0f7-21699885aa46.png",
                        "./screenshots-images-2/chapter_13/section_1/06708cbc-1d4c-4214-9c87-dd26b5903bb2.png",
                        "./screenshots-images-2/chapter_13/section_1/d9974c50-f53f-4e68-924e-f13afe486bf5.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "If violating any of our laws was a punishable offense, a large portion of\ncorporate America would be in jail.\n\nBy far the most violated law in our book is the law of line extension.\nWhat’s even more diabolical is that line extension is a process that takes\nplace continuously, with almost no conscious effort on the part of the\ncorporation. It’s like a closet or a desk drawer that fills up with almost no\neffort on your part.\n\nOne day a company is tightly focused on a single product that is highly\nprofitable. The next day the same company is spread thin over many\nproducts and is losing money.\n\nTake IBM. Years ago when IBM was focused on mainframe computers,\nthe company made a ton of money. Today IBM is into everything and\nbarely breaking even. In 1991, for example, IBM’s revenues were $65\n\nbillion. Yet the company wound up losing $2.8 billion. That’s almost $8\nmillion a day.\n\nIn addition to selling mainframe computers, IBM markets personal\ncomputers, pen computers, workstations, midrange computers, software,\nnetworks, telephones, you name it. IBM even tried to get into the home\ncomputer market with the PCjr.\n\nAlong the way, IBM dropped millions on copiers (sold to Kodak), Rolm\n(sold to Siemens), Satellite Business Systems (shut down), the Prodigy\nnetwork (limping along), SAA, TopView, OfficeVision, and OS/2.\n\nWhen a company becomes incredibly successful, it invariably plants the\nseeds for its future problems. Take Microsoft, the most successful company\nin the software field. (Even though the company is one-fiftieth the size of\nGeneral Motors, Microsoft’s stock is worth more than GM’s.) What is\nMicrosoft’s strategy? In a word, more.\n\n“Microsoft Corp. said it is aggressively seeking the dominant share in\nevery major software applications category in the personal computer field,”\nsaid the Wall Street Journal recently. “Michael Maples, senior vice\npresident of Microsoft’s applications division, suggested that Microsoft\nmight be able to achieve as much as a 70 percent share in every major\napplications category,” continued the Journal.\n\nWhom does that sound like? Sounds like IBM. Microsoft is setting itself\nup as the next IBM, with all the negative implications the name suggests.\n\nMicrosoft is the leader in personal computer operating systems, but it\ntrails the leaders in each of the following major categories: spreadsheets\n(Lotus is the leader), word processing (WordPerfect is the leader), and\nbusiness graphics (Harvard Graphics from SPC Software Publishing is the\nleader).\n\nMicrosoft keeps puffing itself up by expanding into new categories, such\nas pen computers. Recently, Microsoft bought Fox Software for $170\nmillion in order to get into the data base software field. (What do you bet\nthe company kills the Fox and changes it to Microsoft?)\n\nThere are ominous signs of softness in Microsoft’s strategy. The\nEconomist reported in early 1992, “Mr. Gates is putting together a range of\nproducts, based on a common core of technology, that will compete across\nvirtually the whole of the software industry: from big computers to small\nones, and from operating systems in the information engine-room to\ngraphics programs that draw every picture for executives. Nobody in the\n\nsoftware industry has yet managed a venture of that complexity—though\nIBM has tried and failed.”\n\nWhen you try to be all things to all people, you inevitably wind up in\ntrouble. “I’d rather be strong somewhere,” said one manager, “than weak\neverywhere.”\n\nIn a narrow sense, line extension involves taking the brand name of a\nsuccessful product (e.g., A-1 steak sauce) and putting it on a new product\nyou plan to introduce (e.g., A-1 poultry sauce).\n\nIt sounds so logical. “We make A-1, a great sauce that gets the dominant\nshare of the steak business. But people are switching from beef to chicken,\nso let’s introduce a poultry product. And what better name to use than A-1.\nThat way people will know the poultry sauce comes from the makers of that\ngreat steak sauce, A-1.”\n\nBut marketing is a battle of perception, not product. In the mind, A-1 is\nnot the brand name, but the steak sauce itself. “Would you pass me the A-\n1?” asks the diner. Nobody replies: “A-1 what?”\n\nIn spite of an $18 million advertising budget, the A-1 poultry launch was\na dismal failure.\n\nThere are as many ways to line extend as there are galaxies in the\nuniverse. And new ways get invented every day. In the long run and in the\npresence of serious competition, line extensions almost never work.\n\nCreating flavors is a popular way to try to grab market share. More\nflavors, more share. Sounds right, but it doesn’t work.\n\nBack in 1978, when 7-Up was simply the lemon-lime uncola, it had a 5.7\npercent share of the soft-drink market. Then the company added 7-Up Gold,\nCherry 7-Up, and assorted diet versions. Today 7-Up’s share is down to 2.5\npercent.\n\nWherever you look, you’! find line extensions, which is one reason why\nstores are choked with brands. (There are 1,300 shampoos, 200 cereals, 250\nsoft drinks.)\n\nInvariably, the leader in any category is the brand that is not line\nextended. Take baby food, for example. Gerber has 72 percent of the\nmarket, way ahead of Beech-Nut and Heinz, the two line-extended brands.\n\nIn spite of evidence that line extensions don’t work, companies continue\nto pump them out. Here are some examples:\n\nIvory soap. Ivory shampoo?\n\nLife Savers candy. Life Savers gum?\n\nBic lighters. Bic pantyhose?\n\nChanel. Chanel for men?\n\nTanqueray gin. Tanqueray vodka?\n\nCoors beer. Coors water?\n\nHeinz ketchup. Heinz baby food?\n\nUSA Today. “USA Today on TV”?\n\nAdidas running shoes. Adidas cologne?\nPierre Cardin clothing. Pierre Cardin wine?\nLevi’s blue jeans. Levi’s shoes?\n\nColgate-Palmolive: “We want to leverage our basic core brands and trade\non our brand names to extend into new categories.” Ed Fogarty, President.\n\nCampbell Soup Company: “Leveraging and extending high-quality,\nrepeat-purchase brand names is always preferred over launching a new\nname.” David W. Johnson, CEO.\n\nDel Monte: “We’re dedicated to the single brand concept. We’re going to\nkeep extending the Del Monte name into new areas.” Ewan MacDonald,\nPresident.\n\nUltra Slim-Fast: “There will be soups, pastas, salad dressings, soda, fruit\njuices and a new, thicker diet drink called Ultra Slim-Fast Plus.” Daniel\nAbraham, Chairman.\n\n(Good luck and good night, Mr. Abraham.)\n\nWhy does top management believe that line extension works, in spite of\nthe overwhelming evidence to the contrary? One reason is that while line\nextension is a loser in the long term, it can be a winner in the short term\n(chapter 11: The Law of Perspective). Management is also blinded by an\nintense loyalty to the company or brand. Why else would PepsiCo have\nintroduced Crystal Pepsi in spite of the failures of Pepsi Light and Pepsi\nAM?\n\nMore is less. The more products, the more markets, the more alliances a\ncompany makes, the less money it makes. “Full-speed ahead in all\ndirections” seems to be the call from the corporate bridge. When will\ncompanies learn that line extension ultimately leads to oblivion?\n\nLess is more. If you want to be successful today, you have to narrow the\nfocus in order to build a position in the prospect’s mind.\n\nWhat does IBM stand for? It used to stand for “mainframe computers.”\nToday it stands for everything, which means it stands for nothing.\n\nWhy is Sears, Roebuck in trouble? Because the company tried to be all\nthings to all people. Sears was big in hard goods, so it went into soft goods\nand then fashion. The company even hired Cheryl Tiegs. (Do fashion\nmodels really buy their miniskirts at Sears?)\n\nIn the conventional view, a business strategy usually consists of\ndeveloping an all-encompassing vision. In other words, what concept or\nidea is big enough to hold all of a company’s products and services on the\nmarket today as well as those that are planned for the future?\n\nIn the conventional view, strategy is a tent. You stake out a tent big\nenough so it can hold everything you might possibly want to get into.\n\nIBM has erected an enormous computer tent. Nothing in the computer\nfield, today or in the future, will fall outside the IBM tent. This is a recipe\nfor disaster. As new companies, new products, new ideas invade the\ncomputer arena, IBM is going to get blown away. You can’t defend a\nrapidly growing market like computers even if you are a financial\npowerhouse like IBM. From a strategic point of view, you have to be much\nmore selective, picking and choosing the area in which to pitch your tent.\n\nStrategically, General Motors is in the same boat as IBM. GM is into\nanything and everything on wheels. Sedans, sports cars, cheap cars,\nexpensive cars, trucks, minivans, even electric cars. So what is GM’s\nbusiness strategy? If it runs on the road, or off the road, we’ll chase it.\n\nFor many companies, line extension is the easy way out. Launching a\nnew brand requires not only money, but also an idea or concept. For a new\nbrand to succeed, it ought to be first in a new category (chapter 1: The Law\nof Leadership). Or the new brand ought to be positioned as an alternative to\nthe leader (chapter 9: The Law of the Opposite). Companies that wait until a\nnew market has developed often find these two leadership positions already\npreempted. So they fall back on the old reliable line extension approach.\n\nThe antidote for line extension is corporate courage, a commodity in\nshort supply.\n\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Sacrifice",
            "chapter_path": "./screenshots-images-2/chapter_14",
            "sections": [
                {
                    "section_name": "You have to give up something in order to get something.",
                    "section_path": "./screenshots-images-2/chapter_14/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_14/section_1/89420a28-0de4-4591-b858-e74c272c72b7.png",
                        "./screenshots-images-2/chapter_14/section_1/58334c1a-01ef-4631-99cd-e8ac75ea62ac.png",
                        "./screenshots-images-2/chapter_14/section_1/3dcfa79b-aec4-4b76-9757-cec5a573618d.png",
                        "./screenshots-images-2/chapter_14/section_1/2cab9f9d-bea5-49c6-96bc-e97ceda44848.png",
                        "./screenshots-images-2/chapter_14/section_1/044a02d3-60e5-494b-8eab-df710069bccc.png",
                        "./screenshots-images-2/chapter_14/section_1/7541721b-d657-4aed-819e-6afd50acf37c.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "The law of sacrifice is the opposite of the law of line extension. If you\nwant to be successful today, you should give something up.\n\nThere are three things to sacrifice: product line, target market, and\nconstant change.\n\nFirst, the product line. Where is it written that the more you have to sell,\nthe more you sell?\n\nThe full line is a luxury for a loser. If you want to be successful, you have\nto reduce your product line, not expand it. Take Emery Air Freight. Emery\nwas in the air freight services business. Anything you wanted to ship you\ncould ship via Emery. Small packages, large packages, overnight service,\ndelayed service.\n\nFrom a marketing point of view, what did Federal Express do? It\nconcentrated on one service: small packages overnight. Today Federal\n\nExpress is a much bigger company than Emery.\n\nThe power of the sacrifice for Federal Express was in being able to put\nthe word overnight in the mind of the prospect. When it absolutely,\npositively had to be there overnight, you would call Federal Express.\n\nThen what did Federal Express do? The company did the same thing\nEmery did. It threw away its overnight position by buying Tiger\nInternational’s Flying Tiger cargo line for $880 million. Now Federal\nExpress is a worldwide air cargo company without a worldwide position. In\njust 21 months Federal Express lost $1.1 billion in its international\noperations.\n\nMarketing is a game of mental warfare. It’s a battle of perceptions, not\nproducts or services. In the mind of the prospect, Federal Express is the\novernight company. Federal Express owns the overnight position. When the\nmarket turned international, Federal Express faced a classic marketing\ndilemma. Should it try to take a domestic name into the international field?\nOr should it create a new worldwide name? Furthermore, how should it deal\nwith DHL, the company that got into the international field first?\n\nIt’s bad enough that Federal Express walked away from the “overnight”\nidea. What’s worse is that it didn’t replace the idea with a new one.\n\nEveready was the long-time leader in batteries. But new technology\narrived—as it does in most industries. The first technology to change the\nbattery business was the heavy-duty battery. What would you call your\nheavy-duty battery if you had the No. 1 name in batteries? You’d probably\ncall it the Eveready heavy-duty battery, which is what Eveready did.\n\nThen the alkaline battery arrived. Again, Eveready called its alkaline\nbattery the Eveready alkaline battery. It seemed to make sense.\n\nThen P.R. Mallory introduced a line of alkaline batteries only.\nFurthermore, the company gave the line a better name: Duracell.\n\nThe power of the sacrifice for Duracell was in being able to put the\n“long-lasting battery” idea in the mind of the prospect. Duracell lasts twice\nas long as Eveready, said the advertising.\n\nEveready was forced to change the name of its alkaline battery to “the\nEnergizer.” But it was too late. Duracell had already become the leader in\nthe battery market.\n\nThe world of business is populated by big, highly diversified generalists\nand small, narrowly focused specialists. If line extension and diversification\n\nwere effective marketing strategies, you’d expect to see the generalists\nriding high. But they’re not. Most of them are in trouble.\n\nThe generalist is weak. Take Kraft, for example. Everybody thinks Kraft\nis a strong brand name. In jellies and jams, Kraft has 9 percent of the\nmarket. But Smucker’s has 35 percent. Kraft means everything, but with a\nname like Smucker’s, it has to be jelly or jam because that’s all Smucker’s\nmakes. In mayonnaise, Kraft has 18 percent of the market. But Hellmann’s\nhas 42 percent.\n\n(Kraft does have a leading brand in terms of market share. However, its\nname isn’t Kraft, it’s Philadelphia. Philadelphia brand cream cheese has 70\npercent of the cream cheese market.)\n\nTake the retail industry. Which retailers are in trouble today? The\ndepartment stores. And what’s a department store? A place that sells\neverything. That’s a recipe for disaster.\n\nCampeau, L.J. Hooker, and Gimbels all wound up in bankruptcy court.\nAmes department stores filed for bankruptcy. Hills department stores filed\nfor bankruptcy. Macy’s, the owner of the world’s largest store, filed for\nbankruptcy.\n\nInterstate Department Stores also went bankrupt. So the company looked\nat the books and decided to focus on the only product it made money on:\ntoys. As long as Interstate was going to focus on toys, it decided to change\nits name to Toys “A” Us. Today Toys “A” Us does 20 percent of the retail\ntoy business in the country. Very profitably, too. In its last fiscal year, Toys\n“3” Us made $326 million on sales of $5.5 billion.\n\nMany retail chains are successfully patterning themselves on the Toys “4\n” Us formula: a narrow focus with in-depth stock. Staples (office supplies)\nand Blockbuster Video are two recent examples.\n\nIn the retail field generally, the big successes are the specialists:\n\n* The Limited. Upscale clothing for working women.\n\n* The Gap. Casual clothing for the young at heart.\n\n+ Benetton. Wool and cotton clothing for young swingers.\n* Victoria’s Secret. Sexy undergarments.\n\n+ Foot Locker. Athletic shoes.\n\n+ Banana Republic. Safari wear.\n\n(When a clothing chain with a name like Banana Republic can be\nsuccessful, you know we live in the age of the specialist.)\n\nLet’s discuss the second sacrifice, target market. Where is it written that\nyou have to appeal to everybody?\n\nTake the cola field. Coca-Cola got into the prospect’s mind first and built\na powerful position. In the late fifties, for example, Coke outsold Pepsi\nmore than five to one. What could Pepsi-Cola do to go against Coke’s\npowerful position?\n\nIn the early sixties Pepsi-Cola finally developed a strategy based on the\nconcept of sacrifice. The company sacrificed everything except the teenage\nmarket. Then it brilliantly exploited this market by hiring its icons: Michael\nJackson, Lionel Richie, Don Johnson.\n\nWithin one generation, Pepsi closed the gap. Today it is only 10 percent\nbehind Coca-Cola in total U.S. cola sales. (In the supermarket, Pepsi-Cola\nactually outsells Coca-Cola.)\n\nIn spite of Pepsi-Cola’s success, however, the pressure for enlarging the\ntent is always present. Recently it succumbed to temptation. According to\nAdvertising Age, “Pepsi-Cola Co. has outgrown the Pepsi generation. In a\nmajor marketing shift, flagship Pepsi will be pitched as the soft drink for the\nmasses.”\n\n“Gotta have it” is Pepsi’s new theme. The advertising shows older people\nlike Yogi Berra and Regis Philbin drinking Pepsi.\n\n“The one drawback of Pepsi advertising in the past has been a little too\nmuch focus on youth,” says Phil Dusenberry of Pepsi’s ad agency BBDO.\n“We could have made greater gains had we expanded our horizons to cast a\nwider net and catch more people.”\n\nAccording to Fortune magazine, Coca-Cola is the world’s most powerful\ntrademark. When an also-ran like Pepsi-Cola develops a narrowly focused\nstrategy that puts it within an eyelash of the leader, why would it change its\npowerful strategy?\n\nWhy indeed! There seems to be an almost religious belief that the wider\nnet catches more customers, in spite of many examples to the contrary.\n\nTake Budweiser, for example. “When we go out to develop a plan for\nBudweiser, we have to cover everybody above 21 years of age, whether\nthey’re male, female, black, white,” says August Busch IV.\n\nLook at cigarette advertisements, especially old cigarette ads. They\ninvariably show both a man and a woman. Why? In an age when most\n\nsmokers were men, cigarette manufacturers wanted to broaden their market.\nWe got the men, let’s go out and get the women, too.\n\nSo what did Philip Morris do? It narrowed the focus to men only. And\nthen it narrowed the focus even more to a man’s man, the cowboy. The\nbrand was called Marlboro. Today, Marlboro is the largest-selling cigarette\nin the world. In the United States, Marlboro is the largest-selling cigarette\namong men and women.\n\nThe target is not the market. That is, the apparent target of your\nmarketing is not the same as the people who will actually buy your product.\nEven though Pepsi-Cola’s target was the teenager, the market was\neverybody. The 50-year-old guy who wants to think he’s 29 will drink the\nPepsi.\n\nThe target of Marlboro advertising is the cowboy, but the market is\neverybody. Do you know how many cowboys are left in America? Very\nfew. (They’ve all been smoking Marlboros.)\n\nFinally, the third sacrifice: constant change. Where is it written that you\nhave to change your strategy every year at budget review time?\n\nIf you try to follow the twists and turns of the market, you are bound to\nwind up off the road. The best way to maintain a consistent position is not\nto change it in the first place.\n\nPeople Express had a brilliant “narrow” position to start with. It was the\nno-frills airline that flew to no-frills cities at no-frills prices. People used to\nget on a People Express plane and say, “Where are we going?” They didn’t\ncare, as long as it was cheap enough.\n\nWhat did People Express do after it became successful? It tried to be all\nthings to all people. It invested in new equipment, like 747s. It started to fly\nthe heavily traveled routes to places like Chicago and Denver, not to\nmention Europe. It bought Frontier Airlines. It added frills, like first-class\nsections.\n\nPeople Express promptly lost altitude and only escaped bankruptcy court\nby selling itself to Texas Air, which did it for them.\n\nWhite Castle, on the other hand, has never changed its position. A White\nCastle today not only looks the same as a White Castle did 60 years ago, it\nalso sells the same “frozen sliders” at unbelievably low prices. Would you\nbelieve the average White Castle does more than $1 million a year in\nrevenues? (That’s more than Burger King and not too far behind\nMcDonald’s.)\n\n\nGood things come to those who sacrifice.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Attributes",
            "chapter_path": "./screenshots-images-2/chapter_15",
            "sections": [
                {
                    "section_name": "For every attribute, there is an opposite, effective attribute.",
                    "section_path": "./screenshots-images-2/chapter_15/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_15/section_1/b1578e74-7130-4bb9-b489-caab243f6e89.png",
                        "./screenshots-images-2/chapter_15/section_1/06f4ddec-2120-4c37-8798-0c4ec4e7d5c0.png",
                        "./screenshots-images-2/chapter_15/section_1/5f7dc52e-34c8-4c5e-8930-1563dc98be52.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "In chapter 6 (The Law of Exclusivity) we made the point that you can’t\nown the same word or position that your competitor owns. You must find\nyour own word to own. You must seek out another attribute.\n\nToo often a company attempts to emulate the leader. “They must know\nwhat works,” goes the rationale, “so let’s do something similar.” Not good\nthinking.\n\nIt’s much better to search for an opposite attribute that will allow you to\nplay off against the leader. The key word here is opposite—similar won’t\ndo.\n\nCoca-Cola was the original and thus the choice of older people. Pepsi\nsuccessfully positioned itself as the choice of the younger generation.\n\nSince Crest owned cavities, other toothpastes avoided cavities and\njumped on other attributes like taste, whitening, breath protection, and,\n\nmore recently, baking soda.\n\nMarketing is a battle of ideas. So if you are to succeed, you must have an\nidea or attribute of your own to focus your efforts around. Without one, you\nhad better have a low price. A very low price.\n\nSome say all attributes are not created equal. Some attributes are more\nimportant to customers than others. You must try and own the most\nimportant attribute.\n\nCavity prevention is the most important attribute in toothpaste. It’s the\none to own. But the law of exclusivity points to the simple truth that once\nan attribute is successfully taken by your competition, it’s gone. You must\nmove on to a lesser attribute and live with a smaller share of the category.\nYour job is to seize a different attribute, dramatize the value of your\nattribute, and thus increase your share.\n\nFor many years IBM dominated the world of computers with its\nattributes of “big” and “powerful.” Companies that tried to move in on\nthose attributes had little success. RCA, GE, UNIVAC, Burroughs,\nHoneywell, NCR, and Control Data lost a lot of money on mainframe\ncomputers. Then an upstart from Boston went for the attribute of “small”\nand the minicomputer was born. They probably laughed in Armonk because\nthey knew corporate America wanted “big and powerful.” Today “small”\nhas grown to such proportions that IBM’s vast mainframe empire is in\nserious trouble.\n\nA company that never laughs at new attributes that are exactly the\nopposite of their current products is Gillette, the world’s No.1 razor blade\nmaker. Its dominance revolves around its high-technology razors and\ncartridge systems. When an upstart from France brought an opposite\nattribute to the category in the form of a “disposable” razor, Gillette could\nhave laughed and wheeled out its research on how America wants hefty,\nexpensive, high-technology razors. But it didn’t.\n\nInstead, Gillette jumped in with a disposable razor of its own, called\nGood News. By spending heavily, Gillette was able to win the battle of the\ndisposables.\n\nToday the Gillette Good News razor dominates the disposable category,\nwhich has grown to dominate the razor blade business. Moral: You can’t\npredict the size of a new attribute’s share, so never laugh.\n\nBurger King was unsuccessful when it tried to take the attribute “fast”\nfrom McDonald’s. What should Burger King have done? Use the opposite\n\nattribute? The exact opposite attribute, “slow,” won’t do for a fast-food\nplace (although there is an element of slowness in Burger King’s “broiling”\nconcept).\n\nA single trip to any McDonald’s should be enough to find another\nattribute that McDonald’s owns: “kids.” This is indeed the place to which\nkids drag their parents, and McDonald’s has the swing sets to prove it. This\nsets up an opportunity vividly demonstrated by the Coke and Pepsi battle. If\nMcDonald’s owns kids, then Burger King has the opportunity to position\nitself for the older crowd, which includes any kid who doesn’t want to be\nperceived as a kid. That generally works out to be everyone over the age of\n10 (not a bad market).\n\nTo make the concept work, Burger King would have to invoke the law of\nsacrifice and give all the little kids to McDonald’s. While this might mean\ngetting rid of a few swing sets, it also allows Burger King to hang “kiddie\nland” on McDonald’s (chapter 9: The Law of the Opposite).\n\nTo drive the concept into prospects’ minds, Burger King would need a\nterm. It could be grow up. Grow up to the flame-broiled taste of Burger\nKing.\n\nThe new concept for Burger King would strike fear and terror in the\nboardroom at McDonald’s, always a good sign of an effective program.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Candor",
            "chapter_path": "./screenshots-images-2/chapter_16",
            "sections": [
                {
                    "section_name": "When you admit a negative, the prospect will give you a\npositive.",
                    "section_path": "./screenshots-images-2/chapter_16/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_16/section_1/3b8cc9aa-75c8-4083-9ee2-05a5e6a56217.png",
                        "./screenshots-images-2/chapter_16/section_1/d6d9cfbc-491a-4e94-a3d5-4c827851ca67.png",
                        "./screenshots-images-2/chapter_16/section_1/c61e6fc2-b9db-4362-a72f-4eae47364dc3.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "It goes against corporate and human nature to admit a problem. For years,\nthe power of positive thinking has been drummed into us. “Think positive”\nhas been the subject of endless books and articles.\n\nSo it may come as a surprise to you that one of the most effective ways to\nget into a prospect’s mind is to first admit a negative and then twist it into a\npositive.\n\n“Avis is only No. 2 in rent-a-cars.”\n\n“With a name like Smucker’s, it has to be good.”\n\n“The 1970 VW will stay ugly longer.”\n\n“Joy. The most expensive perfume in the world.”\n\nWhat’s going on here? Why does a dose of honesty work so well in the\nmarketing process?\n\nFirst and foremost, candor is very disarming. Every negative statement\nyou make about yourself is instantly accepted as truth. Positive statements,\non the other hand, are looked at as dubious at best. Especially in an\nadvertisement.\n\nYou have to prove a positive statement to the prospect’s satisfaction. No\nproof is needed for a negative statement.\n\n“The 1970 VW will stay ugly longer.” A car that ugly must be reliable,\nthinks the prospect.\n\n“Joy. The most expensive perfume in the world.” If people are willing to\npay $375 an ounce, it must be a sensational perfume.\n\n“With a name like Smucker’s, it has to be good.” Most companies,\nespecially family companies, would never make fun of their own name. Yet\nthe Smucker family did, which is one reason why Smucker’s is the No.1\nbrand of jams and jellies. If your name is bad, you have two choices:\nchange the name or make fun of it. The one thing you can’t do is to ignore a\nbad name. Which is one reason why you won’t find beer brands like\nGablinger’s, Grolsch, and Gresedieck in your supermarket today.\n\n“Avis is only No. 2 in rent-a-cars.” So why go with them? They must try\nharder. Everybody knew that Avis was second in rent-a-cars.\n\nSo why go with the obvious? Marketing is often a search for the obvious.\nSince you can’t change a mind once it’s made up, your marketing efforts\nhave to be devoted to using ideas and concepts already installed in the\nbrain. You have to use your marketing programs to “rub it in.” No program\ndid this as brilliantly as the Avis No. 2 program.\n\nPositive thinking has been highly overrated. The explosive growth of\ncommunications in our society has made people defensive and cautious\nabout companies trying to sell them anything. Admitting a problem is\nsomething that very few companies do.\n\nWhen a company starts a message by admitting a problem, people tend\nto, almost instinctively, open their minds. Think about the times that\nsomeone came to you with a problem and how quickly you got involved\nand wanted to help. Now think about people starting off a conversation\nabout some wonderful things they are doing. You probably were a lot less\ninterested.\n\nNow with that mind open, you’re in a position to drive in the positive,\nwhich is your selling idea. Some years ago, Scope entered the mouthwash\nmarket with a “good-tasting” mouthwash, thus exploiting Listerine’s truly\nterrible taste.\n\nWhat should Listerine do? It certainly couldn’t tell people that Listerine’s\ntaste “wasn’t all that bad.” That would raise a red flag that would reinforce\na negative perception. Things could get worse. Instead, Listerine brilliantly\ninvoked the law of candor: “The taste you hate twice a day.”\n\nNot only did the company admit the product tasted bad, it admitted that\npeople actually hated it. (Now that’s honesty.) This set up the selling idea\nthat Listerine “kills a lot of germs.”\n\nThe prospect figured that anything that tastes like disinfectant must\nindeed be a germ killer. A crisis passed with the help of a heavy dose of\ncandor.\n\nAs another example, General Foods admitted that Grape-Nuts cereal was\na “learned pleasure” and advised consumers to “try it for a week.” Sales\nwent up 23 percent.\n\nOne final note: The law of candor must be used carefully and with great\nskill. First, your “negative” must be widely perceived as a negative. It has to\ntrigger an instant agreement with your prospect’s mind. If the negative\ndoesn’t register quickly, your prospect will be confused and will wonder,\n“What’s this all about?”\n\nNext, you have to shift quickly to the positive. The purpose of candor\nisn’t to apologize. The purpose of candor is to set up a benefit that will\nconvince your prospect.\n\nThis law only proves the old maxim: Honesty is the best policy.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Singularity",
            "chapter_path": "./screenshots-images-2/chapter_17",
            "sections": [
                {
                    "section_name": "In each situation, only one move will produce substantial\nresults.",
                    "section_path": "./screenshots-images-2/chapter_17/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_17/section_1/0b7e9854-0ddb-45c7-a7a0-f9acc5408c3c.png",
                        "./screenshots-images-2/chapter_17/section_1/2c6eb5c9-9f37-4a04-bee9-a039c72f4a89.png",
                        "./screenshots-images-2/chapter_17/section_1/9de078dc-c02a-42a6-a602-620f6a68404a.png",
                        "./screenshots-images-2/chapter_17/section_1/ef24a5d9-d0f7-4d01-8539-50a3ef539d4d.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Many marketing people see success as the sum total of a lot of small\nefforts beautifully executed.\n\nThey think they can pick and choose from a number of different\nstrategies and still be successful as long as they put enough effort into the\nprogram. If they work for the leader in the category, they fritter away their\nresources on a number of different programs. They seem to think that the\nbest way to grow is the puppy approach—get into everything.\n\nIf they’re not with the leader, they often end up trying to do the same as\nthe leader, but a little better. It’s like Saddam Hussein saying that all we\nhave to do is fight a little harder and everything will work out. Trying\nharder is not the secret of marketing success.\n\nWhether you try hard or try easy, the differences are marginal.\nFurthermore, the bigger the company, the more the law of averages wipes\nout any real advantage of a trying-harder approach.\n\nHistory teaches that the only thing that works in marketing is the single,\nbold stroke. Furthermore, in any given situation there is only one move that\nwill produce substantial results.\n\nSuccessful generals study the battleground and look for that one bold\nstroke that is least expected by the enemy. Finding one is difficult. Finding\nmore than one is usually impossible.\n\nMilitary strategist and author B.H. Liddell Hart calls this bold stroke “the\nline of, least expectation.” The Allied invasion came at Normandy, a place\nwhose tide and rocky shore the Germans felt would be an unlikely choice\nfor a landing of any scale.\n\nSo it is in marketing. Most often there is only one place where a\ncompetitor is vulnerable. And that place should be the focus of the entire\ninvading force.\n\nThe automobile industry is an interesting case in point. For years, the\nleader’s main strength was in the middle of the line. With brands like\nChevrolet, Pontiac, Oldsmobile, Buick, and Cadillac, General Motors easily\nbeat back frontal assaults by Ford, Chrysler, and American Motors. (The\nEdsel fiasco is a typical example.) GM’s dominance became legendary.\n\nWhat works in marketing is the same as what works in the military: the\nunexpected.\n\nHannibal came over the Alps, a route deemed impossible to scale. Hitler\ncame around the Maginot Line and sent his panzer divisions through the\nArdennes, terrain the French generals thought impossible to traverse with\ntanks. (As a matter of fact, he did it twice—once in the Battle of France and\nagain in the Battle of the Bulge.)\n\nIn recent years there have been only two strong moves made against GM.\nBoth were flanking moves around the GM Maginot Line. The Japanese\ncame at the low end with small cars like Toyota, Datsun, and Honda. The\nGermans came at the high end with super premium cars like Mercedes and\nBMW.\n\nWith the success of Japanese and German flanking attacks, General\nMotors was under pressure to commit resources in an attempt to shore up\nthe bottom and the top of its lines. (Cadillacs were too cheap to block the\nhigh-priced German imports.)\n\nIn an effort to save money and maintain profits, GM made the fateful\ndecision to build many of its midrange cars using the same body style.\nSuddenly, no one could tell a Chevrolet from a Pontiac or an Oldsmobile or\na Buick. They all looked alike.\n\nIts look-alike cars weakened General Motors in the middle and opened\nup a move for Ford as it broke through with the European-styled Taurus and\nSable. And then the Japanese jumped in with Acura, Lexus, and Infiniti.\nNow General Motors is weak across the board.\n\nLook at Coke. At present, Coca-Cola is fighting a two-front battle with\nClassic and New Coke. While Coca-Cola Classic has regained a lot of its\noriginal strength, New Coke (an Edsel from Atlanta) is barely hanging on.\n\nWe’ve seen endless slogans for Coca-Cola: “We have a taste for you.”\n“The real choice.” “Catch the Wave.” “Red, white, and you.” “You can’t\nbeat the feeling.” And now, “You can’t beat the real thing.” Nothing has\nmoved the needle very much.\n\nThe folks at Coca-Cola keep trying. They’ve even hired a Hollywood\ntalent agency to contribute creative ideas.\n\nAny day now, the new shooters will parade into an Atlanta conference\nroom and paper the wall with a new set of slogans. Top Coke management\nwill then sit around and discuss the latest batch of creative moves. While\nit’s theoretically possible to stumble across the right idea if you haphazardly\ngenerate all the ideas you can possibly think of, it’s not an efficient way to\nwork.\n\nCoke needs to make progress beyond just buying business. As we see it,\nCoke has only one two-part move to make—one part is a step backward, the\nother is a step forward.\n\nFirst of all, Coke has to bite the bullet and drop New Coke. Not because\nit’s a loser or an embarrassment, but because the existence of New Coke\nblocks the company from effectively using the only weapon it has.\n\nWith New Coke safely tucked away in the archives, Coke would be able\nto invoke the law of focus and bring back the concept of the “Real Thing”\nand use it against Pepsi.\n\nTo pull the trigger, Coke could go on television and say to the Pepsi\nGeneration, “All right kids, we’re not going to push you. When you’re\nready for the Real Thing, we’ve got it for you.” That would be the\nbeginning of the end of the Pepsi Generation (if Pepsi-Cola hadn’t already\nkilled it off all by itself).\n\n\nNot only is this idea simple and powerful, but it’s really the only move\navailable to Coke. It exploits the only words that Coke owns in the minds of\nits prospects: The Real Thing.\n\nTo find that singular idea or concept, marketing managers have to know\nwhat’s happening in the marketplace. They have to be down at the front in\nthe mud of the battle. They have to know what’s working and what isn’t.\nThey have to be involved.\n\nBecause of the high cost of mistakes, management can’t afford to\ndelegate important marketing decisions. That’s what happened at General\nMotors. When the financial people took over, the marketing programs\ncollapsed. Their interest was in the numbers, not the brands. The irony is\nthat the numbers went south, along with the brands.\n\nIt’s hard to find that single move if you’re hanging around headquarters\nand not involved in the process.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Unpredictability",
            "chapter_path": "./screenshots-images-2/chapter_18",
            "sections": [
                {
                    "section_name": "Unless you write your competitors’ plans, you can’t predict the\nfuture.",
                    "section_path": "./screenshots-images-2/chapter_18/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_18/section_1/2a9ed2ea-43d0-4e7d-bcc8-2ce07153bf33.png",
                        "./screenshots-images-2/chapter_18/section_1/9d8d9c63-6166-49b2-be65-a4764a9b6d19.png",
                        "./screenshots-images-2/chapter_18/section_1/a8dfdbd3-6ff9-45ae-955a-c4ae36a20cd8.png",
                        "./screenshots-images-2/chapter_18/section_1/729279bd-1222-4ff9-b508-664ba1f21a20.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Implicit in most marketing plans is an assumption about the future. Yet\nmarketing plans based on what will happen in the future are usually wrong.\n\nWith hundreds of computers and an army of meteorologists, no one can\npredict the weather three days in advance, so how do you expect to predict\nyour market three years in advance?\n\nIBM developed a massive marketing plan to hook up all PCs to its\nmainframes. The company called it OfficeVision. Yet the plan is dead in the\nwater thanks to developments at Sun Microsystems, Microsoft, and other\ncompanies. You might say that OfficeVision foresaw everything but the\ncompetition.\n\nFailure to forecast competitive reaction is a major reason for marketing\nfailures. When Pickett was asked which Confederate leader was responsible\nfor the defeat at Gettysburg, he replied, “I’ve always thought the Yankees\nhad something to do with it.”\n\nYet there are those who would say that America’s big problem is the lack\nof the long view, that American management is too short term in its\nthinking. Won’t eliminating long-term plans make things even worse?\n\nOn the surface those concerns are real. But it’s important to understand\nwhat is meant by long term versus short term. Most of corporate America’s\nproblems are not related to short-term marketing thinking. The problem is\nshort-term financial thinking.\n\nMost companies live from quarterly report to quarterly report. That’s a\nrecipe for problems. Companies that live by the numbers, die by the\nnumbers. Harold Geneen of ITT fame is one man in recent times who best\nexemplifies this approach. He would wheel and deal and beat up his\nmanagers for ever-increasing earnings.\n\nGeneen’s efforts resulted in a house of cards that eventually fell apart.\nToday ITT is a shell of what it once was. Good accounting, bad marketing.\n\nGeneral Motors was doing fine until the financial folks took over and put\nthe focus on the numbers instead of the brands. They allowed Alfred P.\nSloan’s plan of differentiated brands to fall apart. Every division head, in\norder to make their short-term numbers, started to chase the middle of the\nmarket.\n\nGood short-term planning is coming up with that angle or word that\ndifferentiates your product or company. Then you set up a coherent long-\nterm marketing direction that builds a program to maximize that idea or\nangle. It’s not a long-term plan, it’s a long-term direction.\n\nTom Monaghan’s short-term angle at Domino’s Pizza was to come up\nwith that “home delivery” idea and build a system that delivered pizzas\nquickly and efficiently. His long-term direction was to build the first\nnationwide home delivery chain as rapidly as possible.\n\nMonaghan couldn’t own the words home delivery until he had enough\nfranchisees to afford national advertising. He accomplished both objectives,\nand today Domino’s is a $2.65 billion company with a 4 percent share of\nthe home delivery business. Monaghan did it all without a complex, 10-year\nplan.\n\nSo what can you do? How can you best cope with unpredictability?\nWhile you can’t predict the future, you can get a handle on trends, which is\na way to take advantage of change. One example of a trend is America’s\ngrowing orientation toward good health. This trend has opened the door for\na number of new products, especially healthier foods. The recent runaway\nsuccess of Healthy Choice frozen entrées is a clear example of a product\nthat took advantage of this long-term trend.\n\nConAgra introduced Healthy Choice in March 1989. Years earlier,\nhowever, there were plenty of low-sodium, low-fat, light brands on the\nmarket. But these healthy ideas were buried under line extension names.\nConAgra was the first to use a simple name and concept to take advantage\nof a trend that has been going on for years.\n\nUnfortunately, ConAgra is well on its way to confusing things with a\nwide array of Healthy Choice line extensions that go way beyond entrées. It\nis violating the law of sacrifice.\n\nThe danger in working with trends is extrapolation. Many companies\njump to conclusions about how far a trend will go. If you believed the\nprognosticators of a few years ago, everyone today is eating broiled fish or\nmesquite-barbecued chicken. (Hamburger sales are doing just fine, thank\nyou.)\n\nEqually as bad as extrapolating a trend is the common practice of\nassuming the future will be a replay of the present. When you assume that\nnothing will change, you are predicting the future just as surely as when you\nassume that something will change. Remember Peter’s Law: The\nunexpected always happens.\n\nWhile tracking trends can be a useful tool in dealing with the\nunpredictable future, market research can be more of a problem than a help.\nResearch does best at measuring the past. New ideas and concepts are\nalmost impossible to measure. No one has a frame of reference. People\ndon’t know what they will do until they face an actual decision.\n\nThe classic example is the research conducted before Xerox introduced\nthe plain-paper copier. What came back was the conclusion that no one\nwould pay five cents for a plain-paper copy when they could get a\nThermofax copy for a cent and a half.\n\nXerox ignored the research, and the rest is history.\n\nOne way to cope with an unpredictable world is to build an enormous\namount of flexibility into your organization. As change comes sweeping\n\nthrough your category, you have to be willing to change and change quickly\nif you are to survive in the long term.\n\nYesterday, General Motors was slow to react to the small-car trend. It has\ncost the company dearly.\n\nToday, IBM is slow to acknowledge the trend away from mainframes. It\ncould cost the company dearly.\n\nAt present, the workstation is a real threat to both mainframes and\nminicomputers. It offers enormous power at very low cost. If IBM is going\nto protect its computer leadership, the company must become a serious\nplayer in a category dominated by Sun Microsystems and Hewlett-Packard.\n\nA natural move would be to introduce a new generic. IBM’s best\nopportunity might be to name its new line of high-powered workstations\n“PMs,” just as it did with its very successful “PCs.” “PM” could stand for\n“personal mainframe.” These two generic words dramatically capture the\nspeed and power of these new desktop machines. They are also words that\nIBM owns in the mind. The combination would be very powerful.\n\nThe only problem with a concept like this probably lies inside IBM itself.\nThe term personal mainframe would strike terror in IBM’s mainframe\ndivision as well as in its personal computer division. We suggest that the\nphones would ring and the case would quickly be made that a “personal\nmainframe” would undermine these two important sources of income.\n\nIt’s probably true that a personal mainframe product would undermine\nIBM’s two other main sources of revenue, but a company must be flexible\nenough to attack itself with a new idea. Change isn’t easy, but it’s the only\nway to cope with an unpredictable future.\n\nOne final note that’s worth mentioning: There’s a difference between\n“predicting” the future and “taking a chance” on the future. Orville\nRedenbacher’s Gourmet Popping Corn took a chance that people would pay\ntwice as much for a high-end popcorn. Not a bad risk in today’s affluent\nsociety.\n\nNo one can predict the future with any degree of certainty. Nor should\nmarketing plans try to.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Success",
            "chapter_path": "./screenshots-images-2/chapter_19",
            "sections": [
                {
                    "section_name": "Success often leads to arrogance, and arrogance to failure.",
                    "section_path": "./screenshots-images-2/chapter_19/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_19/section_1/11ddde1b-1d97-4f60-948a-d2eb8b39f0ef.png",
                        "./screenshots-images-2/chapter_19/section_1/a2396e9f-1f9f-409b-b7a1-1cd40665c9f9.png",
                        "./screenshots-images-2/chapter_19/section_1/bed01471-0428-42ce-871e-4f2d274df315.png",
                        "./screenshots-images-2/chapter_19/section_1/39c4a735-0221-4bbb-b78f-0514a7cde911.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Ego is the enemy of successful marketing.\n\nObjectivity is what’s needed.\n\nWhen people become successful, they tend to become less objective.\nThey often substitute their own judgment for what the market wants.\n\nDonald Trump and Robert Maxwell are two examples of people blinded\nby early success and untainted by humility. And when you’re blind, it is\nindeed hard to focus.\n\nMr. Trump’s strategy was to put his name on everything, committing the\ncardinal sin of line extension. (Denial seems to go hand in hand with a big\nego. When we first met The Donald, his opening remarks were about how\npeople accuse him of having a big ego. He went on to state that it was\ntotally untrue, he did not have a big ego. All the while, it was hard to avoid\n\nnoticing a three-foot-high brass “T” sitting on the floor next to his desk. So\nmuch for the sermon.)\n\nSuccess is often the fatal element behind the rash of line extensions.\nWhen a brand is successful, the company assumes the name is the primary\nreason for the brand’s success. So they promptly look for other products to\nplaster the name on.\n\nActually it’s the opposite. The name didn’t make the brand famous\n(although a bad name might keep the brand from becoming famous). The\nbrand got famous because you made the right marketing moves. In other\nwords, the steps you took were in tune with the fundamental laws of\nmarketing.\n\nYou got into the mind first. You narrowed the focus. You preempted a\npowerful attribute.\n\nYour success puffs up your ego to such an extent that you put the famous\nname on other products. Result: early success and long-term failure as\nillustrated by the failure of Donald Trump.\n\nThe more you identify with your brand or corporate name, the more\nlikely you are to fall into the line extension trap. “It can’t be the name,” you\nmight be thinking when things go wrong. “We have a great name.” Pride\ngoeth before destruction and a haughty spirit before a fall. Proverbs 16:18.\n\nTom Monaghan of Domino’s Pizza is one of the few executives who have\nrecognized how ego can lead you astray. “You start thinking you can do\nanything. I was that way back in the early days. I got into frozen pizzas for\na while and that was a disaster. If I hadn’t messed around with those frozen\npizzas for the better part of a year, trying to sell them in bars and\nrestaurants, Domino’s probably would have a lot more stores by now.”\n\nActually, ego is helpful. It can be an effective driving force in building a\nbusiness. What hurts is injecting your ego in the marketing process.\nBrilliant marketers have the ability to think like a prospect thinks. They put\nthemselves in the shoes of their customers. They don’t impose their own\nview of the world on the situation. (Keep in mind that the world is all\nperception anyway, and the only thing that counts in marketing is the\ncustomer’s perception.)\n\nAs their successes mounted, companies like General Motors, Sears,\nRoebuck, and IBM became arrogant. They felt they could do anything they\nwanted to in the marketplace. Success leads to failure.\n\nConsider Digital Equipment Corporation, the company that brought us\nthe minicomputer. Starting from scratch, DEC became an enormously\nsuccessful $14 billion company.\n\nDEC’s founder is Kenneth Olsen. His success made Ken such a believer\nin his own view of the computer world that he pooh-poohed the personal\ncomputer, then open systems, and, finally, reduced instruction set\ncomputing (RISC). In other words, Ken Olsen ignored three of the biggest\ndevelopments in the computer category. (A trend is like the tide—you don’t\nfight it.) Today Ken Olsen is out.\n\nThe bigger the company, the more likely it is that the chief executive has\nlost touch with the front lines. This might be the single most important\nfactor limiting the growth of a corporation. All other factors favor size.\nMarketing is war, and the first principle of warfare is the principle of force.\nThe larger army, the larger company, has the advantage.\n\nBut the larger company gives up some of that advantage if it cannot keep\nitself focused on the marketing battle that takes place in the mind of the\ncustomer.\n\nThe shootout at General Motors between Roger Smith and Ross Perot\nillustrates the point. When he was on the GM board, Ross Perot spent his\nweekends visiting dealers and buying cars. He was critical of Roger Smith\nfor not doing the same.\n\n“We’ve got to nuke the GM system,” Perot said. He advocated atom-\nbombing the heated garages, chauffeur-driven limousines, executive dining\nrooms. (Chauffeur-driven limousines for a company trying to sell cars?)\n\nIf you’re a busy CEO, how do you gather objective information on what\nis really happening? How do you get around the propensity of middle\nmanagement to tell you what they think you want to hear?\n\nHow do you get the bad news as well as the good?\n\nOne possibility is to go “in disguise” or unannounced. This is especially\nuseful at the distributor or retailer level. In many ways this is analogous to\nthe king who dresses up as a commoner and mingles with his subjects.\nReason: to get honest opinions of what’s happening.\n\nLike kings, chief executives rarely get honest opinions from their\nministers. There’s too much intrigue going on at the court.\n\nAnother aspect of the problem is the allocation of time. Quite often the\nCEO’s time is taken up with too many United Way meetings, too many\n\nindustry activities, too many outside board meetings, too many testimonial\ndinners.\n\nAccording to one survey, the average CEO spends 18 hours a week on\n“outside activities.” The next time-waster is internal meetings. The average\nCEO spends 17 hours a week attending corporate meetings and 6 hours a\nweek preparing for those meetings. Since the typical top executive works 61\nhours a week, that leaves only 20 hours for everything else, including\nmanaging the operation and going down to the front. No wonder chief\nexecutives delegate the marketing function. That’s a mistake.\n\nMarketing is too important to be turned over to an underling. If you\ndelegate anything, you should delegate the chairmanship of the next fund-\nraising drive. (The vice president of the United States, not the president,\nattends the state funerals.) The next thing to cut back on are the meetings.\nInstead of talking things over, walk out and see for yourself. As Gorbachev\ntold Reagan, “It is better to see once than to hear a hundred times.”\n\nSmall companies are mentally closer to the front than big companies.\nThat might be one reason they grew more rapidly in the last decade. They\nhaven’t been tainted by the law of success.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Failure",
            "chapter_path": "./screenshots-images-2/chapter_20",
            "sections": [
                {
                    "section_name": "Failure is to be expected and accepted.",
                    "section_path": "./screenshots-images-2/chapter_20/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_20/section_1/88c2a471-a0f4-4db8-8ab7-bb9a7f9ed324.png",
                        "./screenshots-images-2/chapter_20/section_1/a3eb61e7-8132-463b-a78b-be5ec890e094.png",
                        "./screenshots-images-2/chapter_20/section_1/c6e02625-4de4-46de-a556-784a78b9a6f5.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "Too many companies try to fix things rather than drop things. “Let’s\nreorganize to save the situation” is their way of life.\n\nAdmitting a mistake and not doing anything about it is bad for your\ncareer. A better strategy is to recognize failure early and cut your losses.\nAmerican Motors should have abandoned passenger cars and focused on\nJeep. IBM should have dropped copiers and Xerox should have dropped\ncomputers years before they finally recognized their mistakes.\n\nThe Japanese seem to be able to admit a mistake early and then make the\nnecessary changes. Their consensus management style tends to eliminate\nthe ego. Since a large number of people have a small piece of a big\ndecision, there is no stigma that can be considered career damaging. In\nother words, it’s a lot easer to live with “We were all wrong” than the\ndevastating “I was wrong.”\n\nThis egoless approach is a major factor in making the Japanese such\nrelentless marketers. It’s not that they don’t make mistakes, but when they\ndo, they admit them, fix them, and just keep coming.\n\nThe hugely successful Wal-Mart has another approach that enables the\ncompany to deal with failure. It’s called Sam Walton’s “ready, fire, aim”\napproach. It’s an outgrowth of his penchant for constant tinkering.\n\nWalton was well aware that nobody hits the target every time. But at Wal-\nMart, people aren’t punished if their experiments fail. As Wal-Mart’s chief\nexecutive said in a Business Week article, “If you learn something and\nyou’re trying something, then you probably get credit for it. But woe to the\nperson who makes the same mistake twice.”\n\nWal-Mart is different from many large corporations because, so far, it\nappears to be free of an insidious disease called the “personal agenda” that\ncan creep into any corporation. Marketing decisions are often made first\nwith the decision maker’s career in mind and second with the impact on the\ncompetition or the enemy in mind. There is a built-in conflict between the\npersonal and the corporate agenda.\n\nThis leads to a failure to take risks. (It’s hard to be first in a new category\nwithout sticking your neck out.) When the senior executive has a high\nsalary and a short time to retirement, a bold move is highly unlikely.\n\nEven junior executives often make “safe” decisions so as to not disrupt\ntheir progress up the corporate ladder. Nobody has ever been fired for a\nbold move they didn’t make.\n\nIn some American companies nothing gets done unless it benefits the\npersonal agenda of someone in top management. This severely limits the\npotential marketing moves a company can make. An idea gets rejected not\nbecause it isn’t fundamentally sound but because no one in top management\nwill personally benefit from its success.\n\nOne way to defuse the personal agenda factor is to bring it out in the\nopen. 3M uses the “champion” system to publicly identify the person who\nwill benefit from the success of a new product or venture. The successful\nintroduction of 3M’s Post-it Notes illustrates how the concept works. Art\nFry is the 3M scientist who championed the Post-it Notes product, which\ntook almost a dozen years to bring to market.\n\nWhile the 3M system works, in theory the ideal environment would allow\nmanagers to judge a concept on its merits, not on whom the concept would\nbenefit.’\n\n\nIf a company is going to operate in an ideal way, it will take teamwork,\nesprit de corps, and a self-sacrificing leader. One immediately thinks of\nPatton and his Third Army and its dash across France. No army in history\ntook as much territory and as many prisoners in as short a period of time.\n\nPatton’s reward? Eisenhower fired him.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Hype",
            "chapter_path": "./screenshots-images-2/chapter_21",
            "sections": [
                {
                    "section_name": "The situation is often the opposite of the way it appears in the\npress.",
                    "section_path": "./screenshots-images-2/chapter_21/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_21/section_1/8cded788-a0d2-4255-b47b-4057c0f05a6d.png",
                        "./screenshots-images-2/chapter_21/section_1/dbef911c-491f-4b84-8532-ad1e0ec01efb.png",
                        "./screenshots-images-2/chapter_21/section_1/956090b1-6281-426a-91c0-3d7fbdacfbbb.png",
                        "./screenshots-images-2/chapter_21/section_1/df0de074-07cd-4c6b-88d8-a6d9f157df12.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "When IBM was successful, the company said very little. Now it throws a\nlot of press conferences.\n\nWhen things are going well, a company doesn’t need the hype. When you\nneed the hype, it usually means you’re in trouble.\n\nYoung and inexperienced reporters and editors tend to be more impressed\nby what they read in other publications than by what they gather\nthemselves. Once the hype starts, it often continues on and on.\n\nNo soft drink has received more hype than New Coke. By one estimate,\nNew Coke received more than $1 billion worth of free publicity. Add to that\nthe hundreds of millions of dollars spent to launch the brand, and New Coke\nshould have been the world’s most successful product. It didn’t happen.\n\nLess than 60 days after the launch, Coca-Cola was forced to come back\nwith the original formula, now called Coca-Cola Classic. Today Classic\noutsells New about 15 to 1.\n\nNo newspaper has received more hype than USA Today. At its launch in\n1982 were the president of the United States, the speaker of the House of\nRepresentatives, and the majority leader of the U.S. Senate. The residue of\nthis initial hype is still so great that most people cannot believe USA Today\nis a loser.\n\nNo computer has received more hype than the Next computer. Demand\nfor press conference credentials was so great that Steve Jobs had to print\ntickets in advance, even though the auditorium could hold several thousand\npeople. All the seats were filled.\n\nSteve Jobs makes television news as well as the cover of many major\npublications. IBM, Ross Perot, and Canon have invested $130 million.\n\nWill Next be a winner? Of course not. Where is the opening? Next is the\nfirst in a new category of what?\n\nHistory is filled with marketing failures that were successful in the press.\nThe Tucker 48, the U.S. Football League, Videotext, the automated factory,\nthe personal helicopter, the manufactured home, the picturephone, polyester\nsuits. The essence of the hype was not just that the new product was going\nto be successful. The essence of the hype was that existing products would\nnow be obsolete.\n\nPolyester was going to make wool obsolete. Videotext was going to make\nnewspapers obsolete. The personal helicopter was going to make the roads\nand highways obsolete. The Tucker 48 with its “cyclop’s eye” headlight\nwould revolutionize the way Detroit makes automobiles. (Only 51 were\never built.)\n\nIn the heavily touted “office of the future,” everything was going to be\nintegrated into one ball of computer wax. The last time we looked, there\nwere separate typewriters (now called personal computers), separate laser\nprinters, separate fax machines, separate copy machines, separate postal\nmeters. The office of the future is aptly named—a concept that will remain\nforever in the future.\n\nThese predictions violate the law of unpredictability. No one can predict\nthe future, not even a sophisticated reporter for the Wall Street Journal. The\nonly revolutions you can predict are the ones that have already started.\n\nDid anyone predict the overthrow of communism and the Soviet Union?\nNot really. It was only after the process had started that the press jumped on\nthe “crumbling communist empire” story.\n\nContrast the first Tucker with the first Toyopet that hit the shores of\nCalifornia. Did the Los Angeles Times do a story on how Japanese imports\nwere going to shake up the auto industry? Not at all. The only stories that\nmade the news were about the little cars from Japan that fell apart because\nthey weren’t up to the rigors of American roads. (Toyopet, of course, went\non to become a big winner after changing the cars and changing the car’s\nname to Toyota.)\n\nWhen MCI got started by launching a microwave service between\nChicago and St. Louis, did the press say, “Watch out, AT&T, here comes the\ncompetition?” No, they pretty much ignored littlke MCI. When Sun\nMicrosystems shipped its first workstation, did the press note the\nsignificance of the event, that someday workstations would rattle the cages\nat IBM and DEC? No, the press ignored Sun.\n\nForget the front page. If you’re looking for clues to the future, look in the\nback of the paper for those innocuous little stories.\n\nNeither the personal computer nor the facsimile machine took off like a\nrocket. The personal computer was introduced in 1974. It took six years for\nIBM to strike back with the PC. Even the PC didn’t boom until a year and a\nhalf later, when Lotus 1-2-3 hit the market.\n\nCapturing the imagination of the public is not the same as revolutionizing\na market. Take the picturephone, now called the videophone. Ever since its\nintroduction at the 1964 New York World’s Fair, the picturephone has been\nin the news, usually on the front page. The latest example is a front-page\nstory in the Wall Street Journal, “The Videophone Era May Finally Be\nNear, Bringing Big Changes.”\n\nThis is the third try for AT&T. In the seventies, it failed with the\npicturephone at $100 a month. In the eighties, it failed with a picturephone\nmeeting service at $2,300 an hour. In the nineties, AT&T is hustling $1,500\nvideophones.\n\nIt’s easy to see why the videophone hasn’t made much progress. Who\nwants to get dressed up to make a phone call?\n\nWhat isn’t so easy to see is why the videophone gets so much hype.\nThere’s a clue in the subhead of the Journal article, “An Alternative To\nTravel.” Look out American Airlines, United, and Delta, your days are\n\nnumbered. The hype really isn’t about the videophone at all. It’s about the\ncoming revolution in the travel industry.\n\nOver the years, the greatest hype has been for those developments that\npromise to single-handedly change an entire industry, preferably one that’s\nvital to the American economy. Remember the helicopter hype after World\nWar II? Every garage would house a helicopter, making roads, bridges, and\nthe entire automobile industry obsolete overnight. Did Donald Trump get a\nhelicopter? Did you get yours? (Donald actually did get his, but he had to\ngive it back to the bank.)\n\nThen there was the manufactured-home hype. It was reported that the\nsingle most expensive product a family ever buys could be made on the\nassembly line, revolutionizing the construction industry.\n\nFrom time to time, no-frills food makes the headlines. It is reported that\nthis development will revolutionize the packaged-goods industry. Brands\nare out. People will read the labels and buy products on their merits rather\nthan on the size of the brand’s advertising budget. It’s all hype.\n\nThe latest overhyped development is that of the pen computer, which will\nrevolutionize the personal computer field and make computers accessible to\neveryone whether they can type or not. It’s all hype.\n\nNot that there isn’t a grain of truth in every over-hyped story. Anyone\nwith $580,000 plus tax can buy a little five-seat Bell helicopter. The pen\ncomputer might be attractive to a narrow segment of the market, especially\nthe traveling-salesperson crowd. The videophone could revolutionize the\nphone-sex industry, and there’s a substantial market for mobile homes and\nrecreational vehicles, all manufactured on assembly lines.\n\nBut, for the most part, hype is hype. Real revolutions don’t arrive at high\nnoon with marching bands and coverage on the 6:00 P.M. news. Real\nrevolutions arrive unannounced in the middle of the night and kind of sneak\nup on you.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "ai\n\nThe Law of Acceleration",
            "chapter_path": "./screenshots-images-2/chapter_22",
            "sections": [
                {
                    "section_name": "Successful programs are not built on fads, they’re built on\ntrends.",
                    "section_path": "./screenshots-images-2/chapter_22/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_22/section_1/b5fd7204-2fe7-47f1-8506-7b752f210371.png",
                        "./screenshots-images-2/chapter_22/section_1/7bb64e7a-8070-47cf-993b-d7d657f51df0.png",
                        "./screenshots-images-2/chapter_22/section_1/efa98217-cac4-4f96-a0b5-1275d83e97a4.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "A fad is a wave in the ocean, and a trend is the tide. A fad gets a lot of\nhype, and a trend gets very little.\n\nLike a wave, a fad is very visible, but it goes up and down in a big hurry.\nLike the tide, a trend is almost invisible, but it’s very powerful over the long\nterm.\n\nA fad is a short-term phenomenon that might be profitable, but a fad\ndoesn’t last long enough to do a company much good. Furthermore, a\ncompany often tends to gear up as if a fad were a trend. As a result, the\ncompany is often stuck with a lot of staff, expensive manufacturing\nfacilities, and distribution networks.\n\n(A fashion, on the other hand, is a fad that repeats itself. Examples: short\nskirts for women and double-breasted suits for men. Halley’s Comet is a\nfashion because it comes back every 75 years or so.)\n\nWhen the fad disappears, a company often goes into a deep financial\nshock. What happened to Atari is typical in this respect. And look how\nColeco Industries handled the Cabbage Patch Kids. Those homely dolls hit\nthe market in 1983 and started to take off. Coleco’s strategy was to milk the\nkids for all they were worth.\n\nHundreds of Cabbage Patch novelties flooded the toy stores. Pens,\npencils, crayon boxes, games, clothing. Two years later, Coleco racked up\nsales of $776 million and profits of $83 million. Then the bottom dropped\nout of the Cabbage Patch Kids. By 1988 Coleco went into Chapter 11.\n\nColeco died, but the kids live on. Acquired by Hasbro in 1989, the\nCabbage Patch Kids are now being handled conservatively. Today they’re\ndoing quite well.\n\nHere’s the paradox. If you were faced with a rapidly rising business, with\nall the characteristics of a fad, the best thing you could do would be to\ndampen the fad. By dampening the fad, you stretch the fad out and it\nbecomes more like a trend.\n\nYou see this in the toy business. Some owners of hot toys want to put\ntheir hot toy name on everything. The result is that it becomes an enormous\nfad that is bound to collapse. When everybody has a Ninja turtle, nobody\nwants one anymore.\n\nThe Ninja turtle is a good example of a fad that collapses in a hurry\nbecause the owner of the concept got greedy. The owner fans the fad rather\nthan dampening it.\n\nOn the other hand, the Barbie doll is a trend. When Barbie was invented\nyears ago, the doll was never heavily merchandised into other areas. As a\nresult, the Barbie doll has become a long-term trend in the toy business.\n\nThe most successful entertainers are the ones who control their\nappearances. They don’t overextend themselves. They’re not all over the\nplace. They don’t wear out their welcome.\n\nElvis Presley’s manager, Colonel Parker, made a deliberate attempt to\nrestrict the number of appearances and records the King made. As a result,\nevery time Elvis appeared, it was an event of enormous impact. (Elvis\nhimself contributed to this strategy by overdosing early and severely\n\ndampening his future appearances. Likewise Marilyn Monroe and James\nDean.)\n\nForget fads. And when they appear, try to dampen them. One way to\nmaintain a long-term demand for your product is to never totally satisfy the\ndemand.\n\nBut the best, most profitable thing to ride in marketing is a long-term\ntrend.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "The Law of Resources",
            "chapter_path": "./screenshots-images-2/chapter_23",
            "sections": [
                {
                    "section_name": "Without adequate funding an idea won’t get off the ground.",
                    "section_path": "./screenshots-images-2/chapter_23/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_23/section_1/8bff60d1-c7f2-423e-b8e8-12ae74c23621.png",
                        "./screenshots-images-2/chapter_23/section_1/045b4128-10c1-4154-b601-2557d7eb4126.png",
                        "./screenshots-images-2/chapter_23/section_1/6f3e0346-9b61-4c50-8141-b83e3eacb7d9.png",
                        "./screenshots-images-2/chapter_23/section_1/31e96562-33af-4b0b-bc86-401ef558979f.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "If you have a good idea and you’ve picked up this book with the thought\nin mind that all you need is a little marketing help, this chapter will throw\ncold water on that thought.\n\nEven the best idea in the world won’t go very far without the money to\nget it off the ground. Inventors, entrepreneurs, and assorted idea generators\nseem to think that all their good ideas need is professional marketing help.\n\nNothing could be further from the truth. Marketing is a game fought in\nthe mind of the prospect. You need money to get into a mind. And you need\nmoney to stay in the mind once you get there.\n\nYou’!l get further with a mediocre idea and a million dollars than with a\ngreat idea alone.\n\nSome entrepreneurs see advertising as the solution to the problem of\ngetting into prospects’ minds. Advertising is expensive. It cost $9,000 a\n\nminute to fight World War II. It cost $22,000 a minute to fight the Vietnam\nWar. A one-minute commercial on the NFL Super Bowl will cost you $1.5\nmillion.\n\nSteve Jobs and Steve Wozniak had a great idea. But it was Mike\nMarkkula’s $91,000 that put Apple Computer on the map. (For his money,\nMarkkula got one-third of Apple. He should have held out for half.)\n\nIdeas without money are worthless. Well ... not quite. But you have to\nuse your idea to find the money, not the marketing help. The marketing can\ncome later.\n\nSome entrepreneurs see publicity as a cheap way of getting into\nprospects’ minds. “Free advertising” is how they see it. Publicity isn’t free.\nRule of thumb: 5-10-20. A small public relations agency will want $5,000 a\nmonth to promote your product; a medium-size agency, $10,000 a month;\nand a big-time agency, $20,000 a month.\n\nSome entrepreneurs see venture capitalists as the solution to their money\nproblems. But only a tiny percentage succeed in finding the funding they\nneed this way.\n\nSome entrepreneurs see corporate America as ready, willing, and\nfinancially able to get their offspring off the ground. Good luck, you’ll need\nit. Very few outside ideas are ever accepted by large companies. Your only\nreal hope is finding a smaller company and persuading it of the merits of\nyour idea.\n\nRemember: An idea without money is worthless. Be prepared to give\naway a lot for the funding.\n\nIn marketing, the rich often get richer because they have the resources to\ndrive their ideas into the mind. Their problem is separating the good ideas\nfrom the bad ones, and avoiding spending money on too many products and\ntoo many programs (chapter 5: The Law of Focus).\n\nCompetition is fierce. The giant corporations put a lot of money behind\ntheir brands. Procter & Gamble and Philip Morris each spend more than $2\nbillion a year on advertising. General Motors spends $1.5 billion a year.\n\nLife can be unfair for the smaller marketer facing larger competitors.\nConsider A&M Pet Products, a small company in Houston, Texas. A&M\ninvented “clumping” cat litter, one of the most important breakthroughs in\nthe category. The concept is simple. When cats use the litter box, this new\ntype of litter clumps the waste into balls, which are easily scooped out and\ndisposed of. There is no need to replace the entire box.\n\n\nThe brand, called Scoop Away, took off wherever it was introduced. This\nquickly got the attention of Golden Cat Corporation, which has the No.1 cat\nlitter brand, Tidy Cat.\n\nRecognizing a threatening idea when they see one, Golden Cat\nintroduced their own version of clumping cat litter, called Tidy Scoop. Not\nonly, did they jump on A&M’s idea, they also borrowed the Scoop part of\ntheir brand name. (How unfair can you be?)\n\nThe winner of this cat fight will probably be determined by money. Who\nhas the most money to drive in the idea?\n\nUnlike a consumer product, a technical or business product has to raise\nless marketing money because the prospect list is shorter and media is less\nexpensive. But there is still a need for adequate funding for a technical\nproduct to pay for brochures, sales presentations, and trade shows as well as\nadvertising.\n\nHere is the bottom line. First get the idea, then go get the money to\nexploit it. Here are some short cuts you could take:\n\n* You can marry the money. Georgette Mosbacher married Commerce\nSecretary Robert Mosbacher in 1985. Three years later, Ms.\nMosbacher bought La Prairie, a Swiss cosmetics firm, for $31.5\nmillion. Where did she get the money? From everyone. Venture\ncapitalists, La Prairie distributors in Switzerland and Japan, plus her\nown and her husband’s resources. In the first year under Georgette\nMosbacher’s control, La Prairie’s sales were up 30 percent. Then\nshe sold out at a hefty profit.\n\n+ You can divorce the money. Frances Lear arrived in New York in\n1985 at the age of 61. Freshly divorced from her television\nproducer-husband Norman (“All in the Family”) Lear, she was\ndetermined to launch a magazine for women over 40. She was\nprepared to spend $25 million of her expected $112 million\nsettlement on the project. By its fifth issue, Lear’s magazine had\n350,000 readers.\n\n+ You can find the money at home. Donald Trump would never have\ngotten anywhere without Dad’s millions behind him.\n\n* You can “share” your idea by franchising it. Tom Monaghan was\nable to put Domino’s Pizza on the map by pursuing an aggressive\nprogram of franchising his home delivery idea.\n\nSo far we’ve been talking about smaller companies and their fund-raising\nstrategies. What about a rich company? How should it approach the law of\nresources? The answer is simple: Spend enough. In war, the military always\nerrs on the high side. Do you know how many rations were left after\nOperation Desert Storm? A lot. So it is in marketing. You can’t save your\nway to success.\n\nThe more successful marketers front load their investment. In other\nwords, they take no profit for two or three years as they plow all earnings\nback into marketing.\n\nMoney makes the marketing world go round. If you want to be successful\ntoday, you’ll have to find the money you need to spin those marketing\nwheels.\n",
                    "extracted-code": ""
                }
            ]
        },
        {
            "chapter_name": "Warning",
            "chapter_path": "./screenshots-images-2/chapter_24",
            "sections": [
                {
                    "section_name": "Warning",
                    "section_path": "./screenshots-images-2/chapter_24/section_1",
                    "images": [
                        "./screenshots-images-2/chapter_24/section_1/77510c54-3d0c-4c8b-afdc-3ba23d68af95.png",
                        "./screenshots-images-2/chapter_24/section_1/2c2b4a49-c348-4552-866d-e2c5aa84ed2b.png"
                    ],
                    "code_images": [],
                    "status": "images tested ok",
                    "errors": [],
                    "extracted-text": "We would be remiss if we did not warn our readers about the potential\ndangers of trying to apply the laws of marketing within an existing\norganization. Many of these laws fly in the face of corporate ego,\nconventional wisdom, and the Malcolm Baldrige awards.\n\nThe law of perception runs counter to the corporate culture of most\ncompanies where trying to be better is deeply ingrained. People are forever\nrunning around and “benchmarking” the leader in the category and then\nsetting out to “beat their specs.” It’s what the quality movement is all about.\n\nThe law of leadership is tough for many to swallow. Most people want to\nbelieve they got to the top by being better, not by being first.\n\nSo beware! Management won’t take kindly to any suggestions that will\ntake the emphasis off their better product strategy.\n\nThe law of sacrifice could cause you problems. Offering everything for\neverybody is deeply ingrained in most organizations. If you have any\ndoubts, just stroll down the aisles of any supermarket. What you will find is\nvariation upon variation of sizes, flavors, and forms. It boggles the mind.\nWhy this happens is painfully obvious. Nobody wants to focus.\n\nLarge companies have offices filled with young, bright marketing people.\nDo you expect them to just sit there and do nothing? They feel compelled to\ntinker and make improvements. After all, how can they make their mark on\nthe organization?\n\nSo beware! Those young, bright marketing people will not take kindly to\nany efforts to curtail their tinkering.\n\nThe law of focus suggests owning a word in the prospects’ minds. What\nword does your company own in the minds of your prospects? “I don’t\nknow,” might be your response. “We make a variety of products for many\ndifferent industries.”\n\nSo beware! You have some pruning to do, which, isn’t going to be easy to\nsell to the powers that be.\n\nThe law of perspective will frustrate anyone looking for quick marketing\nvictories. Companies want to see instant results.\n\nSo beware! Those accountants will give you a hard time in the short term.\n\nThe law of line extension is the most dangerous law of all to deal with. In\nthis case, you have to be prepared to demolish what management holds to\nbe a basic truth: Big successful brands have an equity that can be exploited\nto encompass different kinds of products.\n\nLine extension makes eminent sense in the boardroom. You won’t find\none director in a dozen who would be willing to challenge management on\nthis critical issue.\n\nSo beware! Management will not take kindly to any efforts to curtail their\nequity expansions. You may just have to wait them out. Management is\nmutable, but the laws of marketing are not.\n\nThus are you duly warned. If you violate the immutable laws, you run the\nrisk of failure. If you apply the immutable laws, you run the risk of being\nbad-mouthed, ignored, or even ostracized.\n\nHave patience. The immutable laws of marketing will help you achieve\nsuccess. And success is the best revenge of all.\n",
                    "extracted-code": ""
                }
            ]
        }
    ]
}