{
    "New item": {
        "chapters": [
            {
                "chapter_id": 1,
                "chapter_name": "1. CLIMATE CHANGE",
                "chapter_path": "./screenshots-images-2/chapter_1",
                "sections": [
                    {
                        "section_id": 1.1,
                        "section_name": "1. CLIMATE CHANGE",
                        "section_path": "./screenshots-images-2/chapter_1/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_1/section_1/90880536-7105-4ae3-a56d-c9cb89014881.png",
                            "./screenshots-images-2/chapter_1/section_1/33ce6af6-7db8-4f66-bf98-422c73801255.png",
                            "./screenshots-images-2/chapter_1/section_1/d87f5140-f22c-4c70-b438-64d012e5f97e.png",
                            "./screenshots-images-2/chapter_1/section_1/ca89d779-4076-42f7-95ec-09958f73e786.png",
                            "./screenshots-images-2/chapter_1/section_1/ee9336e3-dcb8-4cf2-8f6e-853f5fb795bb.png",
                            "./screenshots-images-2/chapter_1/section_1/845c3ee3-0434-4a9f-bffa-8c999b6a1e8d.png",
                            "./screenshots-images-2/chapter_1/section_1/7275a00c-3bc6-47fe-9c66-8fea899266ba.png",
                            "./screenshots-images-2/chapter_1/section_1/a5fa0733-030d-423d-8bb0-f5588265b457.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "1.1. GLOBAL SCENARIO\n\n1.1.1. OZONE HOLE\n\nWhy in the News? eo\n\n=~\nOzone layer depletion\nAs per a recent study, from\n1Utra-violet rays spito | 2 The chlorine atom breaks | 3 The molecules left behind\n2020-22, ozone hole has chiorine atom away from up an ozone molecule, are chlorine monoxide\nthe CFC\n\ngrown \\ ‘ger and thinner over rsorchucrcoaton) making a hole in the and oxygen (0,)\nAntarctica. inciscels ozone layer\nAbout Ozone layer and Ozone cre\nHole molecule\n«Thin shield of gas in Earth’s\n\nStratosphere\n* Absorbs the sun’s\n\nultraviolet rays. Sreatetr\n\nfrom UV rays\n\ne Nearly 90% of Earth’s\nozone resides in the\n\nstratosphere. Ozone depleting chemicals\nCFCs (aerosols, refrigerants, solvents)\n¢ Ozone hole: Region of HCFCs (aerosols, refrigerant solvents)\nexceptionally depleted \"1 Halons (fire extinguishers)\nozone in the stratosphere Methyl bromide (pesticides)\n\nover the Antarctic and\nArctic.\no Denotes areas where ozone levels drop below 220 Dobson Units.\no Average thickness of ozone layer over Earth: 300 Dobson Units\n* Ozone-depleting substances (ODSs)\no Human-made gases that reach stratosphere and repeatedly break apart ozone molecules.\n¥ A process known as catalytic cycles (a sequence of chemical reactions in the form of a loop)\nresulting in destruction of ozone.\n* Major ODSs: Chlorine, bromine, CFCs, carbon tetrachloride, halons etc.\ne Status: Ozone layer on track to recover within 4 decades (United Nations Environment Programme).\n\nPotential drivers of ozone hole over Antarctica\n\n* Changes in Antarctic polar vortex\no Polar Vortex are stratospheric wind patterns with a vast swirl of low pressure and very cold air, more\npronounced over the South Poles and leads to formation of Polar Stratospheric Clouds (PSCs).\no PSCs, also known as nacreous clouds or mother of pearl, are formed only below -78C, and trap\noutgoing longwave radiation.\no Can destroy ozone by-\nY Providing a surface that converts benign forms of chlorine into reactive, ozone-destroying forms.\n¥ Removing nitrogen compounds that moderates the destructive impact of chlorine.\n* Changes in solar cycle.\n* Increased atmospheric abundance of Chlorofluorocarbons (CFCs).\n\nRelated News: Impact of Volcanic eruptions on Ozone layer\n\n* As per recent study, eruption of Hunga Tonga-Hunga Ha’apai Volcano may have potentially impacted\nozone layer.\n\n* Hunga Tonga-Hunga Ha’apai is a submarine volcano in the Tongan archipelago located in the\nsouthern Pacific Ocean, that erupted in January 2022.\n\n\ne Earlier, 1991 eruption of Mt. Pinatubo in the Philippines potentially led to significant ozone loss in\nstratosphere.\n\ne\nTriggers massive stratospheric water\n\nvapor plume.\n\nInject large quantities of sulphur\ndioxide (facilitates chemical\n\nImpact of conversion of chlorine making it more\nvolcanic reactive)\neruptions Contribute atmospheric bromine, and\non ozone ;\nhydrogen chloride\nlayer\n\nEruption particles provide surfaces for\nchemical reactions for ODS.\n\n1.1.1.1. MONTREAL PROTOCOL\n\nWhy in the News?\n\nIndia surpassed Montreal protocol targets, says report by Ministry of Environment and United Nations\nDevelopment Programme (UNDP).\n\nAbout India’s achievement under Montreal Protocol\n\n« Exceeded the 35% HCFC (Hydrochlorofluorocarbons) phase-out goal.\no 44% reduction achieved from the 2020 baseline.\n« Eliminated HCFC 141b.\no HCFCs are employed as refrigerants in production of new equipment.\no HCFC 141b, is used as a blowing agent in production of rigid polyurethane foam.\n* Willalso phase out use of HCFCs in new equipment manufacturing completely by December 2024\no Ahead of the Montreal Protocol schedule (2030).\n* Other achievements of India in the implementation of Montreal Protocol\no Phased out CFC, Carbon tetrachloride, Halons, etc. for controlled uses.\no HFCs Phase-out Management Plan (HPMP) Stage- II is currently under implementation from 2017 (till\n2024).\no India Cooling Action Plan (ICAP) aims at reducing cooling demand, refrigerant transition, enhancing\nenergy efficiency and adopting better technology options by 2037-38.\n\nAbout Montreal Protocol (1987)\n\n* Implemented under the Vienna Convention (adopted in 1985).\n\n« A global environmental treaty to eliminate the production and use of Ozone Depleting Substances\n(Obs).\n* Signatories: 1\" universally ratified Treaty of UN.\n\n* World Ozone Day celebrated (16th September) each year to commemorate its signing.\n« Kigali Amendment to Montreal Protocol was adopted in 2016 (entered into force 2019), to phase down\nproduction and consumption of Hydrofluorocarbons (HFCs).\no HFCs are non-ODS alternatives to CFCs and HCFCs, but their global warming potential is thousands\nof times that of carbon dioxide.\no It divides nations into 3 groups with a four-step path to achieve 80% reduction in HFCs consumption\nby 2047.\n« India and Montreal protocol\no Became Party to the Vienna Convention (in 1991) and the Montreal Protocol (in 1992).\no Implementing agency: Ministry of Environment, Forest and Climate Change (MoEF&CC)\no Ratified Kigali Amendment in 2021.\n¥ Under it, India will complete its phase down of HFCs in 4 steps from 2032 onwards with cumulative\nreduction of 10% in 2032, 20% in 2037, 30% in 2042 and 85% in 2047.\n\n1.1.2. STATE OF THE CRYOSPHERE 2023\n\nWhy in the News?\n\nThe State of the Cryosphere 2023 — Two Degrees is Too High report was released by the International Cryosphere\n\nClimate Initiative (ICCI).\n\nAbout ICCI\n\n« Anetwork of experts and researchers working with governments and organizations to preserve Earth’s\ncryosphere.\n\n* ICCI programs targets the climate dynamics of cryosphere, focuses on the global implications of\ncryosphere warming.\n\nHighlights of the report ICECAP\n\n* Nearly all tropical i CA pd a) . CRYOSPHERE\nglaciers, most mid- J =) 7\nlatitude glaciers, and ICEBERG\npolar regions will SEAICE J ICE SHELF\n\ndisappear even if the J\ntemperature rises by 2°\nCelsius.\n\n« Himalayas expected to\nlose 50 % of today’s\nice if global average\ntemperatures touch\n2°C.\n\n* The last decade witnessed the 7 worst years of ice loss.\n\nAbout Cryosphere\n\n« Frozen part of the planet.\n* Cryosphere's Role in Global Climate\no Help to regulate Earth’s temperature: due to high Albedo.\n¥ Albedo is the fraction of light that a surface reflects.\no Store Carbon: Permafrost has trapped tonnes of carbon inside its soil.\no Water availability: Contains 80% of the world's fresh water in the form of glaciers, ice sheets, etc.\n* Ice melt in cryosphere causes extreme Weather Events and sea level rise.\n* India’s Initiatives to protect cryosphere: National Mission for Sustaining the Himalayan Ecosystem;\nestablished a Centre for Himalayan Glaciology in Wadia institute, etc.\n\n\n{1.1.2.1. ICE MELT IN WEST ANTARCTICA\nWhy in the News?\n\nAccelerated ice melt was noticed in West Antarctica through various studies and computer simulations.\nMore on the news\n\n* West Antarctic ice sheet, if completely lost, could contribute to sea level rise of up to 5 meters.\n\n* Ocean-driven melting of floating ice shelves in the Amundsen Sea is the main process contributing to sea-\nlevel rise.\no The Amundsen Sea is located off the coast of West Antarctica.\n\nSequence of ice melt- Anta rctica\n\n* Melting causes the retreat of the grounding line (i.e.\nthe line where the ice first goes afloat).\n\n* It reduces the resistance to ice flowing across the\ngrounding line.\n\n« Faster flow near the grounding line causes more\nhorizontal stretching leading to thinning.\n\n* It creates steeper surface slopes which increases\nthe stress that drives the ice forward,\n\n* The faster flow inland causes thinning to propagate\neven further into the interior of the ice sheet,\nincreasing the contribution to sea level rise.\n\nGlobal efforts to safeguard Antarctica\n\n« Antarctic Treaty, signed in 1959, with the objectives to\ndemilitarize Antarctica, promote international scientific cooperation etc. (India is a member).\n\n* Convention for the Conservation of Antarctic Seals, 1972\n\n* Convention on the Conservation of Antarctic Marine Living Resources, 1982 (ratified by India)\n\n* Protocol on Environmental Protection to the Antarctic Treaty (Madrid Protocol), 1991 (signed by India)\n\nIndia\n\n« Indian Antarctic program, which began in 1981, built three research base stations in Antarctica, named\nDakshin Gangotri (1983), Maitri (1988) and Bharati (2012).\n\no Asof today, Maitri and Bharati are fully operational.\n\n* The Antarctic Act, 2022: Enacted by India to give effect to Antarctic Treaty, Convention on the\nConservation of Antarctic Marine Living Resources, and Protocol on Environmental Protection to the\nAntarctic Treaty and for matters connected.\n\no Key provisions: Establishment of Committee on Antarctic Governance and Environmental\nProtection; Permit system; Constitution of Antarctic fund; Stringent penalties; Designated court to\ntry punishable offences etc.\n\n1.1.2.2. ARCTIC AMPLIFICATION\n\nWhy in the News?\n\nWorld Metrological Organisation (WMO) study highlighted that Arctic has warmed twice as much as world\naverage.\n\nAbout Artic Amplification\n\n« Refers to warming differential between the poles and the tropics.\n« As per some other studies, Arctic has warmed nearly 4 times faster than the rest of the world over 1979-\n2021.\n\n« Reasons for faster warming of Arctic region\no Polar amplification is much stronger in the Arctic than in Antarctica as it is an ocean covered by sea\nice, while Antarctica is an elevated continent with permanent ice and snow.\no Melting of the ice cover in the Arctic exposes more land/water to the Sun, leading to more absorption\nof sunlight.\no Prevailing systems of air circulations transfer heat from the tropics to the poles.\n« Summer Arctic sea ice extent is shrinking by 12.6% per decade as a result of global warming.\n\n* Importance of Arctic seaice Po\nArctic Amplification “4\n\nThe dynamics of global warming\n\no Role in keeping polar\n\nregions cool and\nmaintaining earth’s\nenergy balance.\n\no Keeps the air cool by\nforming a barrier between\ncold air above and\nrelatively warmer water\nbelow.\n\no Changes in sea ice can\naffect biodiversity and\nimpact mammals such as\n\nMore aerosol\npolar bears and walruses. particles in the\no Affects traditional ———\n\nsubsistence hunting\nlifestyle of indigenous populations such as Yup’ik, Ifupiat, and Inuit.\n* Reduced ice can open up shipping lanes and increase access to natural resources in Arctic region.\n\nRelated concept: Blue Ocean event\n\n* Refers to a situation in which the Arctic Ocean’s ice area drops below 1 Million Sq.Km leading to the\nchange of arctic surface colour from white to blue.\n\n* Process reduces the amount of sunlight reflected into space, leading to further warming and ice loss.\n\n1.2. INTERNATIONAL CONFERENCES, CONVENTIONS AND INITIATIVES\n\n1.2.1. 28TH CONFERENCE OF THE PARTIES (COP28)\n\nWhy in the news?\n\n28\" COP28 of the United Nations Framework Convention on Climate Change (UNFCCC) was held in Dubai,\nUAE.\n\nAbout COP\n« Annual conferences of UNFCCC to discuss on ways to address climate crisis.\no Meetings review of the Nationally Determined Contributions (NDCs), submitted by member\ncountries under Paris Agreement (2015).\n« Final document called UAE Consensus adopted during COP28.\n* Azerbaijan and Brazil to host COP29 (2024) and COP30 (2025), respectively.\nKey outcomes of COP28\nPillars of COP28 | Key outcomes\nFixing climate * Operationalized Loss and Damage (L&D) Fund\nfinance o First announced during COP27 in Sharm el-Sheikh (Egypt) in 2022\no Meantto compensate countries already dealing with climate change.\nY L&D refers to the negative consequences arising from the unavoidable\nrisks of climate change, like rising sea levels, heatwaves, crop failures, etc.\n\n\n¥ Warsaw International Mechanism (WIM) for L&D was established at\nCOP19 in 2013 in Warsaw (Poland) to address L&D associated with climate\nchange in developing countries.\no Will be administered by the World Bank as a World Bank-hosted Financial\nIntermediary Fund for an interim period of four years.\n¥ But managed by an independent secretariat.\no Countries including UAE, Germany, UK, Japan, etc., pledged money to the fund.\nMobilization of $83.9 billion to climate finance in the Green Climate Fund,\nAdaptation Fund, Least Developed Countries Fund, and Special Climate\nChange Fund.\nDeclaration on a Global Climate Finance Framework (India part of the\ndeclaration).\n\nFocusing on\npeople, lives and\nlivelihoods\n\nFirst implementation report of Sharm el-Sheikh Adaptation Agenda (SAA) was\n\nreleased.\n\nCOP28 UAE Declaration on Agriculture, Food, & Climate\n\nCOP28 UAE Declaration on Climate and Health\n\no Released by United Arab Emirates (UAE) in partnership with the World Health\nOrganization (WHO)\n\no Signed by over 120 countries including US, UK, Brazil etc.\n¥ India has not signed yet.\n\nCOP28 UAE Declaration on Climate Relief, Recovery & Peace\n\nAdoption of Global Goal on Adaptation-UAE Framework for Global Climate\n\nResilience.\n\no Guides long-term adaptation efforts, in the context of the temperature goal\nreferred to in Article 2 of the Paris Agreement.\n\no Global Goal on Adaptation is a collective commitment under Article 7.1 of the\nParis Agreement aimed at enhancing world's adaptive capacity, strengthening\nresilience and reducing vulnerability to climate change.\n\nUnderpinning\neverything with\nfullinclusivity\n\nLaunch of the COP 28 Gender-Responsive Just Transitions and Climate Action\nPartnership.\n\nAppointment of the Youth Climate Champion to serve as the missing bridge\nbetween the COP Presidency and youth stakeholders.\n\nReports released at COP28\n\nReport Details\nReport on « Released by: Independent High-Level Expert Group on Climate Finance (IHLEG)\nclimate finance o Formed by COP26 Presidency, to develop policy options and recommendations\nto promote investment for UNFCCC Paris Agreement.\n° Key findings\no Global climate finance committed more than tripled over last decade but still too\nlow.\no Climate finance concentrated in developed economies and China, and in\nmitigation rather than adaptation.\nAneye on e Released by: International Methane Emissions Observatory (IMEO)\nmethane Report o MEO works under the UN Environment Programme (UNEP).\n\no Launched at the G20 Leaders’ Summit (2021).\nProvides decision-makers a framework, to track and monitor methane emissions, to\nplan targeted and ambitious actions for their mitigation.\n\n\nAbout UNFCCC\n\nAn international environmental treaty seeking to reduce greenhouse gases to prevent global warming.\n\n* Genesis: Signed in 1992 at United Nations Conference on Environment and Development also known\nas the Earth Summit and is Headquartered in Bonn (Germany).\n\n* Secretariat: Bonn, Germany\n\n* Members: 197 parties (including India)\n\n« Key Agreements:\no Paris Agreement\n\n¥ Adopted in 2015 (legally binding)\n\n¥ Goal: To keep the global average temperature increase well below 2°C above pre-industrial\nlevels, with efforts to limit the rise to 1.5°C.\n\nKyoto Protocol (Adopted in 1997, entered into force in 2005)\n\n¥ Committed industrialized countries and economies in transition to limit and reduce GHG\nemissions in accordance with agreed individual targets.\n\n¥ Commitments ended in 2020.\n\n« Initiatives: Momentum for Change Climate Neutral Now (launched by UNFCC Secretariat)\n\no It urges Individuals, Companies and Governnments to achieve Climate neutrality through three steps\nnamely; Measuring the climate footprint, Reducing and Offsetting the emissions.\n\nReports released by UNFCCC\n\n°\n\nDet\n\n* Global stocktake is a process for countries to see whether they are collectively making\nprogress towards meeting the goals of the Paris Agreement once every 5 years.\n\n* Global Stocktake (GST) calls on Parties to the Paris Agreement, to follow 8 steps-\n\nro\n8 Steps\nTripling renewable ‘Accelerating efforts Accelerating efforts Transitioning away\nenergy capacity towards the globally towards net from fossil fuels in\nglobally and phase-down of zero emission energy | | nergy systems, ina\ndoubling the global unabated coal systems, utilizing just, orderly and\naverage annual rate power. zero- and equitable manner.\nof energy efficiency low-carbon fuels well\nimprovements by before or by around\n2030, L mid-century.\nB hccele . & =\nrating =~» Accelerating and Accelerating the Phasing out\nlow-emission substantially reduction of inefficient fossil fuel\ntechnologies, reducing emissions from road subsidies.\nincluding, non-carbon-dioxide transport.\nrenewables, nuclear emissions globally.\n‘and carbon capture\nutilization and\nstorage(CCUS).\n\n« The draft framework for Global stocktake was released during the Bonn climate meet.\n.\n\nParis Implementing latest NDCs will increase emissions by approximately 8.8% by 2030,\nAgreement relative to 2010 levels.\n\nSynthesis | + 40% of Parties outlined the roles of local communities and rights of Indigenous Peoples\nReport in adaptation components of NDCs.\n\n\n$1.2.1.1. KEY INITIATIVES LAUNCHED IN COP28\n\nInitiative Launched/Initiated [Features\n\nGlobal Green Serve as the international platform for dialogue,\nCredit Initiative collaboration, and the exchange of innovative\n(GGCl) environmental programs and instruments.\n\no Also referred as Global Platform for Nature's\nEcological Transformation.\n\nKey Purposes:\n\n© Sharing of global technical know-how and experiences.\n\no Shaping green credit policy instruments.\n\n© Supporting implementation (practice component) by\nCreating one common value chain.\n\nFeatures of GGCI\n\no ‘Green Credit' system, envisages a fully digital and\ntradable instrument for environmental sustainability.\nGreen Credit Portal,’ a repository documenting\nplantations and environmental projects working to shape\nglobal demand for future policies.\n\n© Aligned with the principles of the Green Credit program\n(GCP).\n\n“Green credits” focus on voluntary environmental\nactions involving the community, private industry and\n\nindividuals.\n\nGlobal Signed by 118 Aim:\nRenewables and countries on the Triple the global installed renewable energy capacity\nEnergy sidelines of to at least 11,000 GW and\nEfficiency COP28 Double the global energy efficiency improvement rate\nPledge India not a to more than 4% by 2030.\n\nSignatory Phase down unabated coal.\nThe Global Initiated by UAE\n\nCooling Pledge India not a Commits the countries to reduce their cooling\nSignatory emissions by at least 68% by 2050.\nTo increase access to sustainable cooling by 2030.\nTo increase the global average efficiency of new air\nconditioners by 50%.\nEmission targets draw on the modelling from the UNEP Cool\nCoalition report Global Cooling Watch 2023 Keeping it\n\nChill.\nFossil Fuel, Oil Signed by 50|* Aglobalindustry Charter dedicated to speeding up climate\nand Gas companies, action and achieving high-scale impact across the oil and\nDecarbonization | representing more gas sectors.\nCharter (OGDC) | than40%ofglobaloil| + Key initiative under Global Decarbonization Accelerator\nproduction (GDA), launched at World Climate Action Summit recently.\n\n© GDAis focused on three key pillars:\nY Scaling energy system of tomorrow;\nY  Decarbonizing energy system of today; and\nv Targeting methane and other non-CO2 greenhouse\n\ngases.\nAfrica Green African leaders | * Aims to accelerate green growth of industries in Africa and\nIndustrialisation | launched at COP28 attract finance and investment opportunities.\n\nInitiative (AGII)\n\n",
                        "extracted-code": ""
                    }
                ]
            }
        ]
    }
}