{
    "New item": {
        "chapters": [
            {
                "chapter_id": 1,
                "chapter_name": "1. GROWTH AND DEVELOPMENT",
                "chapter_path": "./screenshots-images-2/chapter_1",
                "sections": [
                    {
                        "section_id": 1.1,
                        "section_name": "1. GROWTH AND DEVELOPMENT",
                        "section_path": "./screenshots-images-2/chapter_1/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_1/section_1/55455cf2-68cc-4086-85ba-50ee0ac20a33.png",
                            "./screenshots-images-2/chapter_1/section_1/dca8ed8f-c28e-40a4-bf12-2c258ac86e66.png",
                            "./screenshots-images-2/chapter_1/section_1/3686a038-49e5-4b43-9781-f9f8b182a597.png",
                            "./screenshots-images-2/chapter_1/section_1/4588cda3-e051-4df5-8f49-0eee5d139d96.png",
                            "./screenshots-images-2/chapter_1/section_1/058831a5-2196-4493-b75b-c44bd9d71096.png",
                            "./screenshots-images-2/chapter_1/section_1/b1763f6c-061c-4a46-87ef-c25fa1904bc7.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "1.1. GROSS DOMESTIC PRODUCT (GDP) ESTIMATION IN INDIA\nWhy in the news?\n\nIndia recorded real GDP growth of 7.8% during the April-June period of 2023-24.\n\nPresent GDP Calculation in India\n\n« Realand Nominal GDP: The MoSP! calculates quarterly GVA (gross value added) at constant prices (2011-\n12) [Real GDP] and current prices [Nominal GDP].\n*¢ GDP Deflator: The ratio of Nominal GDP to Real GDP.\nco Itreveals the increase in GDP that has happened on account of higher prices rather than an increase\nin output.\n\nGDP Calculation Approaches\n* Production Approach: It sums the “value-added” at each stage of production.\n* Income approach: It measures the total income earned by the factors of production.\n* Expenditure approach: It measures the total expenditure incurred by all entities on goods and services.\nDue to variations in data collection and processing, there are often gaps between the three approaches,\nwhich is considered while making the final calculation.\n\nGDP Calculation changes introduced in 2014-15\n\n* In 2015, the Central Statistics Office (CSO) introduced the new series of national accounts\nstatistics.\n\n* The Base Year of the GDP Series was revised from 2004-05 to 2011-12.\no Base year is revised periodically to take into account the structural changes which have been\n\ntaking place in the economy and to depict a true picture of the economy.\n* The new series incorporates the latest recommendations of System of National Accounts, 2008, the\ninternational guidelines on compilation of national accounts.\n\nWhy GDP is not a Very Good Marker to Challenges with (Ad\nMeasure Development? Current GDP\n* It doesn't take into account Calculation\n\nexternalities such as crime, pollution,\ninequality, and depletion of natural\nresources.\n\n« It doesn’t measure aspects like\nEnvironmental protection, family\nbonding etc.\n\nOutdated data\n\nin various\nsectors\n\nExclusion of\nproductive\nwork like\nhousehold\n\n* GDP also includes socially Negative Accounting work\nactiviti if it generates economic output. Unorganized\no E.g., the money spent on the repair Sector\nwork after the train crash is counted in\n\nGDP.\n* Non-Inclusion of Social Aspects of people's life such as state of health, quality of education, etc.\n\n1.2. NATIONAL MULTIDIMENSIONAL POVERTY INDEX (MPI)\n\nWhy in the news?\n\nNITI Aayog released a discussion paper titled ‘Multidimensional Poverty in India since 2005-06’ . The paper uses\nNational MPI for estimating Multidimensional Poverty.\n\nKey finding of the discussion paper\n\n* Steep decline in Poverty Headcount ratio (H): 29.17% in 2013-14 to 11.23% in 2022-2023.\no 24.82 crore Indians escaped multidimensional poverty in last 9 years.\no Intensity of Poverty is also declining which shows that extent of deprivation among the deprived\npopulation is falling.\nco The pace of decline in poverty headcount ratio was much faster between 2015-16 to 2019-21\ncompared to 2005-06 to 2015-16.\n« Uttar Pradesh, Bihar, Madhya Pradesh, Odisha, and Rajasthan saw fastest reduction in the proportion\nof multidimensional poor.\n* All12 indicators saw a statistically significant reduction.\no Cooking Fuel and Housing have the highest deprivation level of deprivation.\no Child & Adolescent Mortality, Electricity, and Bank Account have the lowest deprivation levels.\n« India is on track to achieve SDG Target 1.2 (reducing multi-dimensional poverty by at least half) much\n\nahead of 2030.\nDo you know ©) ieee\n\nAbout National MPI\n> The Alkire-Foster (AF) methodcan :\nshow both the breadth (incidence)\nand depth (intensity) of poverty.\n> To identify the poor, the AF method :\ncounts the overlapping or H\nsimultaneous deprivations thata\nperson or household experiences in ?\ndifferent indicators of poverty. ;\n\n«First ever National MPI was released in 2021 (based on data\ntaken from NFHS-4 ).\n\n« Under the government’s Global Indices for Reforms and\nGrowth (GIRG) initiative, NITI Aayog is the nodal agency for\nMPI.\n\no GIRG monitors India’s performance on various\nimportant social and economic parameters.\n\n* Methodology used in Computing India’s National MPI\n(Alkire-Foster Methodology): It identifies people as poor or not poor based on a dual-cut-off counting\nmethod.\n\no According to the AF methodology, an individual is considered MPI poor if their deprivation score\nequals or exceeds India’s national MPI poverty cut-off of 33.33%.\n\nSub-indices of the National MPI:\n\n* Headcount ratio (H): How many are poor?\no Proportion of multidimensionally poor in the population is arrived at by dividing the number of multi-\ndimensionally poor persons by the total population.\n* Intensity of poverty (A): How poor are the poor?\no Average proportion of deprivations which is experienced by multidimensionally poor individuals.\no Tocompute intensity, the weighted deprivation scores of all poor people are summed and then divided\nby the total number of poor people.\n« MPl value is arrived at by multiplying the headcount ratio (H) and the intensity of poverty (A), reflecting\nboth the share of people in poverty and the degree to which they are deprived.\n\nIndicators in India’s National MPI\n\n* National MPI model retains the 10 original indicators of the global MPI model and has added two\nindicators, viz., Maternal Health and Bank Account.\n\nDimension | 12 Indicators AHousehold is Considered Deprived If-\n\n(Weight)\nHealth Nutrition (1/6) * A single member of the household is identified as\n(1/3) undernourished.\n\n* Body Mass Index of a woman (15 to 49 years) or a man (15 to 54\nyears) is below 18.5 kg/m?.\n\n* Any child between the ages of 0 to 59 months is found to be\nundernourished.\n\n\nChild &Adolescent | * Any child or adolescent under 18 years of age has died in the\n\nMortality (1/12) household (5 year preceding the survey).\nMaternal Health « Any woman in the household who has given birth has not received\n(1/12) at least 4 antenatal care visits (5 years preceding the survey).\nEducation | Years of Schooling * Noteven one member of the household aged 10 years or olderhas\n| (173) (1/6) completed 6 years of schooling.\nSchoolAttendance |« Any school-aged child is not attending school up to the age at\n(1/6) which he/she would complete class 8.\nStandard Cooking Fuel (1/21) | * Ahousehold cooks with dung, agricultural crops, shrubs, wood,\n| of Living charcoal or coal.\n(1/3) Sanitation (1/21) * The household has unimproved or no sanitation facility or it is\n| improved but shared with other households.\nDrinking Water * The household does not have access to improved drinking water\n(1/21) or safe drinking water is at least a 30-minute walk from home (as.\n\na round trip).\nElectricity (1/21) * The household has no electricity.\n\nHousing (1/21) * The household has inadequate housing i.e., the floor is made of\nnatural materials, or the roof or wall are made of rudimentary\n\n| materials.\nAssets (1/21) * The household does not own more than one of these assets-\n\nRadio, TV, telephone, computer, animal cart, bicycle,\nmotorbike, or refrigerator, and does not own a car or truck.\nBank Account (1/21) | * No household member has a bank account or a post office\naccount.\n\n(*Kindly note - Per capita income, Literacy rate, and Life expectancy are not included as indicators in MPI)\n\nGlobal Multidimensional Poverty Index (Global MP!) 2023\n* Released by the United Nations Development Programme (UNDP) and the Oxford Poverty and Human\nDevelopment Initiative (OPHI) since 2010.\n* MPItracks deprivations in 10 indicators across 110 countries.\n© 1.1 billion people in 110 countries remain Multidimensionally poor.\n* Nearly two-thirds of all poor people (730 Mn) live in middle-income countries, and low-income\ncountries constitute only 10% of MPI.\n\n1.3. DIRECT BENEFIT TRANSFER (DBT)\n\nWhy in the news?\n\n{ Schemes under DBT\n\nThe government has saved Rs 2.73 lakh crore of eS\ntaxpayers’ money from 2014 to 2023 by adopting\nDirect Benefit Transfer (DBT) to send money to\n\nIn-kind Other Transfer\n\ntargeted beneficiaries and weeding out bogus Cash Transfer From the government\naccounts. Transfer Given by the to different\nExample Government non-government\nAbout Direct Benefit Transfer (DBT) PAHAL, to individuals || functionaries who help\n. ‘ MGNREGA, through an in facilitation of various\n\n© Objective: Bring transparency and NSAP etc. intermediate government schemes\nterminate pilferage from the distribution of agency. E.g, till the last mile.\nfunds. Public Example - ASHA\n\n* Launch: It was rolled out in 2013 in certain Distribution workers under NHM,\n\nSystem (PDs) Aanganwadi workers\n\nunder ICDS, etc.\n\ndistricts. Later, it was implemented across\nthe country in 2014.\n\n\nNodal Agency: DBT Mission, Cabinet Secretariat under Secretary (Co-ordination & PG). Disbursements are\n\nchannelled through the Public Finance Management System (PFMS).\n\nAadhaar Requirement: Aadhaar is not mandatory in DBT schemes.\n\no Since Aadhaar provides a unique identity and is useful in targeting the intended beneficiaries, Aadhaar\nis preferred, and beneficiaries are encouraged to have Aadhaar.\n\nKey Enablers for DBT\n\nJAM (Jan Dhan, Aadhaar, and Mobiles) trinity: Enabled transfer benefits in a leakage-proof, well-targeted,\ncashless, and timely manner.\n\nBusiness Correspondents (BC) Infrastructure: Ensure that payments are disbursed to the beneficiaries on\ntime, at their doorstep, and of full value.\n\nPayments Bank: Increased the penetration level of financial services in remote areas of the country.\nMobile money: Develop a comprehensive eco-system for cashless transactions over a mobile platform\nusing Aadhaar as an identifier.\n\n1.4. SELF HELP GROUPS (SHGS)\n\nWhy in the news?\n\nRecently, the Government announced that skill development training will cover two crore women under the\n‘Lakhpati Didi' scheme, which aims to encourage them to start micro-enterprises.\n\nAbout Lakhpati Didi Scheme\n\nLaunched in 2023 by the Ministry of Rural Development.\n\nObjective: Enable rural SHG women to earn at least Rs.1 lakh per annum.\n\nApproach: It is based on a women-led development approach.\n\nActivities Covered: Women would be trained in skills like plumbing, LED bulb making, and operating and\nrepairing drones, among others.\n\nAbout Self Help Group (SHG)\n\nSHG is a village-based financial intermediary committee usually composed of 10-20 local women.\n\nIt is voluntary in nature.\n\nIndia has around 1.2 crore SHGs, 88% of them all women based.\n\nSHG success stories include Kudumbashree in Kerala, Jeevika in Bihar, Mahila Arthik Vikas\nMahamandal in Maharashtra, and Looms of Ladakh.\n\nGroup responsibility: In an SHG, all members of a group take responsibility for a loan that an individual\n\n°\n@\n\nmember takes.\nSignificance\n\nPoverty increase in Decline in\nFinancial Women Capacity Alleviation: income share of\nInclusion: Empowerment: Building: Income and informal\nCovering 100 84% are Training in from savings by loans by\nmillion exclusively financial Secondary 19% and 20%\nhouseholds women group literacy activities 28% resp.\n\n\nMajor Initiatives to Promote SHG\n\nInitiative Year/Agency\n\nKey Features\n\n Deendayal Antyodaya\n+ Yojana-\nNational Rural Livelihoods\nMission (DAY - NRLM)\n\n@ Start-up Village Entrepreneurship\nProgramme (SVEP)\n\nMahila Kisan Sashaktikaran\nPariyojana (MKSP)\n\nDeen Dayal Upadhyaya\nGrameen Kaushalya Yojana\n(DDU-GkY)\n\nCentre Sector scheme for\nproviding Drones to Women\nSelf Help Groups (SHGs)\n\n2011 as NRLM/ Ministry of\nRural Development\n\n2016/Sub-schemes under\nDAY-NRLM\n\n2011/Sub-schemes under\nDAY-NRLM\n\n2014/ Sub-schemes under\nDAY-NRLM\n\n2019/ The Government e\nMarketplace (GeM)\n\n2023/ Ministry of Rural\nDevelopment\n\nOrganizing rural poor women into\nSHGs and continuously nurturing and\nsupporting them. Renamed as\nDAY-NRLM in 2015.\n\nHelp SHGs to set-up enterprises at\nthe village level in non-farm sectors.\n\nEmpowering women in agriculture by\nmaking systematic investments to\nenhance their participation and\nproductivity, also create and sustain\ntheir agriculture-based livelihoods.\n\nSkilling the poorest of the poor youth\nbetween the ages of 15 and 35 years.\n\nTo encourage the participation of\nwomen entrepreneurs and self-help\ngroups (SHG) from the informal sector\non the GeM portal\n\nTo provide drones to 15,000 selected\nWomen SHGs during the period\n2023-24 to 2025-2026 for providing\nrental services to farmers for\nagriculture purpose.\n\n1.4.1. SHG BANK LINKAGES (SHG-BL) PROJECT\n\nWhy in the news?\n\nAs per the Ministry of Rural Development, the Bank loans of about Rs. 7.68 lakh Crore have been accessed by\n\nSHGs as of November 2023 since FY 2013-14 under the SHG-BL Project.\n\nAbout SHG Bank Linkages Project\n\n*  Itis savings-led microfinance model, launched by NABARD in 1992.\no Under this program, banks were allowed to open savings accounts, accessing credit at subsidized\nrates of interest for Self-Help Groups (SHGs).\n\n* Components of SHG-BL\n\n© Training and sensitization of Bank Branch Managers.\n\n0° Training and positioning of Bank Sakhis at Rural Bank Branches.\n\no Initiate Community Based Repayment Mechanism (CBRM) at Rural Bank Branches.\n\no Credit Linkage of SHGs.\nPhased development of programme:\n\n* Phase! (1990-2005): NABARD acted as a catalyst and RBI allowed banks to lend to SHGs. However, lending\n\nwas primarily subsidy-driven.\n\n«¢ Phase II (2006-2012): Strategic shift away from targeting individuals to group-oriented lending approach.\n* Phase III (2012-present): Launch of DAY-NRLM with dedicated architecture and professional manpower\n\nsupport.\n\no Removal of capital subsidy and introduction of interest subsidy.\n\n\n| Related News\nMicrofinance in India\n\nRecently a report titled “Micro Matters: Macro View” was released by Microfinance Industry Network\n\n(MFIN)’.\n\no MFIN is an Association of Non-Bank Finance Company Micro Finance Institutions (NBFC-MFls)\nestablished in 2009.\n\nco Itis an umbrella body of Micro Finance Institutions (MFIs) of the country.\n\nMicrofinance refers to the financial services provided to low-income individuals or groups who are\n\ntypically excluded from traditional banking.\n\nThe key findings of the report\no NBFC-MFls followed by banks are the largest provider of micro-credit amongst other regulated\nentities.\n\no MFIs‘ gross Non-Performing Assets (NPA) decreased from 5.6% (FY22) to 2.7% (FY23).\no. The share of East and Northeast states fell to 34.9% from 37.7% from last year.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 2,
                "chapter_name": "FISCAL POLICY",
                "chapter_path": "./screenshots-images-2/chapter_2",
                "sections": [
                    {
                        "section_id": 2.1,
                        "section_name": "FISCAL POLICY",
                        "section_path": "./screenshots-images-2/chapter_2/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_2/section_1/47a8fb50-da63-4540-9c2e-c5782c5dbe1a.png",
                            "./screenshots-images-2/chapter_2/section_1/cbfeb9a5-0a63-410d-9787-6710cab49ca9.png",
                            "./screenshots-images-2/chapter_2/section_1/95fe624a-dc1e-4b24-bca1-e098c37efd9e.png",
                            "./screenshots-images-2/chapter_2/section_1/5c521d19-7868-4916-a924-3ca9b59776c2.png",
                            "./screenshots-images-2/chapter_2/section_1/4035dbd7-8e01-4fa2-9e25-b8b1cd3e3873.png",
                            "./screenshots-images-2/chapter_2/section_1/177d4203-e393-423f-a807-09f77749fd30.png",
                            "./screenshots-images-2/chapter_2/section_1/0ee42217-5e2d-4088-be64-3b061c3bc145.png",
                            "./screenshots-images-2/chapter_2/section_1/21a63e76-ad3a-4bb3-a1ca-011edfbedca6.png",
                            "./screenshots-images-2/chapter_2/section_1/02d577e6-0391-495e-9461-47c7896fdd1d.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "2.1. STATE FINANCES\nWhy in the news?\n\nRecently, the Reserve Bank of India published an annual report titled “State Finances: A Study of Budget of\n2023-24”. The theme of the Report is ‘Revenue Dynamics and Fiscal Capacity of Indian States’.\n\nKey Findings of the Report\n\n* Capital outlay is budgeted to increase by 42.6 % in 2023-24 to 2.9% of GDP.\n\n* Debt-GDP ratio of states declined from 31% at end-March 2021, to 27.5% by end-March 2023, supported\nby fiscal consolidation.\n\n* States’ consolidated gross fiscal deficit to gross domestic product (GFD-GDP) ratio declined from\n4.1% in 2020-21 to 2.8% in 2021-22, led by a moderation in revenue expenditure, and an increase in revenue\ncollection.\n\n* Increased Tax Buoyancy with implementation of Goods and Services Tax (GST).\n\no Tax Buoyancy refers to the responsiveness of tax revenue receipts to changes in national income.\nv Tax buoyancy greater than 1 signifies that tax revenues grow at a faster rate than the growth in national\nincome.\n\nNK Singh Committee Recommendations\n\n* The combined debt-to-GDP ratio of the centre and states should be brought down to 60% by 2023\n(comprising of 40% for the Centre and 20% for states).\n\n« The committee suggested incorporating \"escape clauses\" that allow deviation from the fiscal targets\nunder specific circumstances, such as national security, acts of war, national calamities etc.\n\n2.1.1. STATES’ CAPITAL EXPENDITURE\n\nWhy in the news?\n\nThe Department of Expenditure, Ministry of Finance has approved capital investment proposals of Rs. 56,415\ncrores in 16 States under the ‘Special Assistance to States for Capital Investment 2023-24’ (Union Budget\n2023-24).\n\nAbout the Scheme\n\nOther Parts of the Scheme\n\n* Genesis: Similar scheme was first\n@) Part-il : incentives for scrapping Old Vehicles\n\ninstituted in 2020-21 in the wake of\nthe COVID-19 Pandemic.\n\nFS Part-ill : Urban Planning Reforms.\n\n* Objective:\no To boost to capital spending\nby States. &, Part-iv : Financing Reforms in Urban Local Bodies\no To have a higher multiplier | 2 part-v: Housing for Police Personnel within the police\neffect of capital expenditure. . ng in\n\n« Assistance: 50-year interest-free\nloan up to an overall sum of Rs. 1.3\nlakh crore to the States.\n\n« Parts: Total 8 parts, Part-| (general\nallocation) has the largest\nallocation i.e. 1 lakh crore. Other\nparts are either linked to reforms\nor are for sector-specific projects.\n\nstation area\n\nPart-VI: Construction of Unity Malls to promote\nnational integration\n\nPart-Vil : Children and Adolescents Libraries and\nDigital Infrastructure\n\nPart-Vill: Incentive for implementing timely release of\nCSS funds by state governments to vendors and\nbeneficiaries\n\n\no The amount under Part-I has been allocated amongst States in proportion to their share of central\ntaxes & duties as per the award of the 15\" Finance Commission.\n\nTrends in Capital Expenditure (Capex) by States\n\n* Capex growth remained the same in FY23 compared with 29% growth in FY22.\n\nco The expenditure by states on subsidies rose at a faster pace even as their capital spending slowed\ndown in FY23.\n\no Capex also known as Capital expenditure is the part of the government spending that goes into the\ncreation of assets like schools, colleges, hospitals, roads, bridges, dams, railway lines, airports and\nseaports.\n\n* Capex Target: According to a study by the Bank of Baroda, 25 states have cumulatively achieved 76% of\ntheir capex target in FY23.\n* Capital outlay-GDP ratio: The States’ Capital outlay-GDP ratio is expected to improve from 2.3% in 2021-\n\n22 to 2.9% in 2022-23.\n\nCentre’s Support to States to Increase Capex\n\n« Early Release of Funds: The Centre has also been releasing tranches of tax devolution early to help\nstates front-load capex rather than wait till the end of the fiscal.\n* The Central government has regulated states’ borrowings under Article 293 of the Constitution from FY23.\no The Centre tightened borrowing norms for the states by including off-budget liabilities as part of the\nstates’ annual net borrowing ceiling.\n* Production-Linked Incentive (PLI) scheme: It is providing capital expenditure-linked incentives to 14 key\nsectors.\n\n2.2. PUBLIC DEBT\n\nWhy in the news?\n\nThe International Monetary Fund (IMF), in its annual Article IV consultation report has highlighted that India’s\npublic debt to GDP ratio at the general\n\ngovernment level has barely increased from Public debt ~\n81% in 2005-06 to 84% in 2021-22 and back to\n81% in 2022-23. }\n\n* Under Article IV of the IMF's Articles of\n\nAgreement, the IMF holds bilateral Marketable Non- Marketable\n\ndiscussions with members, usually every Securities Securities Most of the\n\nyear. external debt\nis from\n\n* The report suggests that Indian Growth is\nexpected to remain strong, supported by\nmacroeconomic and financial stability.\n\nAbout Public Debt\n\n* Public Debt denotes liabilities payable by\nthe Central Government, which are contracted against the Consolidated Fund of India, as provided\nunder Article 292 of the Constitution of India.\n\n* Current Status of Public Debt in India:\n\no Central Government’s Public Debt stood at 57.1 % of GDP as of the end of March 2023.\no General Government Debt was 81% of GDP in 2022-23.\n¥ General Government Debt represents the indebtedness of the Government sector (Central, State\nGovernments and UTs with legislature).\no Internal Debt constituted 94.6 % of Public Debt at end-March 2022.\n\nA . , multilateral\nintermediate T-Bills, agencies\nSecurities against such as IDA,\n\nSmall Savings, etc. IBRD, ADB etc\n\nG-sec, T-Bill,\nand Cash\nManagement|\nBills\n\n\nReasons and implications of High Public Debt\n\nReasons | Implications\n* Fiscal stimuli to support the economy during | ¢ Limits fiscal resources for meeting emerging\nthe Covid-19 pandemic. priorities, like climate change adaptation, green\n* India has been investing significantly in transition etc.\ninfrastructure projects to support economic | High-interest payments account for 5% of GDP\ngrowth. (in India), roughly twice the emerging market and\n* Extensive social welfare programs without developing-country average.\ncorresponding revenue streams can lead to| « Leads to a Crowding out effect i.e., a reduction\nincreased borrowing to fund these programs. in private investment spending due to increased\n* Increased costs of servicing interest debt. interest rates.\nRelated news\n\nWorld Bank’s Report on External Debt\n« World Bank releases its annual International Debt Report (IDR), 2023.\n* The report analyses external debt statistics for 122 low- and middle-income countries (LMICs).\n\n* Key highlights\n© Historic rise in debt: Public and publicly guaranteed (PPG) debt service payments by LMICs totaled\nUS$443.5 billion in 2022.\n\no Debt Service cost: Due to rising interest rates and unfavourable exchange rate movement,\nservicing external debt could become burdensome.\nv India’s debt service was 2% of the GNI in 2022.\n\n© Crowding out of priorities: Debt servicing could crowd out spending on other development priorities\n(health, education, etc.).\n\n© Outflow of money: Due to a tighter monetary policy in advanced economies, investors found\nattractive returns in US and European bond markets.\n\n|2.2.1. OFF-BUDGET BORROWINGS\n\nWhy in the news?\n\nCentre for Social and Economic Progress (CSEP) recently released a report on ‘Off-Budget Borrowings (OBB)’\nby Indian Governments.\n\nAbout OBBs\n\n« OBBs refer to borrowings that are not reflected in the budget, even though budgetary resources will have\nto be used for their repayment.\noc. Thus, OBB is not part of the calculation of the fiscal indicators despite fiscal implications.\n\n* OBBs are taken not by government directly but by another public institution on its direction.\no For example, loan by FCI for paying food subsidy bill (this practice is discontinued from FY 2020-21).\n\nReasons for resorting to OBB\n\n« Bypass Fiscal Deficit targets under the FRBM Act, 2003,\n« Avoid borrowing limits under Article 293 (3) of the Constitution.\n\no Article mandates States to take consent of the Centre before raising any loan if they have any\noutstanding loan to the Centre or loans where the Centre is the guarantor.\n\n« Avoid delay in central grants, or reduction in other sources of revenue.\nImplications of high OBB\n\n« Ahidden liability that may lead to a debt trap for the government.\n\n« Adversely affects the accountability as it is generally scrutinized.\n\nMethods of OBB: National Savings Schemes Government Fully Serviced Bond, Domestic /Foreign Market\nborrowings, etc.\n\n2.3. CURRENT ACCOUNT DEFICIT (CAD)\n\nWhy in the news?\n\nThe CAD widened to $9.2 billion from $1.3 billion in Quarter 1 of Financial Year 2024. Although, later it declined\nto 1% of gross domestic product (GDP) in Quarter 2 (2023-24).\n\nAbout Current Account Deficit (CAD)\n\n* Balance of Payments (BoP) records the transactions in goods, services, and assets between residents of a\ncountry with the rest of the world for a specified time period typically a year.\n\n* Current Account is one of the two accounts in the Balance of Payments (BoP). It records exports and\nimports in goods and services and transfer payments of a country.\no Transfer payments are receipts received by the residents ‘for free’, without any present or future\n\npayments in return. It includes remittances, gifts and grants.\n\n* Capital account is the second account, recording all international purchases and sales of assets such as\n\nmoney, stocks, bonds, etc. for a specified time, usually a year.\n\noe\n(2 Balance of Payment (BOP)\nS\nCY\n(Hi visible} (geInvisible\n— re E> # si\nInvestmen Loan Bank A/c\nud © & TOI, Fil Goverment NRI\nCrude oil, Cars, incom _ External\nComputers, Gold rrowings\nP etc. Services+ Interest Domations 9\n(Import-Export) dividend Gifts\n\nReasons behind India’s increased CAD\n\n« Higher trade deficit: Increased imports and decreased exports have contributed significantly to the\nwidening of CAD.\n\n* Services Receipts Decline: Net services receipts decreased, primarily due to reduced exports of computer,\ntravel, and business services.\n\n* Impact of Global Factors: Slowing global growth has implications for India's export-oriented services and\nremittances, adding to the challenges in maintaining a lower CAD.\n\ne Rising Oil Prices: Anticipated increase in oil prices is expected to further widen the merchandise trade\ndeficit. Higher oil prices contribute to increased import costs, affecting the overall CAD.\n\n« Foreign Direct Investment (FDI) Decline: Net FDI declined in the financial account, influencing the overall\nbalance.\n\nPotential threats from increasing CAD\n\nBased on historical perspective, India can sustain a CAD of 2.5-3.0% of GDP without getting into an external\nsector crisis (Economic Survey 2021-22). But a deficit beyond that can have an impact on following -\n\n« Foreign investment: Pull out of foreign institutional investors or limited capital flow.\n\n« Exchange Rate: High Current Account Deficit for a long term decreases the global demand of the currency\nand can lead to a situation of free fall in currency exchange rate.\n\n« Inflation: Price instability in turn fuels inflationary concerns, leading to further reduction in domestic\nsavings, leading to lower investments or foreign borrowing to fund growth needs.\n\n« Payment imbalances: They can lead to a BoP crisis as was observed in the Asian Financial Crisis (1997) and\nthe recent Sri Lankan crisis.\n\n2.4. DATED SECURITIES\n\nWhy in the news?\n\nThe Centre will borrow %6.55 trillion from the market for the second half of the on-going financial year. This\nmarket borrowing will finance the government's budgeted fiscal deficit of 5.9% of GDP.\n\nWhat are G-Secs?\n\n« G-Secs are tradeable instruments issued by the Central Government or the State Governments which\nacknowledges the Government's debt obligation.\n\n« G-Secs carry practically no risk of default and, hence, are called risk-free gilt-edged instruments.\n\n* Dated G-Sec’s are securities which carry a fixed or floating coupon (interest rate) which is paid on the\nface value, on half-yearly basis.\no Generally, the tenor of dated securities ranges from 5 years to 40 years.\n\nOther Types of G-Secs ]\nTreasury Bills(T-bills) | * These are short term debt instruments issued by the Centre in three tenors,\nnamely, 91 day, 182 day and 364 day.\n«  Theyare zero coupon securities and pay no interest. Instead, they are issued\nat a discount and redeemed at the face value at maturity\n\nCash Management * CMBs are similar to T-bills but are issued for maturities less than 91 days.\nBills (CMBs)\n\nState Development e SDLs are dated securities issued through normal auctions by the State\nLoans (SDLs) Governments similar to Dated G-Secs.\n\nHow are the G-Secs issued?\n\n* Mechanism: G-Secs are issued through auctions conducted by RBI on its electronic platform called the\nE-Kuber.\n\n* Participation: Commercial banks, Scheduled Urban Cooperative Banks, Primary Dealers, insurance\ncompanies and provident funds who maintain funds account (current account) and securities accounts with\nRBI, are members of E-Kuber and take part in the auction.\n\no Foreign Portfolio Investors (FPIs) and Corporates are also allowed to participate in the G-Secs\nmarket.\n\n0° This is done within the quantitative limits prescribed from time to time through Scheduled Bank or a\nPrimary Dealer or Specified Stock Exchange.\n\n* The RBI conducts Open Market Operations (OMOs) by way of sale or purchase of G-Secs to or from the\nmarket with an objective to adjust the rupee liquidity conditions in the market on a durable basis.\n\n| Risks associated with Dated Securities (G-Secs) |\n\n@ 2 2\n\nMarket risk- arises out of Reinvestment Risk- it is the risk Liquidity risk- It is the inability of\n\nadverse movement of prices of where future proceeds like an investor to liquidate sell) his\n\nthe securities due to changes coupon payments or debt holdings due to non-availability\nin interest rates resulting in principal, will need to be of buyers for the security.\n\nvaluation losses reinvested at a lower interest\n\nrate compared to the original\nyield\n\n\nRelated news o\n\nBond Yield Bond Prices and Yields\n\n* Recently, RBI’s decision for Open Market oe\nOperation (OMO) sale of government gon\nsecurities (G-Sec) triggered a spike in bond yo\nyields to their highest level in FY 2023-24. we\n\n* A bond's yield is the return an investor\nexpects to receive each year over its term to |\nmaturity.\no The yield is also commonly referred to as an interest rate, or the “cost of borrowing” to an issuer.\n\n* The yield of a bond is inversely related to its price. When the price of a bond falls, yields rise.\n\n2.5. GOODS AND SERVICES TAX (GST)\n\nWhy in the news?\n\nThe 50\" GST council meeting imposed a GST of 28% on online gaming, horse racing and casinos.\nKey Highlights\n\n* Tax Rate: 28% tax applied on the initial amount paid upon entry, not on the total value of each bet placed.\no Covers both games based on both skill and\nchance. A TDS of 30% is deducted from the | TYPeS of Online Games\nwinnings in both game types. * Game of Skill: Games in which the outcome\n* Tax on offshore online gaming firms: Such econ o the ene Co\ncompanies will have to register themselves with the ae a\nGST authorities and pay the tax to offer their Gee ;\nservices to Indian gamers. * Game of Chance: Games in which the\n\no Amendment to the Integrated GST Act 2017 will outcome is decided by randomised events\nbe made to enforce this. and treated similarly to betting, gambling and\n\nhorse racing.\nAbout Goods and Services Tax (GST)\n\n« GSTis a single domestic indirect tax law for the entire country. It is a multi-stage, destination-based tax\nthat is levied on every value addition.\n\n« It came into effect on 1st July 2017 (101st Constitutional amendment) replacing indirect taxes in India\nsuch as the excise duty, VAT, services tax, etc.\no Theidea of a nationwide GST in India was first proposed by the Kelkar Task Force on indirect taxes in\n\n2000.\n\n* Pratidin: A web based daily performance management system for GST was recentky established in Central\n\nBoard of Indirect Taxes & Customs (CBIC).\n\nGST Structure\n\n* Central GST (CGST): It is collected by the Central Government on an intra-state sale.\no Revenue is shared equally between the Centre and the State.\n\n* State GST (SGST): It is collected by the state government on an intra-state sale.\no Revenue is shared equally between the Centre and the State.\n\n* Interstate GST (IGST): It is collected by the Central Government for an inter-state sale.\no The Centre shares the IGST revenue with states based on the destination of goods.\n\nNeed for GST\n\nEstablishment\nof a single\n\nnational\nmarket\n\n= % a oy &\n\nComplicated _ Issues like Tax Need for Limited Ease High cost of\nTaxation Cascading Incorporation of doing tax collection\nRegime of technology business\n\nInstitutions/Bodies of GST\n\nGST\nNetwork\n(GSTN)\n\n.\n\nGSTN, a not-for-profit company, was created to provide the IT backbone for the GST\nsystem, including taxpayer registration, return filing, and tax payments.\n\nGSTC has approved the conversion of GSTN into a Government Company; hence, 100%\nof the shareholding is held by Government (50% with Union Government and 50% jointly\nwith State Governments & UTs) in GSTN.\n\nGST\nAppellate\nTribunals\n(GSTAT)\n\nGSTAT is a statutory body under the Central GST Act, 2017.\n\nIt is the forum of second appeal in GST laws and the first common forum of dispute\n\nresolution between Centre and States.\n\no It is mandated to hear appeals against orders passed by Appellate Authority or\nRevisional Authority.\n\nChanges Introduced Central Goods and Services Tax (Second Amendment) (CGST) Act,\n\n2023.\n\no Change in qualification for members of GSTAT: Allows advocates with at least 10\nyears of experience to be appointed as judicial member. They must have substantial\nexperience in matters relating to indirect taxation.\n¥ Minimum age to be appointed as a member or president of GSTAT will be 50\n\nyears.\n0 Increases age limit for president of GSTAT from 67 to 70 years, and for members\nfrom 65 to 67 years.\n\nCouncil\n(GSTC)\n\nGST Councilis a constitutional body established by the President under the Article 279A.\nItis a joint forum of the centre and states.\n© Chairperson: Union Finance Minister\no Members:\nY¥ Union Minister of State, in-charge of Revenue\nv Minister in charge of finance or taxation or any other Minister nominated by each\nState government.\no Decision-making through voting: Decision requires a 3/4\" majority of members\npresent and voting.\nY Centre’s share is 33% of votes cast.\nThe Council makes decisions on various aspects of GST, including tax rates, exemptions,\nand revenue sharing between the Central and State Governments.\n\n2.6. WIDENING TAX BASE\n\nWhy in the news?\n\nRecently, the government has highlighted that introduction of new tracking features had helped in widening the\ntax base.\n\nSteps taken by the Government\n\nCross seeding of PAN with Bank Accounts and Aadhaar helping the government to track all formal\ntransactions through banks.\n\n\n* Introduction of New TDS codes from 36 to 65 codes resulted in increase in reported transactions.\n« Introduction of new data sources in the Statement of Financial Transactions (SFT), such as dividend,\ninterest, etc.\n\nCurrent Scenario of Taxation in India\n\n* Tax to GDP ratio: Tax to GDP ratio is the ratio of the tax revenue (direct &indirect tax) of a country\ncompared to the country’s GDP.\n° Taxto GDP ratio is about 11.1% in FY23 which includes Direct Taxes at 6% and Indirect taxes at 5.1%.\no It is useful measure of a country’s capacity to generate tax revenue with rest to the size of its\neconomy. A decrease in tax to GDP ratio of a country may indicate a slowing economic growth rate.\n« Filing of Income Tax Returns (ITR): 5.3% of the total population.\no The concept of Income tax was introduced in India in 1860 by James Wilson, the first finance\nMinister of British Indian Government.\no The tax was temporarily repealed during 1865-1886 and is continuing its existence till date.\n* Key statistics released by Central Board of Direct Taxes (CBDT):\no Net Direct Tax Collections have increased by 121.18% in FY 2021-22 from FY 2013-14.\no Direct tax to GDP ratio rose from 5.62% in FY 2013-14 to 5.97% in FY 2021-22\no Direct tax buoyancy at 2.52 was highest in the last 15 years.\n\nReasons for Low Tax Base\n\n* Presence of a large informal sector which largely deals in cash and makes tracking difficult.\n* Tax exemption for agriculture, which is the primary income source for nearly 60% of Indians.\n« High incidence of tax litigation: About 5 lakh cases pending in the country are because of tax litigation.\n« Lack of technical expertise and resources (financial and manpower) resulting in less effective tax\nadministration.\nRelated News\nAngel Tax\n\n* Ministry of Finance proposed changes in angel taxation and notified foreign entities which will be\nexempted from the tax provisions.\n« Angel tax, introduced in 2012, refers to tax levied on capital raised by unlisted companies.\n© Objective was to deter generation and use of unaccounted money through subscription of shares\nof a closely held company, at a value which is higher than fair market value.\n\n2.7. OFFICIAL STATISTICS\n\nWhy in the news? Characteristics of Core Statistics\n\nThe Ministry of Statistics & Programme . .\n\nImplementation (MoSPI) has || @® To be of national importance\n\nformulated a Draft “National Policy\n\non Official Statistics (NPOS)”. 2) Mandatory for government at all levels to collect and\ndisseminate as per laid down protocols\n\nMore on the news\n\n[i | Conforming to prescribed definitions, concepts and\n\n« The policy reinforces the United\nstandards\n\nNations Fundamental Principles\n\nof Official Statistics (UNFPOS)\n\n(India adopted the UNFPOS in\n2016).\n\n* Key Thrust Areas Mentioned in {ul} be made available at various disaggregated levels)\n\nthe Policy\no Creation of an Integrated Data\nSystem (IDS) to interlink data sets and enable interoperability.\n\nTo be updated periodically with pre-determined\nperiodicity\n\nSS SS ees\n\n\no Innovation Hub for piloting emerging technologies such as Artificial Intelligence (Al).\no Core Official Statistics: Key statistical products, such as GDP, price indices, SDGs, etc., will be\ndesignated as core statistics.\n\nPresent status Official Statistical System in India\n\n* Ministry of Statistics and Programme Implementation (MoSPI) is the nodal agency for planning\nintegrated development of the statistical system in the country.\n\n* Directorates of Economics & Statistics (DES) coordinates statistical activities in the State/UT.\n\n* National Statistical Commission (constituted in 2006) acts as an apex advisory body on statistical\nmatters.\no Itwas created on the recommendations of the C. Rangarajan Commission.\n\n* Place in Seventh Schedule: The subject ‘Statistics’ is covered in Entry 94 of the Union List (List - |) and\nEntry 45 of the Concurrent List (List - Ill).\n\n« Legislations: Exclusive statistical laws, such as the Census Act 1948, the Registration of Births and Deaths\nAct 1969 and the Collection of Statistics Act 2008.\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 3,
                "chapter_name": "3. LABOUR, EMPLOYMENT AND SKILL\nDEVELOPMENT",
                "chapter_path": "./screenshots-images-2/chapter_3",
                "sections": [
                    {
                        "section_id": 3.1,
                        "section_name": "3. LABOUR, EMPLOYMENT AND SKILL\nDEVELOPMENT",
                        "section_path": "./screenshots-images-2/chapter_3/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_3/section_1/3fb3afeb-783d-4b3a-bd21-e91409748eeb.png",
                            "./screenshots-images-2/chapter_3/section_1/bc74d564-3d28-42ea-a084-fee2d4e6d98f.png",
                            "./screenshots-images-2/chapter_3/section_1/b5060e41-6966-4cd2-b324-9afc0d7840dd.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "3.1. PERIODIC LABOUR FORCE SURVEY (PLFS)\n\nWhy in the news?\n\nRecently, the Periodic Labour Force Survey (PLFS) 2022-23 was released. The LFPR increased from 55.2% to\n57.9 (Male - 78.5% & Female - 37%) in 2022-23 compared to last year.\n\nAbout Periodic Labour Force Survey (PLFS) es\n\n« Launched by National Sample Survey Key findings of LFPS\nOrganization (NSSO) in 2017. [ietector\n\n* The key objective of PLFS is to estimate the key es rs\nemployment and unemployment indicators ECE\n\n(viz. LFPR, WPR, UR) annually, evaluated on LFPR | Rural\n\nactivity status-\n\no ‘Current Weekly Status’ (CWS) for the\nurban areas only in for an interval of three\nmonths.\n\no ‘Usual Status’ and CWS in both rural and\nurban areas annually.\n\nKey Indicators used in PLFS\n\n« Labour Force Participation Rate (LFPR): Percentage of persons in the labour force (i.e. working or\nseeking or available for work) in the population.\n\n* Worker Population Ratio (WPR): Percentage of employed persons in the population.\n\n« Unemployment Rate (UR): Percentage of persons unemployed among the persons in the labour force.\n\n« Activity Status: It is determined based on the activities pursued by the person during the specified\nreference period (preceding the date of the survey).\no Usual Status: Reference period is 365 days.\no Current Weekly Status (CWS): Reference period is 7 days.\n\nPLFS Findings on Gender Pay Gap\n* 1n2023, the gap in work hours was largest for self-employed workers (50% more for men), and lowest\nfor regular wage workers (19%).\ne Also, men earn more than women across all forms of work; the gap is greatest for the self-employed.\n© 1n2023, male self-employed workers earned 2.8 times that of women, whereas male regular wage\nworkers earned 24% more.\n* Labour force participation rates (LFPRs) for rural women have increased, with a significant rise in the\nproportion of self-employed women.\no However, the average hours worked per week for rural self-employed women has fallen from 37.1\nin 2019 to 30.1 in 2023.\n\n3.2. NOBEL PRIZE IN ECONOMICS: WOMEN IN LABOUR FORCE\n\nWhy in the news?\n\nThe Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel 2023 has been awarded to Claudia\nGoldin for advancing the understanding of women’s labour market outcomes.\n\nAbout Nobel Prize\ne  Itis an international award administered by the Nobel Foundation in Stockholm, Sweden, and based\non the last will of Alfred Nobel (in 1895).\n* Instituted in 1901, awarded annually in five categories to people for the greatest benefit to humankind\nin preceding year.\no The sixth category, the Nobel Prize in Economic Sciences, was instituted in 1968 by the Royal\nBank of Sweden and was first awarded in 1969.\n* Who awards the prizes?\noc The Royal Swedish Academy of Sciences awards the Nobel Prize in Physics, Chemistry and\nEconomics.\no The Nobel Prize in Literature is awarded by the Swedish Academy, Stockholm, Sweden.\no The Nobel Assembly at Karolinska Institute, Stockholm, Sweden awards the Nobel Prize in\nMedicine (Physiology).\n© The Norwegian Nobel Committee (constituted by Norwegian Parliament) awards Nobel Peace\nPrize.\n* What do the winners receive?\no ANobel diploma, each of which is a unique work of art;\no ANobel medal;\no Acash prize (set Swedish kronor (SEK) 11.0 million per full Nobel Prize for 2023)\n* The Nobel statutes prohibit the judges from discussing their deliberations for 50 years.\n\nFactors Influencing Female\nLabour Force Participation U-shaped relationship: In the development process, female labour\n\nforce participation first declines and then rises.\nGoldin’s U-curve demonstrated .\nthat there is no historically Women’s labour force participation is high for the poorest countries\n\nconsistent association between | (high in agriculture), lower for middle income countries, and then\n\nwomen’s participation in the rises again among high income countries.\n\nlabour market and economic\n\ngrowth. They are influenced by\n\nfollowing- MARRIED WOMEN\n1N WORK\n\nEvolution of Women in the Workforce e\n\n* Social Norms: Legislative\ngaps or customs known as a\n“marriage bars” often\nprevented married women\n\nfrom continuing their\nemployment despite\n\nSERVICE\nincreased demand for labour. SOCIETY\n\n* Parenthood Effect: hay ‘or\nResponsibility of childcare P| ni CONTRACEPTIVE PULL.\nmore on women than men LA fet\n“ss * (CHANGING EXPECTATIONS\n\naffected their career\nprogression. a+\n* Technological Innovations:\nContraceptive pill resulted in\nwomen delaying marriage and childbirth, thus increasing their education and career prospects.\n\nEXPANDING EDUCATION\n\nMeasures taken for reducing gender gap in India\n\n* Code on Social Security 2020 - Maternity leave to 26 weeks, mandatory Créche facility etc.\n\n* Code on Occupational Safety, Health, and Working Conditions (OSH), 2020: Employment of women in\nthe above-ground mines and in below-ground working in technical, supervisory and managerial work.\n\n* Code on Wages 2019: No discrimination among employees on the ground of gender.\n\n3.3. GIG ECONOMY\n\nWhy in the news?\n\nSeveral issues have been seen in the recent past among the gig workers including strike by Blinkit workers,\nprotest by Zomato and Swiggy delivery riders among others.\n\nAbout Gig Economy and Gig Worker\n\n« A Gig economy is a free market system in which temporary positions are common and organizations\ncontract with independent workers for short-term engagements.\n« Gig Workers are those engaged in livelihood outside the traditional employer-employee arrangement. They\ncan be broadly classified into-\no Platform Gig Workers: Those whose work is based on online software, apps, or digital platforms\nsuch as food aggregator platforms- Zomato, Swiggy, Ola, and others.\no Non-Platform Gig Workers: They are generally casual waged and own-account workers in the\nconventional sector, engaged part-time or full-time.\n\n°\n4\nReasons for increase in gig economy\n\\\nfi Ea) % 8 a\ni} ' 1 1 1\nWidespread Rapid Interoperability Changing Rising demand\naccess to the increase in ofthe Work for Contractual\ninternet the start-up platforms Approach Employees\necosystem\nRegulatory Framework of Gig Economy in India\n* The Code on Wages, 2019: It Al\nprovides for universal\nminimum wage and floor ae ToConsumers: To Employees:\nwage across organized and | {hia * Provides personalised * Provides Flexibility in\nservices, working.\nunorganized sectors,\n* Saves time and money. * Enables Remote working.\n\nincluding gig workers. ‘ .\n* Provides work-life balance.\n\n* Code on Social Security\n2020: It seeks to protect gig Significance of\nworkers’ rights by giving them Gig Economy\nsocial security protections. (t) To the country:\no It attempts to define gig, * Creates Employment. 2% To Employers:\n\nplatform, and * Serves the needs of * Low cost labour.\nvarious sectors and\n\nunorganized workers sections of the society. . Low compliance\nwhile spelling out * Helps Startups to thrive. * Diverse pool of\nentitlements. * Boosts the economy. labour.\n\no It also proposed to\nestablish a Social Security Fund and a National Social Security Board to supervise and formulate\nschemes for the well-being of gig and platform workers.\n\nOther Recent Developments Regarding Gig Economy and Gig workers\n\n* The Standing Committee on Labour, Textiles, and Skill Development has asked the Ministry of\nLabour and Employment to formulate and implement welfare schemes for Gig workers in the country.\n\n* The G20 Labour and Employment Ministers Meeting 2023 concluded by adopting an outcome\ndocument on \"Sustainable Social Protection for Gig & Platform Workers.”\n\n¢ Rajasthan State Government has pioneered in creating a welfare bill for the Gig workers in the state by\npassing a \"Platform Based Gig Workers (Registration and Welfare) Bill, 2023\".\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 4,
                "chapter_name": "4. BANKING AND MONETARY POLICY",
                "chapter_path": "./screenshots-images-2/chapter_4",
                "sections": [
                    {
                        "section_id": 4.1,
                        "section_name": "4. BANKING AND MONETARY POLICY",
                        "section_path": "./screenshots-images-2/chapter_4/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_4/section_1/c4ef22a9-1cca-427e-9d3d-ca58d4ca97c8.png",
                            "./screenshots-images-2/chapter_4/section_1/c9c20677-7fdc-42cd-8e26-31200fdbf7d1.png",
                            "./screenshots-images-2/chapter_4/section_1/c6d7ad2a-cdc7-466c-9d26-e7b63f01706f.png",
                            "./screenshots-images-2/chapter_4/section_1/ee6fe053-8822-4f42-b97f-a65fd5bb73c0.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "4.1. INCREMENTAL CASH RESERVE RATIO (ICRR)\n\nWhy in the news?\n\nThe Reserve Bank of India (RBI) used ICRR to absorb surplus liquidity in the system. Further, ICRR was\ndiscontinued in phased manner as liquidity situation stabilized.\n\nCRR and ICRR\n\n* Cash Reserve Ratio (CRR): It is the share of a bank’s Net Demand and Time Liabilities (NDTL) that is\nmandated by the Reserve Bank of India (RBI) to be maintained with the latter as reserves in the form of liquid\ncash.\n\no Net Demand and Time Liabilities (NDTL) shows the difference between the sum of demand and time\nliabilities (deposits) of a bank (with the public or the other bank) and the deposits in the form of assets\nheld by the other bank.\n\no As per the RBI Act 1934, all Scheduled Commercial Banks (that includes public and private sector\nbanks, foreign banks, regional rural banks, and cooperative banks) are required to maintain the CRR.\n\n* Incremental Cash Reserve Ratio (ICRR): |-CRR is similar to the CRR, wherein banks need to set aside a\ncertain portion of their money with the RBI. They do not earn any interest on this. It has following differences-\n\noc RBIhas the option to impose ICRR in addition to the CRR.\no Theinterest rate charged would be different from CRR.\n\ne\n\nHow ICRR is applied along with CRR?\n\nApplication of only CRR Application of ICRR with CRR\n\nLet NDTL\nbe Rs. 100\n\nLet new NDTL\nbe Rs. 150\n\nIncrease in\nNDTL be Rs. 50\n\nApplication Application\nApplication of of CRR of ICRR\nCRR at 4.5% at 4.5% at10o%\nRs.4.5 Rs. 6.75 Rs.5\n| Deposit form CRR | Deposit form CRR + Deposit form ICRR |\nTotal maintenance with Total maintenance with RBI Rs.11.75\n\nRBI Rs. 4.5\n\nEffect of ICRR\n\n* Manage Liquidity: There was a recent increase in liquidity in the economy due to a pickup in government\nspending, sustained foreign inflows, and withdrawal of Rs. 2000 notes, among others.\n\n« Inflation Control: India’s retail inflation (measured by the Consumer Price Index (CPI)) rose to 7.5% in July\ncompared with 4.9% in June. Hence requiring a tighter monetary policy.\n\n« Banking Resilience: The incremental CRR increases protection against the potential threat of Bank Run.\no Bank Run is when the customers of a bank or other financial institution withdraw their deposits at the\n\nsame time over fears about the Bank’s solvency.\n\n* Decreased Lending: Lower lending will, in turn, bring down demand for goods and services, reducing the\n\nAggregate Demand of the Economy.\n\n\nOther Liquidity Management Tools\n\n* Standing Deposit Facility (SDF): SDF allows the RBI to absorb liquidity (deposit) from banks without\ngiving government securities in return to the banks.\n\n* Altering Repo and Reverse repo rates: Altering these rates directly affects the deposit rate in banks as\nwell as their lending rates.\n\n* Open Market Operation (OMO): OMO refers to sale or purchase of government securities (bonds) by\nthe RBI.\n\n* Ways and Means Advances (WMA): It is a temporary loan facility to the central and state governments.\n\n4.2. SURPLUS TRANSFER BY RBI\n\nWhy in the news?\n\nRecently, RBI to transfer %87,416 crore as surplus (188% jump from 2021-22) to the Union government for\n2022-23.\n\nMore on the news\n\n« As RBlis not required to pay income tax, it transfers surplus amount to government in accordance with\nSection 47 (Allocation of surplus profits) of RBI Act, 1934.\nco RBI’s total expenditure is significantly lower than its total net interest income, thereby generating\n\nsurplus.\n\n« Earlier, RBI used to keep a major chunk of this surplus for its Contingency Fund (CF) and Asset\nDevelopment Fund (ADF).\n\n« However, afterMalegam Committee (2013) recommendations and later under revised Economic Capital\nFramework (2014-15) by Bimal Jalan committee, its transfer of surplus to government increased.\n\nRBI SURPLUS TRANSFERRED\nTO THE CENTRAL GOVERNMENT\n(in Cr.)\n180,000\n160,000\n140,000\n120,000\n100,000 99,112 Cr\n80,000\n60,000\n40,000\n20000 18,009 Cr\nie)\nF 2 2 $+ © © F @ 28 GS &\n2 £ & &» + &» & & @ § g\n®& &§ &8 &§ 8 8 FR R R BB\n\n\n4.3. TRANSITION FROM LONDON INTERBANK OFFERED RATE (LIBOR)\n\nWhy in the news?\n\nThe Reserve Bank of India (RBI) has issued an advisory to banks and other RBI-regulated entities asking them\nto take steps to ensure a complete transition away from the London Interbank Offered Rate (LIBOR).\n\nMore on the news\n\n« LIBOR and the Mumbai Interbank Forward Outright Rate (MIFOR) will be phased out.\n\no MIFORis a domestic interest rate benchmark presently published by Financial Benchmarks India Pvt\nLtd (FBIL).\n\n« Banks / Financial Institutions (Fls) have been advised to ensure that no new transactions undertaken by\nthem, or their customers rely on or are priced using the U.S. Dollar LIBOR or MIFOR.\n\n« The global transition from LIBOR was necessitated after British financial authorities decided to phase it\nout in 2017 after discovering that some large banks manipulated the reference rate up or down by\nproviding false data.\n\nAbout LIBOR\n\n* Benchmark rate: LIBOR is a global benchmark interest rate at which major global banks lend to one\nanother in the international interbank market for short-term loans.\n\no Financial Benchmarks are indices, values, or reference rates for the purpose of pricing, settlement and\nvaluation of financial contracts.\n\n« Regulation: Before 2014, LIBOR was administered by the British Bankers’ Association (BBA). Later, the\nmaintenance of the benchmark was brought under the purview of the U.K. Financial Conduct Authority\n(FCA).\n\n* Calculation: Before 2021, LIBOR was calculated for five currencies (U.S. dollar, Euro, Pound, Swiss Franc\nand Japanese Yen) for seven tenors.\n\no. After the announcement of its phased rollback in March 2021, only U.S.-dollar LIBOR was allowed to\nbe published.\n\nLIBOR transition benefits to India\n\n« Reduction in financing cost as the calculation of reference rates going forward will be more robust and\ntransparent.\n\n« Reduced borrowing costs as lenders and investors may require lower interest rates or spreads.\n\n* More competition: The introduction of alternate reference rates may introduce more competition in the\nmarket for reference o\n\nBy Alternatives for LIBOR\n\nrates.\nIndia’s Transition Scenario\n\n* Alternative Reference\n\nRates (ARRs): The RBI has\nestablished a system of ©) € @ ® 6\n\nAlternative Reference Us's Europe's Japan's China's India’s\nRates (ARRs) that allows Secured European Tokyo Shanghai Modified\n\nOvernight Interbank interbank Interbank Mumbai\nbanks to choose rates Financing Offered offered Offered Interbank\nfrom a basket of Rate (EuRIBOR) Rate Rate Forward\ncurrencies rather than the (SOFR) (TIBOR) (SHIBOR) Outright\nBritish pound for (unaror)\ninternational financial\n\ntransactions.\no RBI has added Modified MIFOR to the list of significant benchmarks administered by FBIL.\n\nFallback Clause: RBI has pushed for the insertion of fallback clauses in all remaining legacy financial\n\ncontracts that reference LIBOR or MIFOR.\n\nco The fallback clause refers to an agreement for revised considerations when the reference rate is no\nmore published — important for transparency and consistency.\n\nFinancial Benchmarks India Pvt Ltd (FBIL)\n\nGenesis: It was formed in 2014 as a private limited\n\ncompany under the Companies Act, 2013.\n\n0 Itis jointly owned by Fixed Income Money Market and\nDerivatives Association of India (FIMMDA), Foreign\nExchange Dealers Association of India (FEDA) and\nIndian bank Association (IBA).\n\nObjective: Its aim is to develop and administer\n\nbenchmarks relating to money market, government\n\nsecurities and foreign exchange in India.\n\nRegulation: FBIL is regulated by the Reserve bank of India.\n\nuP\n\nro\nFunctions of FBIL\nCollection and submission of market\ndata and information including polled\ndata\n\n$\n\nFormulation, adoption and periodic\nreview of benchmark calculation\nmethodologies\n\nCalculation, publication and\nadministration of benchmark.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 5,
                "chapter_name": "5. PAYMENT SYSTEMS AND FINANCIAL MARKETS",
                "chapter_path": "./screenshots-images-2/chapter_5",
                "sections": [
                    {
                        "section_id": 5.1,
                        "section_name": "5. PAYMENT SYSTEMS AND FINANCIAL MARKETS",
                        "section_path": "./screenshots-images-2/chapter_5/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_5/section_1/6dd1295c-5cd3-4b33-8a53-c124d6e9aa5f.png",
                            "./screenshots-images-2/chapter_5/section_1/7455d0f0-f0e1-4722-aeab-f0816c679c4b.png",
                            "./screenshots-images-2/chapter_5/section_1/ba5c5bc4-7a92-4429-9d97-877e027e3e9c.png",
                            "./screenshots-images-2/chapter_5/section_1/8f302668-a577-445b-922f-8bff2dbc0a1b.png",
                            "./screenshots-images-2/chapter_5/section_1/87c5f5cd-88ca-40c9-94e6-ad038b7583bf.png",
                            "./screenshots-images-2/chapter_5/section_1/d9513e74-8399-4daf-80b3-fd55b6e44631.png",
                            "./screenshots-images-2/chapter_5/section_1/3d818f07-ab0e-475e-9283-97861a577c2d.png",
                            "./screenshots-images-2/chapter_5/section_1/ad0d72dc-6825-43ff-a205-c1590c54cadf.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "5.1. CROSS-BORDER PAYMENTS\n\nWhy in the news?\n\nRBI and the Bank for International Settlements (BIS) Innovation Hub organized G20 TechSprint 2023 to promote\ninnovative solutions for improving cross-border payments.\n\nPlease note, the topic G20 will be covered in detail in International Relations edition of the PT 365 Series.\nCross Border Payments\n\n*  Itinvolves financial transactions in which the sender and recipient are based in separate countries.\n* The cross-border payments market value is expected to reach $290 trillion by 2030.\n\nTypes of Cross-Border Payment e\n\nInternational Wire Transfers like Society for Worldwide International Money Orders using a third-party provider.\nInterbank Financial Telecommunication network (SWIFT). \"9 party Pr\n\nDigital Wallets like PayPal, Google Pay, Apple Pay. Others like Credit card Transactions, Crypto currencies.\n\nMechanism of Cross-Border Payments\nSimple cross-border payment @ Cross-border payment using\nusing accounts held at each bank. a correspondent bank.\n& ft bg < fi\nBank A S Bank B sanka SSD bi SB Bank B\n\nG2) Payment message wine\n\n» International banks hold accounts with each other, » Banks not having direct relationship transact via\nenabling banks to make payments in foreign currency. an intermediary, a ‘correspondent’ bank.\n\nSignificance of Cross-Border Payments\n\n* Globalization: Cross-border payments are a fundamental element of the globalization process by\nimproving access to global markets.\n0 Itenables participants to diversify their customer base, supplier base, and investment portfolio.\n« Financial Inclusion: It can enable underserved communities to participate in the global economy.\n* Additional significance for the Indian economy:\no Eases Remittances: Since 2016, India’s cross-border remittances have grown at a CAGR of 8%.\no Facilitates Travel & Tourism: Travel and tourism industry contributed around $ 178 billion to India’s\nGDP (2021).\no Accelerating Foreign Investment: India received a total FDI inflow of US$70.97 billion in FY 2023.\n\nSteps Taken in India for Strengthening Cross-Border Payments\n\n« RBI Payments Vision 2025: One of its focus areas is to bring ease in cross-border payment.\n\n* NPCI International Payments Limited (NIPL): Facilitating cross-border acceptance of UPI at merchant\nestablishments.\no Singapore, UAE, Mauritius, Nepal, Bhutan etc. have accepted UPI.\n\n« RBI has allowed access to UPI to foreign nationals and NRIs visiting India.\n\n* India-UAE MoU on the use of Central Bank Digital Currency (CBDC) for Cross-border payments.\n\n5.2. SECURITIES AND EXCHANGE BOARD OF INDIA (SEBI)\n\nWhy in the news?\n\nRecently, Securities and Exchange Board of India (SEBI) has launched Investor Risk Reduction Access\n(IRRA) platform at Bombay Stock Exchange (BSE).\n\nAbout IRRA platform\n\n+ IRRAplatform has been developed to reduce risks faced by investors in eventuality of technical glitches\nat the trading member’s end at both the primary site and disaster recovery site.\nco Itis available to trading members supporting internet-based trading and security trading through\nwireless technology for their investors.\noc Ithas been jointly developed by all stock exchanges - BSE, NSE, NCDEX, MCX and Metropolitan Stock\nExchange of India.\n\nAbout SEBI\n\n« Established in 1988 and made as a statutory body in the year 1992 as per the Securities and Exchange\nBoard of India Act, 1992.\n* Organizational Structure: Board consists of nine members:\no Chairman, appointed by the Central Government\no 4 full time members and 4 part time members (of which A board member is appointed by RBI and 2\nboard members by the Ministry of Finance and 5 members by the Centre)\n\nFunctions of SEBI\n\neo\n\nTo protect the Regulating the Prohibiting Registering and Promoting investors’\ninterests of investors business in stock insider trading in regulating the stock education and\nin securities market exchanges securities brokers, sub-brokers, training of\n\nand regulate it. share transfer agents intermediaries\n\netc.\n\nPowers of SEBI\n\n* A quasi-legislative and quasi-judicial body which can draft regulations, conduct inquiries, pass rulings\nand impose penalties to regulate the functioning of Primary and Secondary market in the country.\n\n« Can regulate any money pooling scheme worth Rs.100 cr or more and attach assets in cases of non-\ncompliance (as per Securities Laws (Amendment) Act, 2014)\n\n* Can seek information, such as telephone call data records, from any persons or entities in respect to any\nsecurities transaction being investigated by it.\n\n* Can undertake any disciplinary proceedings like imposing fine, barring an entity or person from market\ntemporarily or permanently.\n\n« Canissue directions to secure the proper management of any such intermediary or person in the interest\nof investors.\n\nRecent initiatives taken by SEBI\n\nRevised * SEBI has halved the time for IPO listing of companies from six days to three days. i.e.,\nTimeline for from T+6 to T+3.\nInitial Public o 1POrefers to the selling of securities to the public in the primary market.\n\nOffering (IPO) © __Itacts as the largest source of funds for the company.\n\n\ne It will enhance the e of doing business for issuers and provide investors with\nquicker access to capital and liquidity.\nBRSR Core -|° SEBI introduced BRSR Core — Framework for assurance and ESG disclosures for value\nFramework rah\ne Environmental, Social and Governance (ESG) is a framework that helps stakeholders\nunderstand how an organization is managing risks and opportunities related to ESG\ncriteria.\n* SEBI amended Securities and Exchange Board of India (Listing Obligations and\nDisclosure Requirements) Regulations, 2015 in this regard to bring following changes:\nBRSR e BRSR Coreis a sub-set of the BRSR, consisting of a set of Key\n(Business Performance Indicators (KPIs) under 9 ESG attributes.\nResponsibility o Through BRSR reporting, SEBI has defined ESG disclosures\nand in a standardized manner for the listed companies.\nSustainability + Keeping in view relevance to Indian / Emerging market context,\nReport) Core few new KPIs have been identified for assurance such as job\nand updated creation in small towns, openness of business, gross wages\nBRSR paid to women etc.\nESG « Will be applicable to top 250 listed entities (by market\nDisclosures capitalization) from FY 2024-25.\nforvalue chain | Disclosures for value chain will be made by listed company as\nper BRSR Core as part of its annual report.\n\no Value chain shall encompass top upstream and\ndownstream partners of a listed entity, cumulatively\ncomprising 75% of its purchases / sales (by value)\nrespectively.\n\nRelated News\nDabba (Box) Trading\n* National Stock Exchange (NSE) issued notices naming entities involved in dabba trading.\n* Dabba trading is informal trading that takes place outside the purview of stock exchanges.\no Traders bet on stock price movements without incurring a real transaction to take physical\nownership of a particular stock as is done in an exchange.\n* Since there are no proper records of income or gain, it helps dabba traders escape taxation.\n« itis recognised as an offence under Securities Contracts (Regulation) Act (SCRA), 1956.\n\n5.3. FOREIGN PORTFOLIO INVESTMENT (FPI)\n\nWhy in the news?\n\nThe Securities and Exchange Board of India (SEBI) released a Consultation Paper on a framework for mandating\nadditional disclosures from identified high-risk Foreign Portfolio Investors (FPIs).\n\nExisting Provisions for FPIs in India\n\nRegulated by SEBI: under SEBI (Foreign Portfolio Investors) Regulations, 2019 (‘FPI regulations’).\n\no SEB! has prescribed certain limits on the investment that FPls can make in Indian securities.\n\nLegislative provision: Foreign Exchange Management Act, 1999 (FEMA) is the primary legislation\n\ngoverning FPI in India.\n\no Prevention of Money Laundering Act, 2002 (PMLA) and the Prevention of Money Laundering\n(Maintenance of Records Rules), 2005 (PML Rules) are the additional legislations.\n\neo\nComparison of Foreign Direct Investment (FDI) ~\nand Foreign Portfolio Investment (FPI)\n\nFDI refers to the Investment FPI refers to investing in the\nmade by foreign investors financial assets of a foreign\nto obtain a substantial country, such as stocks or\n\ninterest in the enterprise bonds available on an\nlocated in a different exchange.\n\ncountry\n\nROLE\n\nQB] kiveivesor |, Vor ,.| _Posvervesor (Gl\nINVESTORS\nDirect investment Indirect Investment ()\n\n‘a DEGREE\nHigh control OF\nCONTROL\n\nRelatively easy (da)\n\nRISKS\nC= a)\n\nIssues identified with FPIs\n\n* Circumvention of Press Note 3 (PN3) stipulations: PN3 requires that an entity of a country that shares a\nland border with India can invest only under the Government route.\no Since PN3 does not apply to FPI investments, the FPI route could potentially be misused to\ncircumvent the stipulations of PN3.\n« Failure to disclose Related Party Transactions (RPTs): RPTs are arrangements or deals between entities\nwith a common interest or a relationship — by companies.\noc. The framework for FPI allows indirect circumventing of the RPT disclosure requirements.\n\nSEBI’s proposal for FPI regulation\n\n* Categorisation of FPIs: FPls may be categorised as:\no Low-Risk FPIs: Government and related entities such as central banks, sovereign wealth funds, etc.\no Moderate-Risk FPIs: Pension Funds or Public Retail Funds with widespread and dispersed investors in\n\nsuch funds.\n\no High-Risk FPIs: All other FPls.\n\n« Enhanced transparency measures for high-risk FPls such as fully identifying all holders of ownership,\ndisclosure of economic, and control rights etc.\n\n« Additional Disclosure: For requiring additional disclosures, the above risk categorisation is to be coupled\nwith either the quantum of concentrated investments by FPls or the size of the overall Assets Under\nManagement (AUM).\n\n5.4. CORPORATE DEBT MARKET\n\nWhy in the news?\nRecently, SEBI released a framework for rolling out the Corporate Debt Market Development Fund (CDMDF).\nAbout CDMDF\n\n« Fund: CDMDF, established as an alternate investment fund, will purchase investment-grade corporate-\ndebt securities during market stress.\nco Alternate Investment Fund (AIF) refers to any privately pooled fund established or incorporated in India\nfor investing. (These funds are collected from sophisticated investors such as Angel investors, Venture\ncapitalists etc.)\no Investment grade refers to the quality of a company’s credit. The company must be rated at 'BBB' or\nhigher to be considered an investment grade issue.\n* Objective: During market stress, the Debt Market faces redemption pressures in the open market\n(especially schemes with long maturity periods). CDMDF will help the market by providing liquidity access\n\nin such times.\n0 The fund aims to emulate the RBI's liquidity support for the banks in the context of the Corporate Debt\nMarket.\n\n« Contribution: Contribution to the fund shall be mandatory for specified debt-oriented MF Schemes and\nAsset Management Companies (AMCs).\n« Tenure: Initially 15 years, it can be extended as per SEBI’s mandate.\n\nCorporate Debt Market\n\n* Bond/credit market or fixed-income market is the collective name given to all trades and issues of debt\nsecurities.\no Broadly divided into Government Debt Market and Corporate Debt Market.\n« Issue: Companies issue corporate bonds to finance current operations, expand product lines, or open new\nmanufacturing facilities.\n* Nature: Corporate bonds usually describe longer-term debt instruments that provide a maturity of at least\none year.\n* Regulation: SEBI has jurisdiction over the corporate debt market.\nco The regulatory jurisdiction between the SEBI and RBI was clarified in 2000 by an amendment to the\nSecurities Contract (Regulation) Act 1956.\no Under this, RBI’s regulatory jurisdiction includes money market and government securities.\n* Status of the Market in India: Outstanding Corporate bonds in India, as a percentage of GDP, stood\naround 17% in March 2022.\no The same figures for other emerging Asian economies are much higher: South Korea (>80%), Malaysia\n(>50%), China (~ 40%)\n\nSignificance of Corporate Debt Market\n\n* Investment needs: To shift from a consumption-driven to an investment-led economy, as emphasised\nby the Economic Survey 2018-19.\n\n« Efficient allocation of resources: Additional avenues for corporates to raise funds cost-effectively and\nreduce reliance on bank finances.\n\n* Health of corporate balance sheet: Reduce corporate reliance on External Commercial Borrowing (ECBs),\nwhich is subject to volatility in the international market.\n\n5.5. INVESTOR SERVICES FUND (ISF) AND INVESTOR PROTECTION\nFUND (IPF)\n\nWhy in the news?\n\nSecurities and Exchange Board of India (SEBI) came out with the comprehensive guidelines for Investor\nProtection Fund (IPF) and Investor Services Fund (ISF) maintained by stock exchanges and depositories.\n\nInvestor Protection Fund (IPF)\n\nThe objective of establishing an IPF is to protect the interests of participants (like stockbrokers and investors)\nof the Exchange.\n\n« Establishment: All stock exchanges and depositories shall establish an IPF.\no A depository is a financial institution or organization that accepts deposits from businesses &\nindividuals and assists in buying and selling financial instruments, such as stocks and bonds.\nv For example, demat accounts can be opened in India only in depositories- Central Depository\nServices (India) Limited (CDSL) and National Securities Depository Limited (NSDL).\n\n* Administration: The IPF of the stock exchange and depository shall be administered through separate\ntrusts created for the purpose.\n\n* Segregated funds: The stock exchange and depository shall ensure that the funds in the IPF are well\nsegregated and that their IPF is immune from any liabilities of the stock exchange and depository\nrespectively.\n\n« Review: The stock exchanges and depositories shall conduct a half-yearly review to ascertain the\nadequacy of the IPF corpus.\n\nContribution to IPF Utilization of IPF\nStock * 1% of listing fee received. + To meet the legitimate investment\nExchanges * 100% of interest earned on 1% security claims of the clients of the\ndeposit kept by the issuer companies at the defaulting Trading Managers\ntime of offering of securities for subscription (TMs).\nto the public. * To pay interim relief to investors.\n\n* Penalty collected from Trading Members\nand from listed companies for non-\ncompliance with SEBI regulations.\n\n* Atleast 70% of interest or income received\nout of any investments made from IPF.\n\nDepositories * 5% of their profits from depository|* Promotion of investor education\n\noperations. and investor awareness\n* All fines and penalties from Depository programmes aimed at enhancing\nParticipants and other members. securities market literacy and\n* Interest or income received out of any Promoting retail participation in\ninvestments made from the IPF. securities market.\n\n* To meet the legitimate claims of\nthe beneficial owners.\n\n\nInvestor Services Fund (ISF)\n\nISF aims to provide different kinds of services to the investing public such as investor education and\n\nawareness programs, dissemination of companies’ information etc.\n\n* Funding: The stock exchange shall set aside at least 20% of the listing fees received for ISF for providing\n\nservices to the investing public.\n\n* Supervision: Supervision of the ISF will rest with the Regulatory Oversight Committee.\n\nco The Regulatory Oversight Committee is one of the seven committees for Market Infrastructure\n\nInstitutions (MIls) specified by Stock Exchanges and Clearing Corporations) Regulations, 2018.\n\nv Millis a financial entity that provides essential infrastructure for running the daily operations in\nthe Stock Market/Capital Markets. For example, Stock exchanges, depositories and clearing\nhouses are all Mils.\n\n« Utilization of ISF of Stock Exchange:\n\no Promotion of investor education and investor awareness programmes.\no Atleast 50% of the corpus should be spent in Tier II & Tier Ill cities.\no Cost of training of arbitrators.\n\n« Transfer of un-utilized IPF/ISF: If a stock exchange or a depository is wound up or derecognized or exits,\nthen the balance in the IPF and/or ISF lying un-utilised with the stock exchange and depository shall be\ntransferred to Investor Protection and Education Fund (IPEF) of SEBI.\n\nInvestor Protection and Education Fund (IPEF)\n\n« _IPEF has been established by SEBI in 2007 and it is regulated under the SEBI (IPEF) Regulations 2009.\n\n* — Itis utilized for the protection of investors and the promotion of investor education and awareness.\n\n¢ It is funded through contributions made by SEBI, grants and donations by central government or state\n\ngovernments, security deposits and amounts in IPF/ISF of derecognized stock exchanges etc.\n\n5.6. SOCIAL STOCK EXCHANGE\n\nWhy in the news?\n\nRecently, the Securities and Exchange Board of India (SEB!) approved certain flexibility in the framework for\n\nthe Social Stock Exchange (SSE).\n\nFlexibilities highlight that funding can done through:\n\n* Issuance of Zero Coupon Zero Principal (ZCZP) bonds and donations through Mutual funds for NPOs.\no ZCZP is issued only by an NPO registered on an SSE and has a specific tenure.\nco Itneither offers interest nor returns the principal. Objectives behind these donations are welfare and\n\ntax benefits.\n\n« Issuance of Equities and debt instruments for FPEs.\n\nAbout Social Stock Exchange\n\n« SSE is a segment of the existing Stock Exchange that can help Social Enterprises, such as NPOs or For-\nProfit Enterprises (FPEs), to raise funds from the public through the stock exchange mechanism.\n\n* Eligible activities for demonstrating primacy of Social Impact includes Eradicating hunger, poverty,\nmalnutrition, and inequality, promoting education, financial inclusion, slum area development etc.\n\nAd\nEntities not eligible to be identified as a Social Enterprise ~\n& 46 a\nSi\nCorporate Political or religious Professional or trade _ Infrastructure, and\nfoundations organizations or associations housing companies,\nactivities except affordable\n\nhousing\n\n\n.\n\nEligible criteria to be recognised as Social Enterprises is predominance of any of the following:\n\nRevenues Expenditure Beneficiaries\n\ne At least 67% of the|/e* At least 67% of the * Members of target population to\nimmediately preceding immediately preceding 3- whom eligible activities have been\n3-year average of year average of provided constitute at least 67%\nrevenues comes from expenditures has been of the immediately preceding 3-\nproviding eligible activities incurred for providing eligible year average of total customer\n\nto members of target\npopulation.\n\nactivities to members of the\ntarget population.\n\nbase and/or total number of\nbeneficiaries.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 6,
                "chapter_name": "6. EXTERNAL SECTOR",
                "chapter_path": "./screenshots-images-2/chapter_6",
                "sections": [
                    {
                        "section_id": 6.1,
                        "section_name": "6. EXTERNAL SECTOR",
                        "section_path": "./screenshots-images-2/chapter_6/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_6/section_1/027f8c1a-6ab7-4e1f-9568-e1b810df30c2.png",
                            "./screenshots-images-2/chapter_6/section_1/c07f0a5b-e6a9-499e-a842-608ee97e9fcc.png",
                            "./screenshots-images-2/chapter_6/section_1/e3f1ca6b-02b9-4783-b5e6-c996fd7ca88a.png",
                            "./screenshots-images-2/chapter_6/section_1/fe8e575a-3dcf-4b38-a3ff-98771fcdb63b.png",
                            "./screenshots-images-2/chapter_6/section_1/b2304084-32d5-4f26-9e9c-15529558f0ee.png",
                            "./screenshots-images-2/chapter_6/section_1/727e2414-99f8-47c0-922e-3bf490e0d798.png",
                            "./screenshots-images-2/chapter_6/section_1/4275c559-c582-416b-8cda-172260a0962f.png",
                            "./screenshots-images-2/chapter_6/section_1/f85f4397-3c36-4e9c-878f-3ec7e16aedf4.png",
                            "./screenshots-images-2/chapter_6/section_1/bf514e79-16f1-46bf-af32-4ba86eb038db.png",
                            "./screenshots-images-2/chapter_6/section_1/da20218d-6dd1-4f2e-b394-f6eea75840fe.png",
                            "./screenshots-images-2/chapter_6/section_1/7cc19063-a1a8-4dab-aebc-6b18de361cc1.png",
                            "./screenshots-images-2/chapter_6/section_1/e734e897-3841-4f32-93ac-beef10ead6f0.png",
                            "./screenshots-images-2/chapter_6/section_1/49801a41-92cc-4bc5-8fc4-c0b00a647d9d.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "6.1. EXCHANGE RATE MANAGEMENT IN INDIA\n\nWhy in the news?\nIndian rups valuation against currencies of major trading partners has surged to a near two-year high on\ncentral bank intervention and elevated domestic inflation.\nWhatis Currency Valuation?\n*  Itrefers to the process of determining the relative worth or value of one currency in terms of another.\n* The most common method to value currency is through exchange rates.\nco Itis influenced by several factors including interest rates, Inflation, capital flow, money supply etc.\n\nMethods for Exchange Rate Determination\n« Fixed Exchange Rates: Value of a currency is pegged/fixed to the value of another currency/ basket of\n\ncurrencies/a commodity like eo\ngold. Exchange Rate Determination in India\no Central banks actively Currently Nominal and Real Effective Exchange Rate\nintervene to maintain the (NEER and REER) evaluations are used,\nfixed rate.\n*  Flexible/Floating Exchange & NEER is weighted average % REER is weighted average\nRates: Determined by the * of bilateral nominal exchange of nominal exchange rates\n” . y rates of the home currency adjusted for relative price\nmarket forces i.e., demand in terms of foreign currencies differential between the\n\nand supply of currency in domestic and foreign countries\ninternational markets.\no Central Bank does not intervene directly. Do you know ra\n* Managed Exchange Rates: Determined by market\nforces but central banks may occasionally intervene to > Gresham's Law says in a fixed\nexchange rate system, “bad money\ndrives out good”, It causes\n\ninfluence the exchange rates.\nundervalued currency to go out of\n\nEffects of Exchange Rate\n* Inflation: An over-valued currency can contribute to circulation. Overvalued currency\nremains in circulation but it does not\n\nlower inflation by reducing the cost of imported goods and\nservices and vice versa. find enough buyers.\n\n« Interest Rates: Central banks may respond to a\nstrengthening currency by lowering interest rates to stimulate economic activity and vice versa.\n\n* Economic Growth: While a stronger currency can contribute to lower inflation, it may reduce export-driven\nsectors, consequently a decline in overall economic growth.\n\n* Trade: A stronger currency may contribute to trade deficits as exports become less competitive and\nimports become more attractive to domestic consumers.\n\n* Capital Flow: A stronger currency may attract more foreign direct investment as investors seek higher\nreturns due to currency appreciation.\n\n6.2. FOREIGN TRADE POLICY 2023\n\nWhy in the news?\nThe Union Ministry of Commerce and Industry notified the Foreign Trade Policy 2023.\nAbout FTP 2023\n\n* Notification: Notified by the Central Government, in the exercise of powers conferred under Section 5 of\nthe Foreign Trade (Development & Regulation) Act, 1992.\n\n* Based on Principles: such as responsiveness to the requirements of trade and ‘trust’ and ‘partnership’\nwith exporters.\n\n« FTP 2015-20: It was extended due to the COVID-19 pandemic and volatile geo-political scenario till March\n2023.\n\nco India has reached record high Export Performance.\n« Four Pillars of New FTP Approach\no From Incentives to tax Remission\no Greater Trade Facilitation through technology, automation, and continuous process re-arranging.\no Export Promotion through collaboration: exporters, states, districts.\no Focus on Emerging areas- E Commerce exports, developing districts as export hubs, streamlining\n\nSCOMET Policy.\no\nIndia’s Trade Profile (FY 2022-23)\nIndia’s Exports nea vanen India’s Trade Balance\n_—— 266.78 @ Fy 2021-22 @Fv 2022-23\n\nuss 4368n 954%\n\nMerchandise Services Overall Trade\n\nTrade Deficit Trade Surplus Deficit\nFY 2016 Fy 2022 FY 2023 (USD Billion) — (USD Billion) (USD Billion)\nIndia’s Exports Target \"India’s Top 1. Petroleum\nExport 2. Electronic Goods\n2 Trillion Dollars for Goods Commodities 3. Rice\nand Services by 2030 4. Chemicals\n\n5. Drugs and\nPharmaceuticals\n\nnae\n\nIndia’s top import India’s top export\nsource nations destinations\n\n1. China 1. USA\n\n2. UAE 2. UAE\n\n3. USA 3. Netherlands\n\n4. Russia 4. China\n\n|\n*Please note that the data in the infographic pertains to the year 2022-23. Although, updated data on these\nareas is available for monthly basis, rly compilations for 2023-24 are not yet available.\n\nIn the subsequent three articles, initiatives stated by the FTP 2023 have been covered.\n\n\n6.2.1. TRADE FACILITATION AND EASE OF DOING BUSINESS (EODB), FTP 2023\n\nInitiatives taken\n\n* National Committee on Trade Facilitation (NCTF): To facilitate coordination and implementation of WTO’s\nTrade Facilitation Agreement (TFA).\no WTO's TFAcame into force in 2017 to address the issue of “red tape” across borders and streamline\nthe movement of goods.\n« Initiatives by Directorate General of Foreign Trade (DGFT): Facilitator of exports and imports. It also\nconsults various Export Promotion Councils and Trade and Industry Bodies.\no  Niryat Bandhu: Being implemented for mentoring new and potential exporters.\no Issuance of e-IEC (Electronic-Importer Exporter Code): IEC is a 10-character alpha-numeric number\nallotted to an entity and is mandatory for undertaking any export/import activity.\no e-Certificate of Origin (e-CoO): Online facility for CoO. e-CoO has a unique number i.e., UDIN (Unique\nDocument Identification Number) and a QR code for validation.\n* Towns of Export Excellence (TEE): For development and growth of export production centres.\no Selected towns producing goods of Rs. 750 Crore or “\n\ne\nmore may be notified as TEE based on the potential for Privileges of certificate a)\ngrowth in exports (TEE in Handloom, Handicraft, +\n\nAgriculture and Fisheries sector, threshold limit would Credibility to the Indian\nbe Rs.150 Crore). (> exporters in the international\n* Rationalization of the criteria of Status Holder || markets.\n\nCertification: “Status Holder” certificate is to recognize\n\nexporter firms as business leaders who have excelled in\n\ninternational trade and have contributed to the country’s\n\nforeign trade.\n\no Ministry of Commerce & Industry unveiled system-\nbased automatic ‘Status Holder’ certificates under Foreign Trade Policy 2023.\n\nPriority custom clearances\nand certain exemptions\n\n6.2.2. EXPORT PROMOTION INITIATIVES BY FTP 2023\n\nDistricts as Export Hubs Initiative\n\n* State Export Promotion Committee & District Export Promotion Committee (DEPC) to strategize exports\nat the State and district level respectively.\n© District Export Action Plans (DEAPs) will be prepared by DEPCs alongwith their online monitoring.\n« Export promotion outreach programs in districts to focus on branding, packaging, design and marketing\nof identified products & services.\n* Convergence of ongoing schemes to support these initiatives.\n\nExport Promotion of Capital Goods (EPCG) Scheme\n\n* Objective: To facilitate the import of capital goods for producing quality goods and services and enhance\nIndia’s manufacturing competitiveness.\nco Itallows the import of capital goods at zero customs duty.\n\n« Capital goods are man-made, durable items that businesses use to produce consumer goods and services.\nTools, machinery, buildings, vehicles, computers, and construction equipment are types of capital\ngoods.\n\n« Eligibility: It covers manufacturer exporters, merchant exporters, and service providers who are\ncertified as Common Service Providers (CSP) by the DGFT.\n\no Manufacturer Exporter is a person who exports goods manufactured by him or intends to export such\ngoods.\no Merchant Exporter is a person engaged in trading activity and exporting or intending to export goods.\n\n« Export Obligation: Imports under EPCG are subject to Average Export Obligation (AEO). However, some\n\nsectors have been exempted from AEO requirements.\n\n\nExport Promotion Units\n\n* Objective: To promote exports, enhance foreign exchange earnings, and attract investment for export\nproduction and employment generation.\n\n* Eligible units: Units which export their entire production of goods and services, may be set up under the\nExport Oriented Unit (EOU) Scheme, Electronics Hardware Technology Park (EHTP) Scheme, Software\nTechnology Park (STP) Scheme or Bio-Technology Park (BTP) Scheme for the manufacture of goods.\nco Trading units are not covered under these schemes.\n\nDeemed Exports\n* Definition: Deemed Exports refer to those transactions in which goods supplied do not leave the\ncountry, and payment for such supplies is received either in Indian rupees or in free foreign exchange.\noc Insimpler terms, under deemed export, the goods can be sold within India to anybody who holds a\nlicence for the import of these very goods.\nv The seller selling the said goods against an import licence is the deemed exporter and the buyer\nis the deemed importer.\n* Objective: To provide a level-playing field to domestic manufacturers and to promote Make in India.\n\n6.2.3. OTHER KEY INITIATIVES BY FTP 2023\n\nPromoting Cross Border Trade in Digital Economy\n\n« E-Commerce Export Hubs (ECEHs): To establish designated areas as ECEHs, which would act as a centre\nfor favourable business infrastructure and facilities for Cross Border E-Commerce activities.\no Creation: ECEH may be set up through private initiative and in Public-Private Partnership (PPP) mode.\no Nature of ECEH operations: ECEH will function to achieve agglomeration benefits like certification &\ntesting facilities and dedicated logistics infrastructure among others.\no Entitlements: ECEH may be provided with financial assistance under the Market Access Initiative\n(MAI) scheme.\n* Promotion of e-commerce exports through postal route: Dak Ghar Niryat Kendras shall be\noperationalised throughout the country to work in a hub-and-spoke model with Foreign Post Offices (FPOs)\nto facilitate cross-border e-Commerce.\n\nDuty Exemption / Remission Schemes\n\n* Advance Authorisation (AA): Imports under AA are exempted from payment of Basic Customs Duty,\nAdditional Customs Duty, Education Cess, Anti-dumping Duty, Countervailing Duty, Safeguard Duty,\nTransition Product Specific Safeguard Duty, wherever applicable.\n\n* Duty-Free Import Authorization (DFIA): Duty-Free Import Authorisation shall be exempted only from\npayment of Basic Customs Duty (BCD).\n\n* Schemes for Remission of Duties and Taxes on Exported Products (RoDTEP): Its objective is to refund,\ncurrently unrefunded duties/taxes/levies, at the Central, State and local level, borne on the exported\nproduct.\n\no It was notified by the Department of Commerce, Ministry of Commerce and Industry and is\nadministered by the Department of Revenue, Ministry of Finance.\n\nSCOMET: Special Chemicals, Organisms, Materials, Equipment and Technologies\n\n« Regulation of dual-use items: In consonance with the guidelines and control lists of international\nconventions and obligations as well as Multilateral Export Control Regimes (MECRs), India has regulated\nthe exports of dual-use items, nuclear-related items, including software and technology viz. SCOMET.\nco Itis either prohibited or permitted under an authorization unless specifically exempted.\n\n* SCOMET list: It is India’s National Export Control List and is aligned to the control lists of all the MECRs\nand conventions.\n\no SCOMET items are regulated under the Weapons of Mass Destruction and their Delivery Systems\n(Prohibition of Unlawful Activities) Act, 2005.\nco Imported goods covered under the SCOMET list are not permitted for export.\n\n\n* Outreach Programmes on SCOMET: Will be organized by DGFT in association with Administrative\nMinistries/Departments and Trade Associations for effective awareness among the exporters/importers\ndealing with trade and manufacture, in particular, of SCOMET items.\n\neo\n\nSCOMET od ., .\nCategory Jurisdictional\nSCOMET items Licensing Authority\n\nNuclear materials, nuclear-related Department of Atomic\nother materials, equipment and technology Energy (DAE)\n\nToxic chemical agents and other chemicals Directorate General of Foreign\nTrade (DGFT)\n\nMicro-organisms, Toxins DGFT General\n\nMaterials, Materials Processing Equipment and related\nTechnologies\n\nNuclear-related other equipment and technology, not\ncontrolled under Category ‘0°\n\nAerospace systems, equipment, including production and\ntest equipment, and related Technology and specially\ndesigned components and accessories thereof.\n\nMunitions List Department of Defence\nProduction (DDP)/ Ministry of\nDefence\n\n‘Reserved’\n\nSpecial Materials and Related Equipment, Material\nProcessing, Electronics, Computers, Telecommunications,\nInformation Security, Sensors and Lasers, Navigation and\nAvionics, Marine, Aerospace and Propulsion,\n\n6.3. FREE TRADE AGREEMENTS (FTA) OF INDIA\n\nWhy in the news?\n\nTypes of FTAs o\n\nEconomic Union: Common market where\nmembers integrate monetary and\nfiscal policies\n\nRecently, the Union Cabinet approved signing and\nratification of Bilateral Investment Treaty (BIT) with\nUnited Arab Emirates (UAE).\n\nAbout BIT\n\nCommon Market: Custom union where\n« BIT is a reciprocal agreement for according | members allow the movement of\nprotection to investments by national and —</ laber and capital\ncompanies of One state in another state.\nKindly note that the details of the BIT and India-UAE\n\nrelations will be covered in International Relations\n(IR) edition of PT 365.\n\nCustom Union: Members apply a\ncommon external tariff for non-members\n\nFree Trade Agreement (FTA):\nAbout Free Trade Agreement (FTA) @) Members reduce tariffs on trace among\n\n+ FTAis a treaty between two or more countries that\nreduces or eliminates barriers to trade between the Preferential Trade Agreement (PTA):\n\n. Reducing duties on an agreed number\ncountries.\n\nof products\n* FTAs usually cover trade in goods or services.\n\n\no FTAs can also cover other intellectual property rights (IPRs), investment, government procurement,\nand competition policy.\n« FTAis essentially a discriminatory system in contrast to the fundamental principle of the WTO.\no However, FTAs are authorised under the WTO. A country may enter an FTA if it observes certain\nconditions stipulated in the relevant provisions of the WTO agreements.\n\nIndia’s FTA\n* India has signed 13 FTAs with various countries.\no These include Sri Lanka, Nepal, Bhutan, Thailand, Singapore, South Korea, Japan, Malaysia,\nMauritius, United Arab Emirates and Australia.\n* Exports to countries/regions with which India shares trade agreements such as FTAs have registered a\ngrowth of 20.75% in the last five years.\n* Recent developments in FTAs of India:\nco Innovative design: For the first time, India has included digital trade within the ambit of its FTA with\nUAE.\no Addressing NTBs: Recently, signed FTAs like Australia-India also address the non-tariff barriers\n(NTBs).\n© Focus on the services sector: Previous agreements did not pave for a robust trade in services.\no Natural trading partners: The trade baskets of these nations show a good degree of\ncomplementarity, thus classifying them as natural trading partners.\no  India-ASEAN FTA: India and the Association of Southeast Asian Nations (ASEAN) have agreed to\nconclude the review of the existing FTA in goods by 2025.\n\n6.4. GLOBAL TRADE BARRIERS\n\nWhy in the news?\n\nThe World Trade Organization (WTO) flagged growing fragmentation in international trade with an over-\nninefold increase in the number of trade concerns raised between 2015 and 2022.\n\nWhat are Trade Barriers?\n\n* Definition: A trade barrier refers to any regulation or policy that restricts international trade, especially\ntariffs, quotas, licences etc.\n* Types: There can be tariff and non-tariff barriers to trade.\n\no Tariff Barriers: Simply, a tariff barrier is a tax and it adds to the cost borne by consumers of imported\ngoods.\n\no Non-Tariff Barriers (NTBs): Non-Tariff Measures (NTMs) are policy measures apart from tariffs that\nimpact imports into a country. When NTMs become arbitrary, beyond scientific justification and create\nhurdles for trade, they are called NTBs.\n\nv The UN Conference on Trade and Development (UNCTAD) classifies 16 types of non-tariff barriers\nincluding-\n* Technical barriers like Sanitary and phytosanitary measures etc.\n* Non-technical barriers like trade-protective measures, Rules of Origin (RoO), Trade related\nInvestment measures etc.\n= Export related measures.\n\nImpact of trade barriers on Indian Industry\n\n* According to an assessment, 80% of India’s trade is subject to some NTBs.\n* The key Indian exports routinely facing high NTBs:\no Tea, Basmati Rice, Animal Products, Chemicals Products to the EU;\no Sesame seed, Shrimps, Medicines, Apparels to Japan;\no Meat, fish, dairy and industrial products to China;\nco Fruits and Shrimps to USA;\n* Sanitary and Phytosanitary Measures are main constraints to Indian Exports in advanced economies.\n\n\nRelated news\nUnited Nations Conference on Trade and Development (UNCTAD) released Trade and Development\nReport 2023.\n* Key Findings of the Report\n© Global Economic Outlook: The world economic growth is projected to be 2.4% in 2023.\n© India's Economic Projections: India’s economic growth is forecasted to be 6.6% (in 2023) and 6.2%\n\n{in 2024).\n* About UNCTAD Other reports by UNCTAD\no Genesis: Established by United Nations Assembly in S Trade & D Report\n1964. A permanent intergovernmental body of the\nUnited Nations a World Investment Report\n© Membership: 195 members including India. {B_Piatat economy Report\n\no Mandate: UNCTAD’s work focuses on four main\nareas - trade and development, investment and rs Technology and innovation Report\nenterprise, technology and innovation, and 05} Review of Maritime Transport\nmacroeconomics and development policies.\n\n© Functions:\n\nv Helps developing countries participate more equitably in the global economy.\n¥ Supports developing countries efforts to use trade, investment, finance, and technology as\nvehicles for inclusive and sustainable development.\n\n6.5. WORLD TRADE ORGANISATION (WTO)\n\nWhy in the news?\n\nIndia appealed against a ruling by the World Trade Organization (WTO) dispute settlement body that India\nviolated its zero-tariff commitment\nunder the Information Technology\nAgreement (ITA).\n\nAbout Dispute Settlement at WTO\n\nTrade\nFacilitation\nagreement\n\nThe\n‘Agreement on\nTechnical\nBarriers to\nTrade\n\nThe General\nAgreement on\nTrade in\nServices\n(GATS)\n\n* There are two main ways to settle\na dispute once a complaint has\nbeen filed in WTO:\n\no. Parties find a mutually agreed\n\nThe\n\nTrode-\n\nsolution. Agreement on\nRelated Aspects _ - Trade-Related\no Through adjudication, of Intellectual Investment\nincluding the subsequent Property Rights,\n\nimplementation of panel and\n\nAppellate Body reports.\n\n« There are three main stages to the\nWTO dispute settlement process.\no Consultations between the\n\nparties;\n\nY If both sides are not able\nto resolve the matter\nthrough consultation, either of them can approach for establishment of a dispute settlement\npanel.\n\no Adjudication by panels whose ruling or report can be challenged at WTO's appellate body;\n\n¥ At present, functioning of appellate body is impacted due to USA blocking appointments to\nAppellate Body.\n\no Implementation of the ruling which includes possibility of countermeasures in the event of failure by\nparties in implementing the ruling.\n\nThe Agreement\non Agriculture of Sanitary and\n\nPhytosanitary\n\n\nWorld Trade Organization (WTO)\n\n* WTOis the only global forum for setting the rules of international trade.\n\no Itfacilitates trade negotiations, monitors implementation of trade agreements and serves as a forum for\nsettling trade disputes between countries.\n\n* Marrakesh Agreement that established the WTO was signed in 1994, at the conclusion of the Uruguay\n\nRound of Multilateral Trade Negotiations.\n\no WTOis the successor to the General Agreement on Tariffs and Trade (GATT), a group founded in 1948\nwhose rules created the modern multilateral trading system.\n\n« thas 164 members including India.\n* Investment Facilitation Agreement at WTO:\n\no Launched in 2017 by a group of developing and least-developed WTO members. It is a joint initiative\naims at developing a multilateral agreement on Investment Facilitation for Development that will\nimprove investment and business climate.\n\no Itdoes not include India.\n\nRelated news\n\nDeveloping Country Status\n\n* Legislation establishes a US policy against granting China developing country status in future treaties\nand international organisations.\n\n*  Ithas been asserted that China can no longer be considered a developing country.\n\n* World Trade Organization (WTO) has not defined ‘developed’ and ‘developing’ countries and\ntherefore member countries are free to announce whether they are ‘developed’ or ‘developing’.\no UN also has no formal definition of developing countries, but still uses the term for monitoring\n\npurposes.\n\n6.6. DE-DOLLARIZATION\n\nWhy in the news?\n\nBRICS (Brazil, Russia, India, China and South Africa) nations are in the process of creating a new currency\nfor cross-border payments.\n\nMore on the news\n\n*  BRICS currency will be used for cross-border trade.\n\n« Also, India and Malaysia have agreed to settle trade in Indian rupees in addition to current modes of\nsettlement in other currencies.\n\n* These are seen as a major step towards de-dollarization.\n\n(what is de-dollarization? )\n\nIt refers to the process wherein countries tend to reduce their reliance on the US dollar (USD) as a\nreserve currency, medium of exchange and as a unit of account.\n\n| Determinants of a Global Currency\n\nOpen Economy. §  politico-Economic stability.\npe y.\n\n& Capital Account Convertibility. fe Acceptability and Trust.\n\n\nWhy De-dollarization is taking root?\n\n* Weaponization of Trade: Imposition of sanctions and the exclusion from SWIFT (Society for Worldwide\nInterbank Financial Telecommunication) creates impediments for countries to carry out trade. For\ninstance, sanctions were imposed on Russia after the Ukraine war.\n\n* New Emerging Economies: Rise of Asia as an economic powerhouse has raised the importance of\ncurrencies like the Indian rupee and the Yuan.\n\n« Visible benefits of diversification: Multi-currency foreign currency reserves reduce the pressure on\nexternal sectors.\n\n* Manipulation by U.S.: Dominance of the USD allows the U.S. to manipulate the global financial system\nto its benefit, often at the expense of others.\n\nBenefits of de-dollarization for India\n\nReduction in Boost in export Greatercontrol | Reductionin | Attract Enhanced\nsystemic risks in competitiveness | over debt borrowing foreign monetary\nglobal financial management costs investment | policy\n\nsystem flexibility\n\nGlobal Initiatives for De-dollarization\n\ne In 2021, the eo\nPeople’s Bank of Initiatives taken for the Internationalisation of Rupee\nChina submitted\n\na “Global = =\nSovereign se \\\nDigital Currency ‘(CROSS-BORDER BORROWINGS IN RUPEE ~~\" TRADE SETTLEMENT IN RUPEE\nGovernance” Introduction of Rupee Denominated bonds, or | Biggest development, In July 2022, RBI issued a\nproposal to the Masala Bonds, since 2014- allowing indian comprehensive framework to allow trade\nBank for corporate to issue rupee denominated bonds settlement in rupees through Special Vostro\noverseas. Accounts.\nInternational\nSettlements.\n«= African CURRENCY SWAPS OTHER MEASURES\n\nContinental > Exploration on domestic currencies use for regional\nFree Trade Area 23 currency swaps agreed since trade settlement at Asian Clearing Union.\n(AfCFTA) 18 | | ORE Shane mores countries oe » Enabling conditions to link domestic rupee interest\npromoting intra- ina bid to promote rates and currency markets with offshore rupee\nAfrican trade internationalisation of rupee. markete.\n\n> Permitting primary dealers to act a5 market makers\n\ni local\n\nusing al in forexmarkets to improve market liquidity, etc.\n\n* European\nCentral Bank’s TARGET2 System (2007) enables EU member countries to conduct trade and financial\ntransactions in euros.\n\n6.7. REMITTANCES\n\nWhy in the News?\n\nThe World Bank recently released an annual report “Migration and Development Brief: Leveraging Diaspora\nFinances for Private Capital Mobilization”.\n\nKey Findings\n\n* Global Remittance: Global remittance flows are estimated at $860 billion in 2023 (increase of 3% from\n2022).\n\n* Remittances to Low and Middle-income Countries (LMICs): Estimated to reach $669 billion at 3.8%\ngrowth in 2023.\n\no Remittances continued to be the premier source of external finance for LMICs during 2023, relative\nto FDI and official development assistance.\n\no Remittances’ growth in South Asia is projected to be the highest ($89 billion) among LMICs in 2024,\nattributable entirely to remittance flows to India.\n\n*, ca\nImportance of remittances Remittance\n* Fromamacro perspective: Remittances Remittance refers to the transfer of money by individuals,\nincrease consumption in the economy as _ ‘typically migrant workers, to family members in their home\nthe disposable income of families COMETS,\nincreases. This helps in pushing up the Top 3 Recipients of Z@® Top 3 Recipients of\nGDP growth Ey Remittances in ay (in Bee ~gh a in 2022 (As\n* Absolute Number, % of GDP;\no Remittances account for a significant > India * Tajikistan\nchunk of nearly 3% of India’s GDP. » Mexico * Tonga\nWhen India’s trade deficit widens, > China * Lebanon\nremittances provide a much-needed\ncushion State wise share of Country-wise Share in\n. Remittance Receipts Inward Remittances to\no Disposable income is the amount of (Top 3 in 2020-21) oe in 2020-21\nmoney that an individual or household » Maharashtra * United States (23.4%)\nhas to spend or save after income » Kerala * United Arab Emirates\n> Tamil Nadu (18.0%)\n\ntaxes have been deducted. » United Kingdom\n* A Major Source of External Finance for (6.8%)\nDeveloping Countries.\no Remittances are the second largest major source of external financing after service export.\n(Economic Survey 2022-23).\n\nThe World Bank Group\n\n* The International Bank for Reconstruction and Development (IBRD) is a global development\ncooperative owned by 189 member countries.\n© As the largest development bank in the world, it supports the World Bank Group’s mission by\n\nproviding loans, guarantees, risk management products, and advisory services to middle-income\nand creditworthy low-income countries.\n\n* The International Development Association (IDA) is the part of the World Bank that helps the world’s\npoorest countries.\n\no Established in 1960, IDA aims to reduce poverty by providing zero to low-interest loans (called\n“credits”) and grants for programs that boost economic growth, reduce inequalities, and improve\npeople's living conditions.\n\n* The International Finance Corporation (IFC) is the private sector arm of the World Bank Group and\nshares its mission to reduce global poverty.\n\n« Multilateral Investment Guarantee Agency (MIGA) was created to complement public and private\nsources of investment insurance against non-commercial risks in developing countries.\n\n* International Centre for Settlement of Investment Disputes (ICSID) is an autonomous international\ninstitution established under the Convention on the Settlement of Investment Disputes between States\nand Nationals of Other States (the ICSID or the Washington Convention).\n\n| Key publications of World Bank Group ]\n\nDoing Business Reports Global Economic Prospects Global Financial Development\nReport\n\nCommodity Markets Outlook Poverty and Shared Prosperity | World Development Reports\n\n6.7.1. LIBERALISED REMITTANCE SCHEME (LRS)\n\nWhy in the news?\n\nUnder the RBI's Liberalised Remittance Scheme (LRS), the finance ministry has included the overseas use of\ncredit cards by an Indian resident within the $250,000 limit per financial year (April - March).\n\n\nMore on the news\n\n« Current status: Until now, a provision in the Foreign Exchange Management (Current Account\nTransactions) (FEM(CAT)) Rules, 2000 excluded resident Indian’s overseas use of credit cards during\nforeign travel from the $250,000 cap.\n\no Debit card transactions abroad are already accounted for in LRS.\n\n* FEM (CAT) Rules: They have been brought out under the Foreign Exchange Management Act, 1999,\n(FEMA).\n\no Under FEMA, all resident Indians are free to buy or sell foreign exchange for any current account\ntransaction except for those transactions for which withdrawal of foreign exchange has been prohibited\nby the Central Government.\n\n* Demographic Affected: The regulation will impact spending by High Net-worth Individuals (HNIs) during\nforeign visits.\n\nApplicability of Tax Collected at Source (TCS)\n« TCSisa type of tax collected by the seller of selected goods and services from the buyer, and in the\ncontext of foreign remittance transactions, this tax is collected when individuals send money abroad.\n* Union Budget 2023-24 proposed maintaining 5% TCS for foreign remittances exceeding Rs 7 lakh\ntowards education and medical treatment.\no Similarly, it proposed no change in the 0.5% TCS on foreign remittances exceeding Rs 7 lakh\ntowards education through loans from financial institutions.\no However, for foreign remittances for other purposes under LRS and purchase of an overseas tour\nprogramme, it proposed hiking the TCS from 5% to 20%.\n\nBackground of LRS\n\n* Inception: The LRS scheme was introduced in 2004.\n\n* Objective: To liberalize the existing foreign exchange regulations and facilitate the smooth transfer of\nfunds abroad by Indian residents.\n\n* Application: All resident individuals are allowed to freely remit up to $2,50,000 per financial year for any\npermissible current or capital account transaction or a combination of both.\no Individuals require the RBI’s prior permission to make any remittance above this threshold.\no The Scheme is not available to corporates, partnership firms, HUF, Trusts etc.\no The remittances can be made in any freely convertible foreign currency.\n\n@ Prohibited Remittances\n\n» For purpose specifically prohibited\nunder Schedule-| or restricted under\n\n» Private visits to any country except\nNepal and Bhutan.\n\nSchedule Il of FEM(CAT) Rules.\n\n» For trading in forex abroad.\n\n» Capital account remittances to\ncountries identified by FATF as\nnon-cooperative countries.\n\n» To those individuals and entities\nidentified as posing risk of committing\nacts of terrorism.\n\n» For gifting to another resident in foreign\ncurrency.\n\n» Gift or donation.\n\n» Going abroad for employment.\n\n» Emigration.\n\n» Maintenance of close relatives abroad.\n» Travel for business or conference or\n\nspecialised training or for medical\nexpenses.\n\n» Studies abroad.\n\n\n6.8. CREDIT RATING AGENCIES\n\nWhy in the news? . . e\nRatings agency Moody's has Rating Symbols explained\n\naffirmed a BAA3 rating on India The highest degree of safety reg ~ a)\nand maintained a stable outlook timely servicing of debt obligat!\n\non the Indian economy.\n\nHave high degree of safety. Have high risk of default.\nGlobal Credit Rating Agencies (™) = ) () —— )\n(CRAs)\n\nOo\n* Sovereign ratings assess . -\nthe creditworthiness of In default or are expected to be in\ncountries and are a key ( ) ) ( Yaseen )\n\ngauge for investors.\n* Covering more than $66 trillion in sovereign debt, the credit ratings agencies act as gatekeepers to global\n\ncapital. eo\n* Currently, India is rated Role of Credit Ratings ~\ninvestment grade by three . i\nmajor Credit Rating 7 ~ +) >\ny, ,\nAgencies (CRAs) - Standard | “*/ i) | Enable\nFitch. to make well Encourage borrower to ‘e\n* There are several criteria informed pov ities to defalult or investors in\nbehind rating a government’s decisions, eee comesteone\ncreditworthiness - markets,\n\no Political risk, taxation,\ncurrency value and labour laws.\no Another is sovereign risk, where a country's central bank can change its foreign exchange regulations.\n\nCredit Rating in India\n\n* In India, the Securities and Exchange Board of India (SEBI) regulates all credit rating firms under the\nSEBI (Credit Rating Agencies) Regulations, 1999.\n\n« There are seven credit rating agencies in India: CRISIL; CARE; ICRA; Acuité Ratings; Brickwork Rating;\nIndia Rating and Research Pvt. Ltd., and Infomerics Valuation and Rating Pvt. Ltd.\n\n* What do they do?\no Empower market participants with timely information and unbiased opinions.\n© Help the financial market grow and be more efficient.\no Evaluate and assess an individual’s or a company’s creditworthiness.\n\n6.9. INCREASE IN IMF QUOTA IMF Quota *\nWhy in the news? |___ Formula\nEconomic —_ Intemational\nInternational Monetary Fund (IMF) Executive Board approved a proposal to woroblity (eserves\nincrease in IMF Quota. 15% 5%\nOpenness to the\nMore on the news GDP global economy\n50% 30%\n\n« The board proposes a 50 % quota increase allocated to members in\nproportion to their current quotas.\no Now, the proposal will be considered and voted on by the Board of Governors, after which it will be made\neffective.\n* Significance of the rise in Quota\no Help safeguard global financial stability by enhancing the IMF’s permanent resources.\n\no Reducing reliance on borrowed resources.\n¥ Currently, the Fund relies on bilateral borrowing arrangements and pledges to a crisis lending fund\ncalled the New Arrangements to Borrow for nearly 60% of its lending resources.\n\nAbout IMF Quota\n\nQuotas are the building blocks of the IMF's financial and governance structure.\n© Quotas are denominated in Special Drawing Rights (SDRs), the IMF's unit of account.\nUse of Quotas is to determine:\no Resource contribution of amember\no Voting power in IMF decisions.\n¥ Members get one vote per SDR100,000 of quota plus basic votes, which are the same for all\nmembers.\no Amount of loans a member can obtain from the IMF.\no General allocation of SDRs.\nIndia currently has Quota of 2.75 % with voting rights of 2.63%.\n\nInternational Monetary Fund (IMF)\n\nKey Reports: World Economic Outlook and Global Financial Stability Report.\n\nGenesis: Founded at the Bretton Woods Conference in 1944.\n\no Countries must first join the IMF to be eligible to join the world Bank Group.\n\nHQ: Washington DC\n\nRole: IMF has three critical missions:\n\no Furthering international monetary cooperation,\n\no Encouraging the expansion of trade and economic growth, and\n\no Discouraging policies that would harm prosperity.\n\nMember: 190 including India.\n\nConnections: It cooperates closely with other groups, including G20, and supports the G20's efforts to\nsustain international economic cooperation through its mutual assessment process.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 7,
                "chapter_name": "7. AGRICULTURE",
                "chapter_path": "./screenshots-images-2/chapter_7",
                "sections": [
                    {
                        "section_id": 7.1,
                        "section_name": "7. AGRICULTURE",
                        "section_path": "./screenshots-images-2/chapter_7/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_7/section_1/103ff05f-7d5e-4bde-a9be-f5b3fb18e063.png",
                            "./screenshots-images-2/chapter_7/section_1/ff4b25a6-b4c9-4746-95b6-e85fc3a4d293.png",
                            "./screenshots-images-2/chapter_7/section_1/8082fab7-b092-4bee-b315-28d7f17b4264.png",
                            "./screenshots-images-2/chapter_7/section_1/43e33b81-6597-4125-be4f-ef9d7ff8a334.png",
                            "./screenshots-images-2/chapter_7/section_1/8f25d442-eb63-4156-b5b0-8ded02ee7647.png",
                            "./screenshots-images-2/chapter_7/section_1/1b366e12-40d2-4f7d-9ec3-8e5cec4d3124.png",
                            "./screenshots-images-2/chapter_7/section_1/03f62976-0d4d-4d3a-b0c6-2dcdb2eb1726.png",
                            "./screenshots-images-2/chapter_7/section_1/3d3185ac-32a7-4873-abc1-684e5f395212.png",
                            "./screenshots-images-2/chapter_7/section_1/d014f578-9145-4b87-9da1-fcf640d7aff7.png",
                            "./screenshots-images-2/chapter_7/section_1/6c51d52f-5dc8-48c5-a277-497ddc3f83f6.png",
                            "./screenshots-images-2/chapter_7/section_1/d444e7a2-999d-4e8d-85e1-22fa4445657c.png",
                            "./screenshots-images-2/chapter_7/section_1/0ad0df0f-969d-4696-b1e6-c4978495da6b.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "7.1. FERTILISERS SECTOR IN INDIA\n\nWhy in the news?\n\nRecently, the Cabinet Committee on Economic Affairs (CCEA) has approved a unique package of innovative\nschemes for farmers with a total outlay of Rs.3.70 Lakh crore.\n\nKey highlights of approved schemes\n\n* PM Programme for Restoration, Awareness Generation, Nourishment and Amelioration of Mother —\nEarth (PM-PRANAM), announced in Budget 2023-24, to incentivize States/ UTs to promote alternate\nfertilizers and balanced use of chemical fertilizers.\n\n* Market Development Assistance (MDA) for promoting Organic Fertilizers from GOBAR-Dhan\n(Galvanizing Organic Bio-Agro Resources- Dhan) Plants.\n\no GOBAR-Dhan was launched in 2018 under the Swachh Bharat Mission (Grameen) (SMB-G) to positively\nimpact village cleanliness and generate wealth and energy from cattle and organic waste.\n\n* Introduction of sulphur-coated Urea (Urea Gold), for the first time, to address the sulphur deficiency of\nsoil and save input costs for the farmers.\n\no Urea Gold is more economical and efficient than the currently used Neem-coated urea.\n\n« Urea Subsidy Scheme (a Central Sector Scheme) has been extended for another three years till March\n2025 to maximize indigenous production of urea to reach self-sufficiency levels by 2025.\n\nFertilizer industry in India INDIA’S FERTILISER SECTOR il\n\n*  Itis one of the eight core industries.\n\no Urea accounts for over 2/3rd of\n\noverall fertiliser consumption.\no The major requirement of potash is aa Sdn yent produces\n\nmet through imports. Amongst world’s largest importer of fertiliser material.\n« Fertilizers are classified as Primary, ic whe sn }\n\nSecondary and Micronutrients.\n\no Primary fertilizers are further classified on the type of nutrients they supply to soil such as\nnitrogenous (urea), phosphatic (Di-Ammonium Phosphate (DAP)) and potassic (muriate of potash\n(MOP)) fertilizers.\n\no Secondary fertilizer includes calcium, magnesium, and Sulphur while micronutrients include iron,\nzinc, boron, chloride etc.\n\npsd 2nd largest fertiliser consuming country after China.\n\n|7.1.1. PHOSPHORUS SECTOR\n\news?\nWhy in the news? Ways to reduce phosphorus paucity ~\nSeveral surveys and researches have indicated that India is\nfacing deficiency in obtaining Phosphorus. = Reduce use of chemical fertilizers\n\node | thi in i 5\nMore about the s rough precision agriculture.\n\nAdoption of low input agro-\n\necological approaches\n\n* India is the world’s largest importer of Phosphorus, most\nof it from the cadmium-laden deposits of West Africa. a\n\n© Phosphate rocks are majorly produced only from two\nStates in India, namely Rajasthan and Madhya\n\nMining urban sewage to produce\nphosphorus\n\nPradesh.\n\no Some deposits are also present in the central part of\npeninsular India, Lalitpur (Uttar Pradesh), Mussoorie\nsyncline, and Cuddapah basin (Andhra Pradesh).\n\n\n« Concerns with Phosphorus availability:\no Atmost places, Phosphorus coexists with Cadmium, a heavy metal whose removal is expensive.\no Handfulof countries such as Morocco, Western Sahara, China, Algeria etc control most of the world’s\nreserves of phosphorus which is a major geopolitical concern.\n« Harmful effects of phosphorus:\n© Much of phosphorus is lost directly to water bodies as agricultural run-off and through sewage which\nleads to growth of toxic algal blooms.\no Cadmium-laden fertilizers are often applied to the soil, absorbed by crops, and consumed,\nbioaccumulating in human bodies accelerating heart disease.\n\n7.2. MINOR IRRIGATION\n\nWhy in the news?\n\nMinistry of Jal Shakti recently released the sixth Census Report on Minor Irrigation Schemes. (The First census\nwas conducted with the reference year 1986-87 with the report published in 1993.)\n\nAbout Minor Irrigation (MI)\n\n* Classification: Irrigation Projects in India are classified into three categories, viz. Major, Medium and Minor\nIrrigation.\no Major Irrigation Projects: Cultivable Command Area (CCA) of more than 10,000 hectares.\n\nY¥ Cultivable Command Area (CCA) is an area which can be physically irrigated from a scheme and\nis fit for cultivation.\n\no Medium Irrigation projects: CCA of less than 10,000 hectares but more than 2,000 hectares.\no Minor Irrigation Projects: CCA of 2,000 hectares or less.\n\n* Sources: Minor irrigation projects have both surface and groundwater as their source, while Major and\nMedium projects mostly exploit surface water resources.\n\n* Minor Irrigation (MI) sector as a whole is implemented by State Governments, and states have state-\nspecific schemes.\n\ne\n\n( Categories of Minor irrigation schemes |\n\n@ cS)\n\nGround water Schemes, Surface flow schemes\nConsisting of dug wells, bore wells, Shallow Tube Consists of tanks, check-dams, structures for\nwells, Medium Tube wells and Deep tube wells conservation cum ground water recharge.\n\n* Rationalization of Minor Irrigation Statistics (RMIS):\no The Centrally Sponsored Plan Scheme was launched in 1987-88.\no Later, it became a part of the Central Sector Plan Scheme “Development of Water Resources\nInformation System (DWRIS)”.\no The main objective of the RMIS scheme is to build up a comprehensive and reliable database in the\nMinor Irrigation (MI) Sector for effective planning and policymaking.\n\nKey Highlights of the Report\n\n« First Census of Water Bodies: It was conducted in convergence with the sixth Minor Irrigation schemes,\nusing 2017-18 as the reference year.\nco Its objective was to develop a national database for all water bodies.\n* Minor Irrigation Schemes in India:\n© 23.14 million Minor Irrigation schemes were reported in the country from 695 districts.\no 94.8% of the Minor Irrigation schemes are groundwater-based, and the rest, 5.2%, are surface-water\nschemes.\n\nco Uttar Pradesh possesses the largest number of Minor irrigation schemes in the country, followed by\nMaharashtra, Madhya Pradesh, and Tamil Nadu.\n\no Dug wells have the highest share in MI schemes followed by shallow tube wells, medium tube wells\nand deep tube wells.\n\nIncrease of 1.42 million in Minor Irrigation schemes as compared to the fifth Census.\n\nOwnership of minor irrigation schemes: 96.6% are privately owned whereas 3.4% are under public\n\nownership.\n\no Out ofall the individually owned schemes, 18.1% are owned by women.\n\nUsage of schemes: 97% of the irrigation schemes are ‘in use’.\n\n7.3. BHARATIYA BEEJ SAHAKARI SAMITI LTD (BBSSL)\n\nWhy in the news?\n\nRecently, the Bharatiya Bee) Sahakari Samiti Ltd (BBSSL) was established in 2023 to provide certified and\nscientifically prepared seeds to every farmer in the country.\n\nAbout BBSSL\n\nIt was established under the Multi-State Cooperative Societies (MSCS) Act, of 2002.\n\nIt will contribute to the field of traditional seed conservation, promotion and research.\n\nco Traditional seeds have to be conserved and passed on to the coming generations so that the production\nof healthy grains, fruits and vegetables continues.\n\nItis jointly promoted by-\n\nco Indian Farmers Fertilizer Cooperative Ltd (IFFCO)\n\nKrishak Bharati Cooperative Ltd (KRIBHCO)\n\nNational Agricultural Cooperative Marketing Federation of India (NAFED)\n\nNational Dairy Development Board (NDDB)\n\nNational Cooperative Development Corporation (NCDC)\n\nBBSSL and other cooperative societies are playing a key role in ensuring the welfare of farmers.\n\n0000\n\n7.4. SEED CERTIFICATION\nWhy in the news? —— er\nMinistry of Agriculture & Farmers Welfare (MoA&FW) — Unpredictability Short shelf life,\nlaunched SATHI (Seed Traceability, Authentication of demand of certified seeds\nand Holistic Inventory) Portal. 7\n\ncertified seeds. are only good for\n\nMore on the news\n\none season\n\nIt is a Centralized Online System designed to\n\ndeal with challenges of seed production, Issues with\n\nquality seed identification and seed seed\ncertification. re .\no Seeds authenticity can be traced through certification\na QR code system. bor\no Portal has been developed by National\nInformatics Centre in collaboration with\nMoA&FW on theme of ‘Uttam Beej - Lack of effective Lack of access\n\nSamriddh Kisan. monitoring to to certified\nseeds due to\n\no Seeds with valid certification can only be control seed /\nsold by valid licensed dealers to centrally lit infrastructural\nregistered farmers who will receive subsidy ante gaps.\nthrough DBT directly into their pre-validated ————\n\nbank accounts.\n\n« In India, legal status to seed certification was given by Enactment of Seeds Act, 1966. Seed certification\nis voluntary, but labelling is compulsory in India.\n\n* India established Protection of Plant Varieties and Farmers Rights (PPV&FR) Authority, under PPV&FR\nAct, 2001 to ensure availability of quality seeds and planting material to farmer.\n\n7.5. FOOD STORAGE IN INDIA\n\nWhy in the news?\n\nThe Union Cabinet approved the constitution and empowerment of an Inter-Ministerial Committee (IMC) for the\nfacilitation of the “World’s Largest Grain Storage Plan in the Cooperative Sector”.\n\nMore about the news\n\n« Aim: Strengthening food security, reducing wastage, and empowering farmers by creating godowns and\nagricultural infrastructure at the Primary Agricultural Credit Societies (PACS) level.\no PACS are village-level cooperative credit societies that serve as the last link in a three-tier\n\ncooperative credit structure headed by the State Cooperative Banks (SCB) at the state level.\n\no PACS are involved in short-term lending — or what is known as crop loans.\n\n« Implementation: To ensure timely and uniform implementation of the plan, the Ministry of Cooperation\nwould implement a pilot project in at least 10 selected districts of different States.\n\n* Convergence of several Schemes under the plan (refer to image).\n\n| oe Schemes identified for Convergence\n\nink > Agriculture Infrastructure Fund (AIF).\nagricultu ry of ind | |” Agricultural Marketing Infrastructure Scheme (ami).\nFarmers Welfare | | » Mission for Integrated Development of Horticulture (MIDH).\n\n» Sub Mission on Agricultural Mechanization (SMAM).\n\n“ Ministry of » Pradhan Mantri Formalization of Micro Food Processing\nFood Processing Enterprises Scheme (PMFME).\ndual Industries >» Pradhan Mantri Kisan Sampada Yojana (PMKSY).\n\nConsumer Affairs, ‘Act, 2013.\n\nfood and public\n\nMinistry of » Allocation of food grains under the National Food Security\nBe Distribution » Procurement operations at Minimum Support Price.\n\nFood grain management in India\n\n« Total production: India has been producing about 310 million tonnes of food grain/year for the last 2 years.\n* Food grain procurement mechanism in India:\n\no Centralized Procurement System: The procurement of food grain in the Central Pool is undertaken\neither by the Food Corporation of India (FCI) directly or by State Government agencies which hand over\nthe stocks to FCI.\n\no Decentralized Procurement Scheme: Introduced in 1997-98, food grains are procured and distributed\nby the State Governments themselves.\n\n¢ Distribution of food grain\n\no TheCentral Government, through FCI, has assumed the responsibility for procurement, storage,\n\ntransportation, and bulk allocation of food grain to the State Governments.\n\n7.6. MANAGING FOOD INFLATION IN INDIA\n\no The operational\nresponsibilities\nincluding\nallocation\nthe State,\nidentification —_ of\neligible families,\nissue of Ration\nCards, and\nsupervision of the\nfunctioning of Fair\n\nwithin 2751\n\n380 2515\n\nPulses and ollseeds\nmillion tonnes\nFa\n5\n\nSs\nSs\n\nmaso 2082 g\n\nSustained increase in Foodgrains Production in india (Million Tonnes)\n\n3187\noars 307\n\nPrice Shops, etc.,\nrest with the State\nGovernments.\n\n2014-15 2015-16 2016-17\n\ntit ollseeds\n\n2097-18\n\n2088-19 2019-20 2020-21 2021-22\n\npulses Beene foodgrains\n\nWhy in the news?\n\nThe Indian Council for Research on International Economic Relations (ICRIER) has estimated that measures to\ncurb inflation including banning cereal exports has cost farmers at least %45,000 crore in 2023.\n\nMore on the news\n\nTo curb food inflation, Government imposed restrictions on trade of food commodities and imposed export\n\ntaxes to boost supplies, which have dented farmers’ incomes.\n\nRelease of government's own stocks of grain at substantially lower prices than market rates also resulted in\n\na potential loss of an additional %548 a quintal to farmers.\n\nInflation Measurement in India\n\nWholesale Price Index (WPI) measures the inflation at the\nwholesale level while Consumer Price Index (CPI)\ncalculates inflation at the retail level.\n\nWPI considers price change of goods only while CPI\nconsiders both goods and services.\n\nWPI gives more weightage to manufactured goods whereas\nCPI gives more weightage to food items.\n\nWPI is released by the Economic Advisor in the Ministry of\nCommerce and Industry.\n\nThe National Statistical Office (NSO), Ministry of Statistics\nand Programme Implementation (MoSPI) releases All India\nconsumer price index.\n\nAll India Consumer Price Index- Groups,\n\nFood and\nBeverages\n(45.9%)\n\nHousing (10.1%)\n\nFueland\nLight (68%)\nClothing and\nFootwear (65%)\n\nWeightage of different items\n\n» Pan, Tabacco and\n)) intoxicants (2.4%)\n\nFood Inflation in India\n\nRetail Inflation touched 6.83% with Food Inflation 9.2% in August 2023.\nMajor Contributors to current food inflation include tomatoes, onions, cereals (wheat and rice) etc.\n\nRussia-Ukraine war.\n\nFactors Affecting India’s Food Inflation in the Long Term\n\no Wheat inflation is due to domestic and global factors like heat waves, unseasonal rains and the\n\nMonsoon Variability, which is further aggravated by climate change.\nGlobal Commodity prices include food as well as crude oil prices.\n\nGovernment policies including the MSP policy.\n\nInfrastructure Availability such as storage and distribution systems.\n\n« Exchange rate fluctuations affect agri-trade and thus agri-prices.\n* Outbreak of pests and diseases can affect crop yields and prices.\n\nThe mechanism for Price Monitoring and Control\n\n* Price Monitoring Division (PMD): Price Monitoring Division in the Department of Consumer Affairs monitors\nthe prices of selected essential commodities.\nco It analyses the price situation and gives advance feedback for taking preventive measures.\no Itimplements commodity-specific market intervention schemes to give temporary relief.\no The Centre targets around 750 PMCs (one in each district) to monitor the prices of 22 essential food\ncommodities (refer image).\n\n@\n\nL 22 Essential Commodities for Price Monitoring |\n\n@) Food Grains (2) Pulses Edible Oils Vegetables (©) Other items\nRico\n\nGram Groundnut oll Potato Sugar\nWheat Tur Mustard oil Onion Gur\nAit Urad Vanaspati Tomas Milk\n° Moong Soya oll omar Toa\nMasur Sunflower cil Salt\nPalm oil\n\n« Essential Commodities Act, 1955: It empowers the central government to control the production, supply,\ndistribution, trade, and commerce of certain commodities.\no TheAct can impose stock limits on essential commodities to regulate their prices and availability in the\nmarket.\n\nOther Measures to Manage Food Inflation\n\n* Operation Greens: It was launched on the lines of Operation Flood to promote Farmer Producers\nOrganizations (FPOs), processing facilities, price stabilization, and market intelligence to prevent localized\ngluts.\n\n« Price Stabilization Fund (PSF): The intervention aims to regulate price volatility through procurement of\nselected produce, maintenance of buffer stock and regulated release into the market.\n\n« Export Restrictions like Export ban, Minimum Export Price (MEP) etc.\n\n* Direct Support to Farmers: Through subsidies, income support and MSP.\n\n* Supply-Side Measures like improving agricultural productivity, promoting diversification etc.\n\n7.7. AQUACULTURE SECTOR\n\nWhy in the news?\n\nThe Parliament has enacted India’s Fisheries Sector\n\nCoastal Aquaculture Authority\n(Amendment) Act, 2023.\n\nMore on the news\n\n}* in inland capture fish production.\n\n* The Act amends certain 2°4 in aquaculture fish production.\nprovisions of the Coastal\nAquaculture Authority\n(CAA) Act, 2005 and 3\" in overall fish production.\ndecriminalise offences\n\nunder it.\n\n4\" in Exports of Fish and Fisheries products.\n\n\nco This 2005 act established the Coastal Aquaculture Authority to regulate coastal aquaculture.\n« It aims at promoting ease of doing business and fine-tuning the operational procedures of the Coastal\nAquaculture Authority.\n\nAquaculture\n\nIt is the farming of fish, seaweed,\nand other aquatic species.\n\nBottom Culture\n\nBottom culture (lines, trays,\nor bags) is used to farm\nseaweed and bivalves, like ang shrimp on land or\noysters, in shallow coastal in, coastal or\nSubmerged Cages and Net Pens Lines areas. freshwater areas.\nSubmerged cages and net pens are | Lines are used to farm seaweed and\n\nused to farm finfish in the ocean. bivalves, like mussels, in the ocean.\n\nPonds and Tanks\nPonds and tanks are\nused to farm finfish\n\nKey Provisions of the Act\n\n* Coastal Aquaculture: The Act defines “Coastal Aquaculture” as the rearing and cultivation of any life\nstages of fish, including crustaceans, molluscs, finfish, seaweed or any other aquatic life under controlled\nconditions, either indoor or outdoor, in saline or brackish water in coastal areas.\n\no It also includes activities such as the production of broodstock, seed, and grow-out, but does not\ninclude freshwater aquaculture.\n\n* Scope: It expands the scope of the CAA Act beyond coastal aquaculture ‘farms’ to cover all the verticals\nand activities of coastal aquaculture for its sustainable development.\n\n« Regulation of allied coastal aquaculture activities: The Act prohibits coastal aquaculture activities in\nEcologically Sensitive Areas (ESAs), No-Development Zones (NDZs) and within Coastal Regulation Zones\n(CRZs).\n\no Although some allied activities like Seaweed culture, nucleus breeding centres etc. have exemptions\nfrom these regulations.\n\n* Changes to Coastal Aquaculture Authority:\n\no Composition of CAA: The Act adds a representative from the Ministry of Fisheries, Animal Husbandry\nand Dairying as a member.\n\no Increased scope: The Act enhances the scope of regulation by requiring any facility that is engaged in\ncoastal aquaculture or any allied activity to be regulated as a coastal aquaculture unit.\n\no Expanded Functions: The Act adds that the Authority shall regulate coastal aquaculture inputs, monitor\naquaculture units, and fix environmental standards.\n\n* Decriminalization: The Act removes the imprisonment provisions of the Act for its contravention and\nreplaces them with suitable monetary and other penalties.\n\n* Adjudication and Appeals: Under the Act, the central government may authorise an officer of at least\nUnder Secretary level to adjudicate penalties.\n\n7.8. INLAND FISHERIES\n\nWhy in the news?\n\nIndia has recently overtaken China to become the largest contributor of inland capture water fisheries, thereby\nemerging as one of the top three fish-producing countries in the world.\n\nAbout Inland Fisheries\n\n« Inland fisheries refer to the harvesting, management, and conservation of fishes generally in freshwater\nbodies such as rivers, lakes, reservoirs, ponds etc.\n\n«  Itis mainly done by two . -\nmethods:- Inland Fisheries Trends @\n\no Capture fisheries: no.\n\nObtaining —_ fish 100 Inland Production\ndirectly from lakes,\nrivers or ponds with\nthe help of fishing\ngears or nets etc.\n\no Culture fisheries:\nRaising and\nharvesting fish in\ncontrolled\nenvironments with —\ntools of breeding or\nfeed management bag T T T T T\netc. 1995 2000 2005 2010 2015 2020\n\n* Types of Inland Inland fish production has doubled past 9 years to 131 lakh tonnes.\nFisheries:\n\nTanks and Ponds- culture-based fishery is predominant.\n\nCold Water Fisheries- Opportunity for promotion of omega-packed trouts in Himalayan states.\n\nCage Culture in Reservoirs- Promoting culture-based fisheries in small and medium reservoirs.\n\nBrackish & Saline Aquaculture- mainly for shrimp aquaculture and transforming ‘Waste land to Wet-\n\nlands’.\n\nOrnamental Fisheries- India has diverse (>195) varieties of fishes.\n\no Riverine Fisheries- River ranching can be used for conservation of indigenous fisheries resources.\n\n2000 onwards Inland\nFish production\nstarted seeing a peak\n\n60 in India\n\nMarine Production\n\nFish Production in MMT\n\ne000\n\n°\n\n7.9. CREDIT GUARANTEE SCHEME FOR THE LIVESTOCK SECTOR\n\nWhy in the news?\n\nDepartment of Animal Husbandry and Dairying (DAHD), Ministry of Fisheries, Animal Husbandry and Dairying\n\nhas launched the first-ever Credit Guarantee scheme for the livestock sector.\n\nMore on News\n\n* DAHDhas established a Credit Guarantee Fund Trust of § 750 crores, which will provide credit guarantee\ncoverage of up to 25% of the credit facilities extended to the MSMEs.\n\n« It aims to strengthen credit delivery system and facilitate smooth flow of credit to the MSMEs engaged in\n\nthe Livestock sector.\n« — Itwill be under the Animal Husbandry Infrastructure Development Fund (AHIDF).\n\nAbout AHIDF\n\n«  Itis acentral-sector scheme established under the Atma Nirbhar Bharat Stimulus Package.\n\n¢  Itincentivizes investments by individual entrepreneurs, private companies, MSMEs, Farmers Producers\nOrganizations (FPOs) and Section 8 companies to establish:\n©. dairy processing and value addition infrastructure\n\nmeat processing and value addition infrastructure\n\nanimal feed plant\n\nbreed improvement technology and breed multiplication farm\n\nsetting up of veterinary and drug production facilities\n\nanimal waste to wealth management (Agri-waste management)\n\nooo0o0\n\n\n« Financial support in the scheme:\nco Interest subvention of 3%.\n© Loans up to 90% of the total project cost from any Scheduled Bank, National Cooperative\nDevelopment Corporation (NCDC).\n\nAbout Livestock Sector\n\n« Animal Husbandry is a State subject.\n« As per the 20th livestock census, the total Livestock increased by 4.8% over the Livestock Census 2012.\n* Types of Animal Husbandry include-\no Dairy Farming (caring for dairy animals like cows,\nbuffaloes, sheep, and goats); H\no Poultry Farming (commercial rearing and : » Father of White Revolution inindiais :\nbreeding of birds), ? Padma Vibhushan Dr Verghese Kurien. :\no Fish Farming; > He led Operation Flood to make India :\no Beekeeping (Apiculture) etc. the biggest milk producing nationin :\n\nBasic Animal Husbandry Statistics 2023: Key Findings the word,\nof the Survey (from 2018-19 to 2022-23)\n\nCommodity | Growth Status Major Contributors ]\nMilk Production (White | Increased by 22.81% | Uttar Pradesh followed by Rajasthan, Madhya Pradesh,\nRevolution) and Gujarat\n\nEgg Production (Silver Andhra Pradesh followed by Tamil Nadu, Telangana,\nRevolution) and West Bengal\n\nMeat Production (Pink | Increased by 20.39% | Uttar Pradesh followed by West Bengal\n\nRevolution)\n\nWool Production | Decreased by 16.84% | Rajasthan followed by Jammu & Kashmir |\n\nIssues with India’s Livestock Sector\n\nIncreased by 33.31%\n\n« Low productivity: The average annual milk yield of Indian cattle is 1172 kg which is only about 50% of the\nglobal average.\n\n* Shortage of feed and fodder: India has 2.3% of the land area of the world to maintain nearly 10.7% of global\nlivestock.\n\n« Animal Health: Increased susceptibility of livestock to various diseases including exotic diseases.\n\n* Sub-optimal state support: Livestock sector received only ~12% of public expenditure on agriculture\nand allied sector against 25.6% contribution of livestock in total agro-GDP.\n\n« Marketing, processing and value addition: Absence of necessary infrastructure like dairy processing units,\nmeat processing plants, carcass utilization centres, etc.\n\n« Livestock and Environment: Climate change and global warming may have serious implications in the\nform of heat stress, loss of animal habitat vector-borne disease.\n\n7.10. NATIONAL TURMERIC BOARD\n\nWhy in the news?\nGovernment of India has notified the establishment of a National Turmeric Board in the state of Telangana.\nAbout National Turmeric Board\n\n« Established to increase awareness and consumption of turmeric and develop new markets\ninternationally to increase exports.\n* The proposed board is to work under the aegis of the Ministry of Commerce.\n\nComposition of the Board\n\nit & mm | sis\n\nChairperson Secretary Four members Members from\nselected by the | appointed to the representing the national/state institutions\nCentral Board by the Ministries of involved in research,\nGovernment Commerce Commerce, representatives of turmeric\n\nMinistry Agriculture, Ayush, farmers and exporters\n\nand Pharmaceuticals. among others.\n\nKey Objectives of the Board\n\nCreate demand in domestic and international markets through promoting new product and value addition.\nCreate and improve infrastructure and logistics for exports of turmeric and turmeric products.\n\nEnsure quality and safety standards across the supply chain of turmeric.\n\nDocument the traditional knowledge related to use of turmeric and its applications.\n\nEncourage studies, clinical trials and research on medicinal, health and wellness-enhancing properties\nof turmeric.\n\n7.11. NATIONAL BANK FOR AGRICULTURE AND RURAL DEVELOPMENT\n(NABARD)\n\nWhy in the news?\n\nThe National Bank for Agriculture and Rural Development (NABARD) has successfully raised INR 1,041 crore\nthrough its five-year social impact bond.\n\nSocial Impact Bond (SIB)\n\n« ASIB is an innovative financing mechanism in which governments enter into agreements with social\nservice providers, such as NGOs, and investors to pay for the delivery of pre-defined social outcomes.\n\n* The Pimpri Chinchwad Municipal Corporation (PCMC) in Maharashtra's Pune district signed a\nMemorandum of Understanding (MoU) with the United Nations Development Programme (UNDP) India\nto co-create India’s first Social Impact Bond (SIB).\n\nAbout NABARD\n\n« Genesis: It came into existence on the recommendation of B. Sivaraman committee in 1982 by the NABARD\nAct, 1981 by transferring\n\no Agriculture credit functions of RBI and\n\no Refinance functions of the Agriculture Refinance and Development Corporation (ARDC).\n\nMinistry: Administered by the Ministry of Finance.\n\nOwnership: Wholly owned by the Government of India.\n\nVision: Development Bank of the nation for fostering rural prosperity.\n\nMission: Promote sustainable and equitable agriculture and rural development through participative\nfinancial and non-financial interventions.\n\n| Functions of NABARD |\nCredit Related Functions Non Credit Related Functions\n\n* Providing refinance to lendinginstitutions inruralareas. | Supporting the financial inclusion\n* Facilitating credit flow for promotion and development efforts of Regional Rural Banks and\nof agriculture, small-scale Industries, cottage and village cooperative banks.\nIndustries, handicrafts, and other rural crafts.\n\n\n* Loans to cooperatives, Farmers Producer’s|* Thrust on the promotion of livelihood\nOrganisations (FPOs), Primary Agricultural Credit opportunities and Micro Enterprises.\nSocieties (PACS) or similar institutions * Support research and development,\n\nrural innovations etc.\n\nInitiatives taken by NABARD\n\n* Promotion and Development: Around Rs. 5 lakh crore has been sanctioned under the country's Rural\nInfrastructure Development Fund (RIDF) (created in NABARD).\n\n« Watershed Development Fund and Tribal Development Fundare other important livelihood\ninterventions.\no The Wadi model has become a vital livelihood intervention for the tribal population.\n\n« Refinancing: In the last 42 years, NABARD has refinanced Rs 20 lakh crore in the rural economy.\n(Refinancing is taking a newer loan to pay off existing debt.)\n\n* Strengthening Rural Financial Institutions (RFls): NABARD supervises Rural Cooperative Banks (RCBs)\nand Regional Rural Banks (RRBs).\n\n7.12. INDIAN COUNCIL OF AGRICULTURAL RESEARCH (ICAR)\n\nWhy in the News?\n\nIndian Council of Agricultural Research (ICAR) and Consultative Group on International Agricultural\nResearch (CGIAR) Gender Impact Platform hosted ‘International Research Conference on ‘From research to\nimpact: Towards Just and Resilient Agri-Food Systems’.\n\nAbout ICAR\n\n* Ministry: Autonomous organisation under the Ministry of Agriculture and Farmers Welfare.\n\n« Genesis: Formerly known as Imperial Council of Agricultural Research.\no Established in 1929 as a registered society under the Societies Registration Act, 1860 in pursuance of\n\nthe report of the Royal Commission on Agriculture.\n\n«e Function: Apex body for co-ordinating, guiding and managing research and education in agriculture\nincluding horticulture, fisheries, and animal sciences in the country.\n\n«¢ Other Information: With 113 ICAR institutes and 74 agriculture universities spread across the country this\nis one of the largest national agricultural systems in the world.\n\nRole of ICAR towards better and resilient agri-food systems\n\n* Crop Varieties: Key role in Green Revolution developing new high-yielding varieties of crops.\n\no Rice varieties - Jaya (first rice variety released in India), Swarna, Pusa Basmati 1121 (world’s longest\nbasmati rice) etc.\n\no Wheat varieties - HD 2967, DBW 187 etc.\n\nco Fruit varieties - Amrapali, Pomegranate Bhagwa etc.\n\n* Seed Programs: ICAR deposited seeds in the Svalbard Global Seed Vault as safety duplicates.\n\n« Genomics: Helped to establish the National Gene Bank in New Delhi (second largest gene bank in the\nworld).\n\no ICAR partnered in the global genome sequencing of rice, wheat, tomato and potato and\nindependently sequenced the genome of pigeonpea, jute, mango and fishes.\n\n* Promoted Climate Smart Farming: Through rainwater harvesting, climate resilient varieties such as Rati\nML 365, Pigeonpea BRG 1, BRG 2 and BRG 5, and hydroponic cropping.\n\n* Bio-Technology Solutions: Biofortified crops like Solapur Lal (first biofortified pomegranate variety),\nGroundnut Girnar 4 and 5, Pusa Double Zero Mustard 31 (first canola quality Indian mustard variety) etc. to\ntackle malnutrition.\nco Developed Pusa decomposer for in situ and ex situ crop residue decomposition to mitigate residue\n\nburning problems.\n\nco India developed first cloned buffalo in the world and Pratham, the world’s first in-vitro fertilized\nbuffalo calf.\n\nConsultative Group on International Agricultural Research (CGIAR)\n\n« Established in 1971, it is a strategic partnership of donors that support 15 international research\ncentres, working in collaboration with government, civil society organizations and private businesses.\n\n* CGIAR is a global research partnership for a food-secure future dedicated to transforming food, land,\nand water systems in a climate crisis.\n\n* It focuses on five impact areas (see image).\n\neo\nImpact Area\nNutrition, Health, Poverty Gender Equality, Climate Environmental\nand Food Reduction, Youth and Social | Adaptation and Health\nSecurity Livelihoods, and Inclusion Mitigation Biodiversity\n\nJobs\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 8,
                "chapter_name": "8. MINING AND INDUSTRY",
                "chapter_path": "./screenshots-images-2/chapter_8",
                "sections": [
                    {
                        "section_id": 8.1,
                        "section_name": "8. MINING AND INDUSTRY",
                        "section_path": "./screenshots-images-2/chapter_8/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_8/section_1/0af6920e-f869-4d1c-9c38-28bcdeb40173.png",
                            "./screenshots-images-2/chapter_8/section_1/3b3e6744-d7df-42ca-b0c2-78858b2e5743.png",
                            "./screenshots-images-2/chapter_8/section_1/ed932ebc-6076-48d1-b0be-373312ae1968.png",
                            "./screenshots-images-2/chapter_8/section_1/3481e29a-6a7f-498e-9ec0-09dd34fef689.png",
                            "./screenshots-images-2/chapter_8/section_1/ef14547a-0796-4b93-aaff-10e7be05ef9e.png",
                            "./screenshots-images-2/chapter_8/section_1/345cb499-c56e-43b5-9cee-a9606be8adf6.png",
                            "./screenshots-images-2/chapter_8/section_1/1eab262f-6022-448e-82da-60155609f319.png",
                            "./screenshots-images-2/chapter_8/section_1/084f895e-1a50-4833-a183-6889de1acd03.png",
                            "./screenshots-images-2/chapter_8/section_1/bd35fee0-0c84-4a89-85d1-6c9a48a25a79.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "8.1. THE MINES AND MINERALS (DEVELOPMENT AND REGULATION)\nAMENDMENT ACT, 2023\n\nWhy in the news?\nRecently, the Parliament passed the Mines and Minerals (Development and Regulation) Amendment Bill, 2023.\nMore on the news\n\n« It will amend the Mines and Minerals (Development and Regulation) (MMDR) Act, 1957.\n\n* MMDR was comprehensively amended in 2015 to bring several reforms in the mineral sector, such as\nestablishing the District Mineral Foundation and National Mineral Exploration Trust.\n\n* The Act was further amended in 2016, 2020 and 2021 to bring further reforms in the sector, such as:\no Removing the distinction between captive and merchant mines,\no Removing the restrictions on the transfer of mineral concessions.\n\nKey Features of the Act\n\n|. Introduction of exploration lice:\n\nfor deep-seated and critical minerals\n\n« License: to undertake reconnaissance and prospecting operations for critical and deep-seated minerals.\n* Auction: The Exploration License (EL) will be granted through an auction for minerals specified in the\nSeventh Schedule of the MMDR Act.\no The Seventh Schedule contains 29 minerals, including lithium-bearing, copper-bearing, potash, and\nzinc-bearing minerals.\n* Validity of EL: Issued for five years.\no Request for an extension of up to two years can be applied to the state government.\n* Mining Lease: The blocks explored by the licensee would be auctioned for mining lease within the\nprescribed timeline, which will fetch better revenue to the State Governments.\no The exploration agency shall be entitled to a share in the auction premium payable by the mining lease\n\nholder. : ; e\nIl. Omission of 6 minerals from the list of 12 atomic minerals Omitted Minerals\n\n* Omission of Minerals: From the list of 12 atomic minerals minerals\nspecified in Part-B of the First Schedule to the MMDR Act,\nit proposes to omit six minerals (refer to infographic). @J Lithium bearingmineras\noc These minerals have various applications in the space\nindustry, electronics, communications etc. and are\n\nNiobiurn bearing minerals\n\ncritical in the net-zero emission commitment of @ Titanium bearing minerals and ore\nIndia.\n* Opening to Private Sector: The inclusion of minerals in the @ Tantallium bearing minerals )\n\nlist of atomic minerals reserves their mining and Zire bec i Jores )\nexploration to government entities, irconium bearing minerals and ores\n\no Upon removing these minerals from the said list,\nexploration and mining of these minerals will also be opened up for the private sector.\n\nIll. Empowering the Central Government to exclusively auction mineral concessions for critical minerals\n\n* Role of Central Government: The amendment empowers the Central Government to exclusively auction\nmining leases and composite licenses for certain critical minerals listed in new Part-D of the First\nSchedule to the MMDR Act.\nco. Part D of the First Schedule includes critical minerals such as tungsten, cadmium, minerals of the\n\n“rare earth” group, fertilizer minerals, and minerals being removed from the list of atomic minerals.\n\n* Role of State Government: Even though the Central Government would conduct the auction, the mining\nlease or composite license for these minerals to the successful bidders will only be granted by the State\n\nGovernment.\no The auction premium and other statutory payments shall continue to be received by the State\nGovernment.\n8.2. CRITICAL MINERALS\nWhy in the news? iA\n\nRecently, the Ministry of Mines Criticality of Minerals\n\nreleased the first-ever report of\n\nthe country on “Critical Pe fy ‘i 92)\n\nMinerals for India”. a VS —\n\nMore on the news Economic Supply —» Criticality of\n. Importance Risk Minerals\n\n¢ Ministry of Mines has gt JL\n\nconstituted a committee for\nthe identification of critical\n\nA\nand strategic minerals. br Economic Importance A Supply Risk\n\n« The list comprises 30\n. ‘ - & Governance Weighted\n2 Disruption Potential\ncritical minerals, including P' Mineral Construction\n\n17 Rare Earth Elements\n(REEs) and 6 Platinum- End of Life Recycling Rates\n\n2 Substitutability Index (E1)\n\n2\n\nGroup Elements (PGE), > GVA Multiplier Score (EOL-RR)\no REE include 15 ® Import Reliance (IR)\nLanthanides (atomic ® Cross-Cutting Index (Cc!) and Self-Sufficiency (Ss)\n\nnumbers 57 — which is\nLanthanum — to 71 in\nthe periodic table) plus\nScandium (atomic number 21) and Yttrium (39). REEs are classified as Light REE (LREE) and Heavy REE\n(HREE).\n\no Thecriticality of minerals is judged mainly by two parameters (refer to image).\n\n* The list will serve as a guiding framework for policy formulation, strategic planning, and investment\ndecisions in the mining sector.\n\nWhat are Critical Minerals?\n\n2\n\nSubstitutability Index (SE)\n\n* Critical minerals are elements that are the building blocks of essential modern-day technologies and are\nat risk of supply chain disruptions. For example, Antimony, Beryllium, Bismuth, Cobalt, Copper etc.\nco For India, major import sources include- Cobalt (China, US and Japan); Lithium (Chile, Russia and\nChina); Nickel (Sweden and China) etc.\n* These minerals are now used everywhere from making mobile phones, computers to batte:\nvehicles and green technologies like solar panels and wind turbines.\n« Based on their individual needs and strategic considerations, different countries create their own lists.\n\nInitiatives taken with respect to Critical Minerals\n\n*  India- Australia Critical Minerals Investment Partnership: It'll build new supply chains underpinned\nby critical minerals processed in Australia.\n\n« Minerals Security Partnership (MSP): India has joined MSP which is a US-led collaboration of 14\ncountries that aims to catalyse public and private investment in critical mineral supply chains\nglobally.\n\n* Supply Chain Resilience Initiative (SCRI): India, Japan, and Australia unveiled SCR! to enhance the\nresilience of supply chains in Indo-Pacific Region and reliance on China.\n\nectric\n\n\n8.3. OFFSHORE AREAS MINERAL (DEVELOPMENT AND REGULATION)\nAMENDMENT ACT, 2023\n\nWhy in the news?\n\nRecently, the Offshore Areas Mineral (Development and Regulation) Amendment Bill, 2023, received assent\nfrom the President.\n\nMore on the news\n\n* The Act has amended the Offshore Areas Mineral (Development and Regulation) Act 2002.\no It provides for the development and regulation of mineral resources in the territorial waters,\ncontinental shelf, exclusive economic zone (EEZ), and other maritime zones of India.\n« Offshore mineral resources are controlled and regulated by the Union.\no Offshore mining is the process of retrieving mineral deposits from the deep seabed at a depth of more\nthan 200 meters.\n\nKey Changes in the Act\n\nOffshore Areas Mineral (Development\nand Regulation) Act, 2002\n\nOffshore Areas Mineral (Development and\nRegulation) Amendment Act, 2023\n\nLicense Different licenses for reconnaissance, | Composite license for granting rights for\nexploration, and production. exploration as well as production.\nValidity Production lease is granted for a period | Production lease under a composite license will\nof up to 30 years, further renewed for up | be valid for 50 years.\nto 20 years.\nAuction Provides for the grant of concessions | Provides two types of operating rights to the\nProcess through administrative allocation. private sector by competitive bidding, viz.\nproduction lease, and composite license.\nMining in| Allows the government to reserve | Allows the administering authority to grant a\nreserved offshore areas that are not held under | composite license or production lease to the\nareas any operating right. government or a government company.\n\nNew Provisions in the 2023 Act\n\n* Mining of atomic minerals: Exploration, production, and composite licenses will be granted only to the\ngovernment or government companies.\n* Offshore Areas Mineral Trust: Will manage funds under the Public Account of India that will be non-\nlapsable in nature.\no Funds will be used for specified purposes including exploration in offshore areas, etc.\n\n8.4. NATIONAL GEOSCIENCE DATA REPOSITORY PORTAL (NGDRP)\n\nWhy in the news?\n\nRecently, the Union Minister of Mines launched the NGDRP.\n\nAbout NGDRP\n\n«  Ithas been created, as a part of the National Mineral Exploration Policy (NMEP), 2016.\n\n« It will make available all geological, geochemical, geophysical, and mineral exploration data in the\npublic domain on a digital geospatial platform.\n\n* The Geological Survey of India (GSI!) was given the responsibility to establish it.\n\nAbout NMEP, 2016\n\n*  Itaims at accelerating the exploration activity in the country through enhanced participation of the private\n\nsector.\n\n\n« Key features\no Auctioning of identified exploration blocks for exploration by the private sector on a revenue-sharing\nbasis.\no Creation of baseline geoscientific data as a public good.\n© Tomap the entire country with low altitude and close s;\nminerals such as gold, silver, copper, etc.\n\nGeological Survey of India\n\n* Genesis: It was established in 1851.\n\n* Ministry: Ministry of Mines.\n\n* Functions: Creation and updation of national geoscientific data, mineral resource assessment, and air-\nborne and marine surveys.\n\n* Regional Offices: Lucknow, Jaipur, Nagpur, Hyderabad, Shillong and Kolkata.\n\n8.5. SPECIAL ECONOMIC ZONES (SEZ)\n\nWhy in the news?\n\ne flight to precisely locate the deep-seated\n\nRecently, the Ministry of Commerce and Industry has notified Special Economic Zones (SEZ) (Fifth\nAmendment) Rules, 2023 in the exercise of powers conferred by section 55 of the SEZ Act, 2005.\n\nMore on the news\n\n* SEZs (Fifth Amendment) Rules, 2023 amend SEZ Rules 2006.\n\n* The Centre has amended the SEZ Rules to allow the demarcation of a portion of the built-up area in an\nInformation Technology (IT) or Information Technology Enabled Services (ITES) SEZ as a non-\nprocessing area, subject to conditions including repayment of tax concessions attributable to the area.\noc The processing area in an SEZ is for the manufacture of goods or rendering of services. The non-\n\nprocessing area is for supporting infrastructure.\no Demarcation of a non-processing area shall not be allowed if it results in decreasing the processing\narea to less than 50% of the total area or less than the area specified.\n\n« The businesses engaged in IT/ITES SEZ in a non-processing area shall not avail any rights or facilities\navailable to SEZ Units.\n\nAbout Special Economic Zones (SEZs)\n\n* SEZis a specifically delineated duty-free enclave, deemed to be foreign territory for trade operations,\nduties and tariffs.\n\neo\n\nObjectives of SEZ\n\nia & ae MA fa\n\nGeneration of Promotion of Promotion of Creation of Development of\nadditional exports of goods | investment from employment infrastructure\neconomic and services domestic and opportunities facilities\n\nactivity foreign sources\n\n« Any private/public/joint sector or State Government or its agencies can set up SEZ.\no SEZs have been established in several countries, including China, India, Jordan, Poland, Kazakhstan,\nPhilippines and Russia.\n* SEZ Act 2005 has been enacted followed by SEZ Rules which came into effect in 2006.\n« The area under 'SEZ' covers a broad range of zone types, including Export Processing Zones (EPZ), Free\nZones (FZ), Industrial Estates (IE), Free Trade Zones (FTZ), Free Ports, Urban Enterprise Zones and others.\n\n« Presently, 276 SEZs are operational in India.\no Total exports from SEZs stood at $155.8 billion in 2022-23. These included $61.6 billion of goods and\n\n$94.2 billion of service exports.\n\nIncentives offered to SEZs\n\n| (@|\n\n[|\n\na\n\nDuty-free Exemption from\n\nOther levies, if\n\nim ‘domestic | Central Sales Tax, | exempted by the\n\nprocurement of | Service Tax and\n\ngoods for the State sales tax.\n\ndevelopment, | These have now\n\noperation and subsumed into\n\nmaintenance of GST\nSEZ units\n\nrespective State\nGovernments.\n\nSupplies to SEZ\nare zero-rated\n\nunder the IGST\nAct, 2017.\n\n8.6. PRODUCTION-LINKED INCENTIVES (PLI) SCHEME\n\nWhy in the news?\n\nThe government has decided not to\nlaunch Production Linked\nincentives (PLI) scheme for new\nsectors and will assess the need for\ncourse correction for some sectors.\n\nAbout PLI scheme\n\nFirst introduced in 2020, PLlis a\n\nspecial incentive scheme for\n\nproducers to promote\nmanufacturing in multiple\nsectors.\n\no The incentives are linked to\nthe performance of the\norganisation Le., the\ngovernment provides\nincentives for incremental\nsales.\n\nPLI scheme is built on the\n\nfoundation of multiple sectors\n\nwith an incentive outlay of Rs.\n\n1.97 lakh crore to strengthen their\n\nproduction capabilities and help\n\ncreate global champions.\n\nBenefits of the PLI scheme\n\nStrengthen manufacturing\nsector: PLI can_ significantly\nrestructure India’s domestic\nmanufacturing, push its share in\nthe GDP to 25 per cent.\n\nACC /\nbattery\n\n‘Telecom and\n\nDrones j\n{ components’\n\nMedical |\n“one\n\n2) om\nSectors\n\nunder PLI\nScheme\n\nSpeciality\nsteel)\n\nSingle window\nclearance for\nCentral and\nState level\napprovals.\n\nAuto and auto\n7] components\n\nMobile and\nelectronic\n_ components\n\n“: , Pharma:\n“, Drugs\n\n\\Food :\nB/ products\n\nElectronics and\nIT hardware\n\nSolar hotovolataic\nmodi\n\nMajor objectives of PLI Scheme\n\n)\n\nTransform India\nintoa\nmanufacturing\nhub by creating\n\nglobal\n\ninvestments in\n\nmanufacturing\nand innovation\n\nAchieve\nself-reliance\nwith globally\ncompetitive\n\ndomestic\nmanufacturing\n\nIt can ensure Self-reliance and increase in exports.\n\nCapital expenditure: The implementation of the PLI scheme will lead to a potential capital expenditure\n(capex) of Rs 2.5-3 lakh crore over the scheme period.\n\nco {twill account for 13-15% of average annual investment spending in key industrial sectors.\n\nSpur green investment: Nearly 55% of the scheme is expected to be in green sectors such as electric\nvehicles, solar photovoltaics etc.\n\n8.6.1. PLI 2.0 FOR IT HARDWARE SCHEME\n\nWhy in the news?\n\nMinistry of Electronics and Information\nTechnology (MeitY) notified PLI 2.0 for IT\nHardware scheme for Enhancing India’s\nManufacturing Capabilities and\nEnhancing Export.\n\nMore about the news\n\n| Expected benefits of the Scheme ]\n\nIndia’s share in global electronics Total production of Will lead to generation\nmanufacturing has grown from 1.2% | about & 3.35 lakh crore, of 75,000 additional\nin 2014 to 3.75% in FY 2021-22. bring an additional direct jobs\n\nKey Features of the Scheme investment of & 2,430 .\n\ncrore in electronics\n\n0 Objective: Proposes a financial manufacturing.\n\nincentive to boost domestic\nmanufacturing and attract large investments in the value chain.\n\nTarget segment: Laptops, Tablets, All in-One PCs, Servers and Ultra Small Form Factor (USFF).\nTenure: Support shall be provided for a period of six year.\n\nBudgetary outlay: Rs 17,000 crore.\n\nIncentive Per Company: Shall be applicable on net incremental sales of manufactured goods over\nbase year (FY 2022-23) subject to different ceilings.\n\noo000\n\n8.7. SEMICONDUCTOR INDUSTRY IN INDIA\n\nWhy in the news?\n\nThe government has decided to invite new applications for setting up Semiconductor Fabs and Display Fabs\nin India under the Modified Semicon India Programme.\n\nAbout Modified Semicon India Programme\n\nThe Ministry of Electronics and Information Technology (MeitY) launched the programme in 2021.\n\nIt aims to provide attractive incentive support to companies/consortia that are engaged in Silicon\nSemiconductor Fabs, Display Fabs, Compound Semiconductors, Semiconductor Design etc.\n\n© Support under the scheme will be provided for 6 years.\n\nIndia Semiconductor Mission, within Digital India Corporation, MeitY is the designated nodal agency for\nimplementing the programme.\n\nIndia’s Semiconductor Market\n\nMarket Size: Reports project India’s semiconductor market to value about $64 billion by 2026, showing\nthree times growth from 2019.\n\nChip Manufacturing: India has become the hub for semiconductor design with nearly 2,000 chips being\ndesigned per year.\n\nR&D in the Industry: Research and development (R&D) in this industry, which includes electronic products\nand embedded systems, generated about US$2.5 billion in revenue.\n\n\nAd\n4 Schemes of Modified Semicon India Programme\n\nModified Scheme for setting up of Semiconductor Fabs in\nIndia\n\n@ Modified Scheme for setting up of Display Fabs in India\n\nModified Scheme for setting up of Compound\nSemiconductors/Silicon Photonics/Sensors Fab/Discrete\nSemiconductors Fab and Semiconductor ATMP/OSAT\nfacilities in India\n\nDesign Linked Incentive (DL!) Scheme\n\nObjective: Nurturing 100 domestic companies of\nsemiconductor design and achieving significant\nindegenization in semiconductor and electronic products.\n\nGlobal Semiconductor Scenario and India’s role\n\n* Major Producer: Presently, Taiwan is the world leader in manufacturing microchips with producing\nover 60% of the world's semiconductors and over 90% of the most advanced ones.\n\n* India’s Role: India has positioned itself as a player in the critical semiconductor technology field\nproviding an opportunity for companies to diversify their bases from China.\no 1n2022, India signed India-US Initiative on Critical and Emerging Technologies (iCET) deal.\no India launched its India Semiconductor Mission (ISM) in 2021 and Production Linked Incentive\n\n(PLI) scheme for the semiconductor industry.\n\n8.8. NATIONAL PHARMACY COMMISSION BILL 2023\n\nWhy in the news?\n\nThe Ministry of Health and Family Welfare (MoH&FW) released Draft National Pharmacy Commission Bill,\n2023 to replace the Pharmacy Act, 1948, and the existing Pharmacy Council of India (PCI) with National\nPharmacy Commission.\n\nObjectives of the Legislation\n\nPromote national health goals, improving access to quality and affordable pharmaceutical education.\nIncrease the availability of high-quality pharmacy professionals and promote equitable healthcare.\nEstablish an effective grievance redressal mechanism for relevant matters.\n\nTransparent assessment of pharmacy institutions and facilitating the maintenance of a pharmacy\nregister for India.\n\n\nPharmacy sector of Ind\nMajor segments of the Indian\n9 a Pharmaceutical Industry\n\n3\" largest in the} Accounts for ‘a $e\nworld in terms of| about 60% of a ay EON\nGeneric\n\nvolume global vaccine Vaccines Bulk\nproduction drugs drugs\n\n70% of WHO's vaccines i.e. :\ndiphtheria-pertussis- Ee) it gs\ntetanus (DPT), Bacille- Over-the- | Biosimilars | Contract\n\nCalmette-Guérin (BCG) counter and research &\n\nare sourced from India medicines | biologics | manufac-\nturing\n\nPharmacy Act, 1948\n\n* Constituted with the aim of Regulation of profession of Pharmacy in India.\n* Standardizing uniform training and education to individuals entering the profession.\n* The Central Government shall constitute a Central Council namely Pharmacy Council of India (PCI).\no The Act also specified for constitution and functions of ‘State Pharmacy Council’ for registration of\npharmacists.\n\nPharmacy Council of India (PCI)\n\nGenesis: Established as a statutory body under the provisions of the Pharmacy Act, 1948.\nMinistry: Ministry of Health and Family Welfare.\n\nObjectives: Regulation of the pharmacy education and profession and practice of pharmacy.\nFunctions:\n\noc Prescribe educational standards and their uniform implementation.\n\n© Inspection of pharmacy institutions, approve course of study and examination for pharmacists.\no Maintain central register of pharmacists.\n\nKey provisions of Draft National Pharmacy Commission Bill, 2023\n\n* Creation of a National Pharmacy Commission with functions including-\no Frame policies and regulate standards for governance of pharmacy education.\n© Collaborate with industry and other institutions for the use of cutting-edge technology\no Exercise appellate jurisdiction with respect to decisions of Boards\n\n* Three boards: Central Government shall constitute three boards (functioning under NPC) namely\nPharmacy Education Board, Pharmacy Assessment and Rating Board and Pharmacy Ethics and Registration\nBoard.\n\n8.9. NATIONAL DEVICES POLICY, 2023\n\nWhy in the news?\nCabinet approved National Medical Devices Policy, 2023.\n\n\nAim of the policy\n\n* Make India global leader in manufacturing and innovation of medical devices over next 25 years.\n\n* Help medical devices sector grow from present $11 Bn to $50 Bn by 2030.\n\n« Facilitate an orderly growth of medical device sector to meet public health objectives of access,\naffordability, quality, and innovation.\n\nAbout Medical devices sector\n\n« Indian industry is currently 4th largest Asian medical devices market after Japan, China and South\nKorea.\n\n* However, ithas significant presence of several multi-national companies with about 75-80% of the sales\ngenerated from imported Medical Devices.\n\nSalient features of Policy\nI Regulatory * By creation of a Single Window Clearance System for Licensing, enhancing\nStreamlining Role of Indian Standards like BIS and designing a coherent pricing\nregulation.\nEnabling * Establishment and strengthening of large medical device parks, clusters\nInfrastructure equipped with world class common infrastructure facilities in proximity to\n\neconomic zones.\n\nFacilitating R&D and * Establishing Centres of Excellence in academic and research institutions,\n\nInnovation innovation hubs, ‘plug and play’ infrastructures and support to start-ups.\nAttracting Investments | * Encouraging private investments, series of funding from Venture\nin the Sector Capitalists, and Public-Private Partnership (PPP).\n\nHuman Resources * Leveraging available resources in Ministry of Skill Development and\nDevelopment Entrepreneurship for skilling, reskilling and upskilling of professionals.\n\n* Develop partnerships with foreign academic/industry organizations.\n* Multidisciplinary courses for medical devices in existing institutions.\n\nBrand Positioning and Creation of a dedicated Export Promotion Council for the sector.\nAwareness Creation ¢ Learning from best global practices of manufacturing and skilling system.\n\nRelated news\n\nAssistance to Medical Device Clusters for Common Facilities Scheme\n\n* Scheme was launched with an aim to strengthen Medical Device clusters by providing financial\nassistance and to strengthen and establish more Testing Laboratories for Medical Devices.\n\n* Scheme is under Department of Pharmaceuticals, Ministry of Chemicals & Fertilizers.\n\n* Tenure of the Scheme: 2023-24 to 2026-27.\n\n* Scheme has two Components:\n\nComponents | Objective Incentives\n\nAssistance To strengthen medical| «+ Limit of support will be 70% of the approved project\n\nforCommon | device clusters’ capacity cost or Rs. 20 cr., whichever is less.\n\nFacilities for their sustained growth | « For Himalayan and North East Region States, grant-in-\nby creating Common aid would be Rs. 20 Crore per Cluster or 90% of the\nInfrastructure Facilities. project cost, whichever is less.\n\nAssistance | To strengthen availability | * Limit of support will be 70% of the approved Testing\n\nfor Testing of more Medical Device Facilities project cost or Rs. 5 cr., whichever is less.\n\nFacilities Testing Laboratories in| + For Himalayan and North East Region States, grant-in-\norder to boost aid would be Rs. 5 Crore per Cluster or 90% of the\nmanufacturing of quality project cost, whichever is less.\nmedical devices.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 9,
                "chapter_name": "9. INFRASTRUCTURE",
                "chapter_path": "./screenshots-images-2/chapter_9",
                "sections": [
                    {
                        "section_id": 9.1,
                        "section_name": "9. INFRASTRUCTURE",
                        "section_path": "./screenshots-images-2/chapter_9/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_9/section_1/4d91d348-38af-4dbb-ba55-eee2e54b52f9.png",
                            "./screenshots-images-2/chapter_9/section_1/4b9f33bf-8655-49ab-82a6-17275c6d0a54.png",
                            "./screenshots-images-2/chapter_9/section_1/bd918f56-426b-4c42-9360-a3efca7bdb39.png",
                            "./screenshots-images-2/chapter_9/section_1/04d72989-3132-4412-bd78-967d7e7e1065.png",
                            "./screenshots-images-2/chapter_9/section_1/43f3c5c7-946b-4bc9-a305-38e8e0fbd5a6.png",
                            "./screenshots-images-2/chapter_9/section_1/e13fa3fd-43b3-411f-b398-d069192136d2.png",
                            "./screenshots-images-2/chapter_9/section_1/6a6c6073-6dec-4068-9775-551f877feb90.png",
                            "./screenshots-images-2/chapter_9/section_1/9b6243d0-d26d-4723-ba06-8454db3c22a4.png",
                            "./screenshots-images-2/chapter_9/section_1/232211ef-3faf-47b6-ba1c-c825c71e2b06.png",
                            "./screenshots-images-2/chapter_9/section_1/c6731b94-d8ed-4618-bba3-94d7e045f3df.png",
                            "./screenshots-images-2/chapter_9/section_1/84af8b4f-9c17-482d-9716-9cb837d581b7.png",
                            "./screenshots-images-2/chapter_9/section_1/300c486d-3766-4d6c-99ae-c1b23b96861f.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "9.1. DIGITAL PUBLIC INFRASTRUCTURE (DPI)\n\nWhy in the news?\n\nIndia launched the Global Digital Public Infrastructure Repository and a Social Impact Fund, during the\nVirtual G20 Leaders’ Summit.\n\nMore on the ews\nGDPIR is one of the three DPI deliverables that were endorsed by the G20 New Dethi Leaders’\n\nDeclaration.\n\nOther two deliverables include a Framework for building DPI and mobilizing finances for DPI\ndevelopment in Low- and Middle-Income Countries (LMICs).\n\nGlobal Digital Public Infrastructure Repository (GDPIR)\n\nSocial Impact Fund (SIF)\n\n* Developed by: Ministry of Electronics & Information\nTechnology.\n\n* Aim: To bridge the knowledge gap in the choices and\nmethodologies required for the design, construction,\ndeployment, and governance of DPIs.\n\n* Constituents: GDPIR showcases the information ina\nstandardized format from countries and\norganizations that have developed DPls at scale,\nincorporating elements such as maturity scales,\nsource codes, and governance frameworks.\n\no Currently, the GDPIR features 54 DPIs from 16\ncountries.\n\nAim: Government-led, multi-stakeholder\ninitiative to fast-track DPI implementation\nin the global south.\n\no It’s a platform for stakeholders to\ncontribute to a fund and help\naccelerating SDGs achievement in\nLow- and Middle-Income Countries\n(LMICs) through DPIs.\n\nFunding: India has pledged an_ initial\n\ncommitment of 25 million USD to SIF.\n\n© It will provide financial support for\nupstream technical and non-technical\nassistance into countries developing\nDPI.\n\nWhat is Digital Public Infrastructure (DPI)?\n\nDPI is a set of shared digital systems which are secure and interoperable, built on open standards and\nspecifications to deliver and provide equitable access to public and/or private services at a societal scale.\n\nDigital public Infrastructure t\n\n“2\n\n(gs\n(Dig o * Reducing cost and increasing access\nDi igital * Digital railroads\n\n* Enables remote, paperless, presence-less service delivery\n\n* For public interest\n* Government orchestration\n\n* Public governance and accountability to people\n\ndevelopment of digital solutions\ni >\n\ni ——\nInfrastructure Public-sector led\n\n* Enabler for national scale innovation: acts as building blocks for large-scale\n\n* Ecosystem-led implementation: DPI can be private-sector led, public-private led, or\n\n* Ecosystem-level impact: can be leveraged in public and private domains\n\n\n* Key pillars of DPI:\no Open, interoperable, extensible, and scalable technology.\no Robust governance framework with transparent legal framework, data protection etc.\no Resilient local ecosystems eliminating economic, technical/social barriers, ensuring community\nparticipation.\n* Foundational elements: A strong DPI has three foundational systems—identity, payments, and data\nexchange.\no India’s DPI architecture, known as India Stack, consists of Aadhaar (identity), UPI and Aadhar enabled\nPayment System (payments), and Digilocker and Account Aggregator (data exchange).\n\n9.2. NATIONAL LOGISTICS POLICY (NLP)\n\nWhy in the news?\nIndia recently marked the first anniversary of the National Logistics Policy (NLP).\n\nLogistics Sector in India\n\n> Logistics’ means Transportation & handling of goods between points of\nproduction and consumption, storage, value addition and allied services.\n\n> The logistics infrastructure comprises ports, stations, Multimodal Logistics &\n\nParks (MMLPs), warehouses, connected by roads, railways, shipping,\ninland waterways, air routes, pipelines, etc.\n\nKey Aspects\n\n$2525 Billion 38th Rank\nValue of Indian Logistic Sector in ln World Bank's Logistic\n2022 Performance index 2023\n\nAbout National Logistics Policy (NLP)\n\n* Announced (in 2022) to promote seamless flow of goods across the country and improve Indian goods\ncompetitiveness in domestic and global markets.\n\n* Vision: To drive economic growth through an integrated, seamless, efficient, reliable, green, sustainable\nand cost-effective logistics network by leveraging best-in-class technology, processes and skilled\nmanpower.\n\n* Targets of NLP\no Reduce cost of logistics in India to global benchmarks by 2030.\noc Improve the Logistics Performance Index ranking - and be among top 25 countries by 2030.\n0° Create data driven decision support mechanism for a logistics ecosystem.\n\n* Implementation of the National Logistics Policy: Through a Comprehensive Logistics Action Plan\n(CLAP), which consists of interventions divided into specific action areas (see infographic).\n\n8 Action areas of CLAP\n@® Integrated Digital Logistics Systems _) (4)EXIM (Export-Import) Logistics)\n\nStandardization of physical assets & (@F)Service Improvement framework\n&) benchmarking service quality standards\n\n(#) Sectoral Plan for Efficient Logistics )\n@roaes Human Resources Development)\nand Capacity Building 6) Facilitation of Development of Logistics\n® State Engagement a\n\nProgress under NLP so far\n\n« Digitalisation: Over 614 industry players have registered on the Unified Logistics Interface Platform\n(ULIP).\no  ULIP is a data-based platform which integrates 34 logistics-related digital systems including GST\ndata, across departments.\n* State Engagement: 22 States have notified their logistics policies so far.\n* Issues and Grievance Redress: Around 29 business associations have been empanelled so far in the\nEase of Logistics Services (E-logs) Portal.\n\n9.2.1. LEADS REPORT 2023\n\nWhy in the news?\n\nRecently, the Ministry of Commerce and Industry unveiled the Logistics Ease Across Different States (LEADS)\nReport 2023.\n\nAbout LEADS\n\n* Launched by the Ministry of Commerce and Industry on the lines of the Logistics Performance Index (LPI)\nof the World Bank in 2018.\no India ranks 38th/139 countries in LP! 2023.\no LPI 2023 ranks countries on six dimensions of trade -- including Customs, Infrastructure, Ease of\narranging shipments, Quality of logistics services, Tracking and Tracing, and Timeliness.\n* LEADS ranks States and UTs on the efficiency of their logistics ecosystem.\n« Pillars for measuring logistics performance:\no Objective assessment\n¥ Support provided by State / UTs for policy & process improvement of Logistics eco-system.\nv Enablers of Logistics — stock of physical infrastructure.\no Perception Assessment\nY Logistics Infrastructure\nY Logistics Services\n¥ Operating and Regulatory Environment\n* Key Findings of 2023 Report\no Initiatives undertaken by States and UTs\n¥ 21 States and 2 UTs have notified their respective State Logistics policies.\n¥ 15 States and 1 UT have given Industry status to the logistics sector.\no The total length of roads and railway tracks grew by about 21% and 9% since 2014-15.\n\n\n9.3. PM GATI SHAKTI INITIATIVE\n\nWhy in the news?\n\nFindings of PM Gati Shakti Initiative highlight that in two years (since its inception in October 2021), it has\nfacilitated the Last Mile Connectivity and decreased logistics costs significantly.\n\nOther impacts of the GATI Shakti Initiatives\n\n« Expedited Implementation of Processes Across Projects. E.g. Reduction of the pre-alignment finalization\ntime for infrastructure projects from 3-4 months earlier to 1 month.\n« Increasing Information Availability through provisioning of data on upcoming connectivity projects,\nindustrial areas etc.\no E.g., Use of Digital Master Planning tool by BISAG-N (Bhaskaracharya National Institute for Space\nApplications and Geo-informatics) in a dynamic Geographic Information System (GIS) platform.\n* Development of Multi-modal Logistics through infrastructure schemes like Bharatmala, Sagarmala etc.\n\nAbout GATI Shakti\n\n« PM Gati Shakti National Master Plan (PMGS-NMP) is aimed to provide multimodal connectivity\ninfrastructure to various economic zones of India.\no Economic zone refers to a cluster where any economic activity in the form of manufacturing or value\naddition services or other services, is being carried out.\n* Objectives of the Plan:\no To incorporate Economic zones like textile clusters, pharmaceutical clusters, defence corridors,\nelectronic parks etc. in PMGS-NMP.\no Tosetup a unified portal that would bring 16 Ministries including Railways and Roadways together.\ne Primary Focus: Strategic planning, innovative financing methods, leveraging technology, and expediting\nimplementation processes.\n* Scope: It will encompass the seven engines (Roads, Railways, Airports, Ports, Mass Transport,\nWaterways and Logistics Infrastructure) of the National Infrastructure Pipeline (NIP).\n\n2\n\nSix Pillars of PM Gati Shakti Initiative\n\n“a\n\na\ncoy Comprehensive | Integrating all existing or planned initiatives of various Ministries\n\nEnabling prioritization of projects through cross-sectoral\n= Prioritization interactions\n\nrr\n\nAssist different ministries in planning for modification or\n\nOptimisation expansion after identification of critical gaps\n\nBy ensuring coordination of work between departments to\n\nSynchronisation ) reduce delays and clashes\n\ni Na NA\n\nProviding the entire data in one place with GIS based spatial\nplanning and analytical tool\n\nAnalytical\n\nif\n\nidentify the vital interventions for enhancing and updating the\nDynamic master plan of departments }\n\n\n9.4. DEDICATED FREIGHT CORRIDORS (DFCS)\n\nWhy in the News?\n\nThe Eastern Dedicated Freight\nCorridor (EDFC) has been\ncompleted fully in October 2023.\n\nWhat is a Dedicated Freight\nCorridor?\n\ne It is a= railway corridor\ndesigned for the rapid and\nefficient transportation of\ngoods and commodities,\ncharacterized by high speed\nand high capacity.\n\n* Aim: Decongesting India’s\nrailway network by separating\nfreight traffic from\npassenger traffic on the\nrailway network.\n\n* Implementing agency:\nDedicated Freight Corridor\nCorporation of India Limited\n(DFCCIL).\n\no It is a wholly owned\nenterprise of the\nMinistry of Railways set\nup in 2006 for the\nconstruction,\nmaintenance, and\noperation of DFCs.\n\n* Dedicated Coal Corridor: On\na line of DFC, Railway\nMinistry developing DCC\nexclusively for coal\n\nPo\nPROJECT MAP OF DFCCIL\nFunded by\nJapon\ninternational Sohnewal Nong Bork\nCooperation \"\nAgency JICA),\nBhaoupur\nSomogar\njomoh\nPalonpur oe Andal jn.\nSanendin) 7X Dankuni\nMakerpura\n< Kharogpur\nNew Ghotvad,\nVaitarna\n\nMumbai (JNPT)\nDadri-Sanand(N)\n\n‘Sonandi(N)-Makorpura\n\nMakarpura-New Gholved\n\nNew Gholvod-Voitoma\n\n\\Vaitarna - JNPT\n\nPROPOSED NEW CORRIDORS\nCorrider [From To\nEast Coast Carrier Kharagpur | Vijayawada\nEast-West Sub-Corrider-!_ | Paighar | Dankuni\n\n[East-West Sub-Corridor- lll Rajkharsawan) Andal\nNorth-South Sub-Corridor | Vijayowade tarsi\n\ntransportation from Odisha, Jharkhand, and Chhattisgarh to other parts of country.\n\n9.5. REGIONAL RAPID TRANSIT SYSTEM (RRTS) PROJECT\n\nWhy in the news?\n\nThe First Regional Rapid Transit System (RRTS) was launched with Namo Bharat RapidX train running from\nSahibabad to Duhai Depot in Uttar Pradesh.\n\nAbout RRTS Project\n\n*  Itis anew, dedicated, high-speed, high-capacity, comfortable commuter service connecting regional\n\nnodes in NCR.\n\n* These will operate at a speed of 160 km/hour but are designed to be able to run at speeds up to 180\n\nkm/hour.\n\n« Different from Metro and Indian Railways:\nco It caters to passengers looking to travel relatively longer distances with fewer stops and at higher\n\nspeeds.\n\nco It will provide reliable, high-frequency, point-to-point regional travel at high speed along a dedicated\npathway.\n« NCRTC implementing the RRTS in the National Capital Region (NCR).\n\nNational Capital Region Transport Corporation (NCRTC)\n* About: Incorporated in 2013 as a joint venture company of Govt of India and the States of Delhi,\nHaryana, Rajasthan and U.P.\no = Itis under the administrative control of the Ministry of Housing and Urban Affairs (MOHUA).\n* Purpose: Implementing the Regional Rapid Transit System (RRTS) project across the NCR of India.\n* Composition:\no Secretary (Urban Affairs Department) is the ex-officio Chairman of the Board of Directors.\no Managing Director, a nominee of the Ministry of Housing and Urban Affairs.\n© 1nominated Director each from the participating States.\n© 4nominee Directors from the Government of India.\n* Functions and Responsibilities:\no Designing, developing, implementing, financing, operating and maintaining RRTS.\no Ensuring balanced and sustainable urban development through better connectivity and access.\n\n9.5.1. KOCHI WATER METRO\n\nWhy in the news?\n\nRecently, India's first water-based metro, Kochi Water Metro (KWM), was formally inaugurated by Prime\nMinister.\n\nAbout Kochi Water Metro\n\n* The Kochi Water Metro is an innovative and sustainable mode of transportation that connects various\nparts of the city through its intricate network of waterways.\n* The boats use Lithium Titanate Oxide (LTO) batteries that can be charged in 15 minutes using a specially\nbuilt charging system.\no LTO batteries are not only the safest commercially accessible batteries in the world, but they are also\nthe longest-lasting, with a life cycle of 7-10 years.\n* Last year Kochi Water Metro won the prestigious Gussies Award (France) for the best commercial\npassenger electric boat in the world.\n\nOther such Inland Water Transport (IWT) services in India\n\n* Ro-Ro (roll-on, roll-off) ferry service for the movement of vehicles and passengers across waterways. The\nservices are available in various locations such as Mumbai, Goa, Kerala, and the Brahmaputra River in\nAssam.\n\n* Ro-Pax (Roll on-roll off cum passenger) ferry service between Mumbai and Mandwa (Maharashtra)\ndeveloped under Eastern Waterfront Development.\n\n« River Cruise Service: World’s longest river cruise ‘Ganga Vilas’ was recently flagged off to promote river\ncruise tourism in India. It will cover a distance of more than 3,200 kms across 27 river systems in 5 states in\nIndia and Bangladesh.\n\n9.6. NATIONAL COMMON MOBILITY CARD (NCMC)\n\nWhy in the News?\n\nState Bank of India (SBI) has recently launched the NCMC Rupay prepaid card.\n\nMore about the card\n\n* NCMC launched in 2019, is also known as One Nation, One Card for transport mobility.\n\no The customer may use a single card for payments across all segments including metro, bus,\nsuburban railways, toll, parking, smart city, and retail.\n\n\n* These are chip based, bank issued cards on Debit/Credit/Prepaid card product platform.\n\n¢ Unlike other Chip Po\nbased cards, National Common Mobility Card (NCMC) ~\nNCMC’s are dual\nInterface card @ Contactiess interface\nwhich supports\n\n* Money is stored separately in an offline\nboth contact wallet to i col payments.\nand contactless * There is a limit on Number of transaction\n\nper day and amount to be debited per\ntransactions.\n\ntransaction (may vary as per issuing bank)\n\n* It was developed NCMC * Top up of the wallet can be done only by\n\nby the Ministry of Kidesdadbinone\n\nHousing and\n\nUrban Affairs in\n\nNational required to authenticate the transactions\n\nPayments\n\nCorporation of India (NPCI), Centre for Development of Advanced Computing (C-DAC) and Bharat\n\nElectronics Limited (BEL).\n\n# Contact interface\n\nHow does it work?\n\n« The card utilises Indigenously Developed Payment Eco-system for transport which consists of\no NCMC Card (issued by Payment system provider like Rupay, VISA, Master card),\no SWEEKAR (Swachalit Kiraya: Automatic Fare Collection System) developed by C-DAC\no SWAGAT (Swachalit Gate) developed by BEL.\n* The NCMC chip card has an inbuilt radio frequency antenna which uses Near Field Communication (NFC)\ntechnology to establish a secure connection with SWEEKAR and SWAGAT to transmit payments.\no NFCis a short-range wireless connectivity technology that uses magnetic field induction to enable\ncommunication between devices when they are touched or brought within a few centimetres of each\nother.\n\n9.7. MARITIME AMRIT KAAL VISION 2047\n\nWhy in the news?\n\nIndia launched the Maritime Amrit Kaal Vision 2047 during the 3 Global Maritime India Summit 2023,\nMumbai.\n\nMore on the news\n\n«  Itis prepared by the Ministry of Ports, Shipping and Waterways for making India the global maritime leader\nby 2047.\n* The 1™ Maritime India summit was held in 2016 at Mumbai (with 2” being held in 2021).\n\nMaritime Amrit Kaal Vision 2047\nItis a comprehensive roadmap to transform India’s maritime sector through initiatives under the 11 themes.\n\n* Sustainable and Green Maritime Sector: Aims at making all 14 major ports carbon neutral, embracing\ngreen fuel and making India a hub for hydrogen production and distribution.\no AnInland Vessel Green Transition Program will be launched.\n© 3ports to set up the green hydrogen bunkers - Paradip Port (Odisha), Deendayal Port (Gujarat) and VO\n\nChidambaranar Port (Tamil Nadu).\n\n* Port Modernisation: Transforming ports into smart, automated ports of the future and placing Indian\nports among the world’s top 25 ports.\n\n* Global Player in Shipbuilding, Repair & Recycling: To attain a spot in the top 5 global shipbuilding centres.\n\n« Improving India’s tonnage: Quadruple port capacity to reach 10,000 million tons port capacity with 100%\nPPP (Public-Private Partnership) model at major ports.\n\n* Ocean, Coastal & River Cruise Sector: Develop 25 cruise terminals to Make India a leader in cruise\ntourism in the Asia Pacific region.\n\n« Enhanced Logistics: Enhance modal share of coastal shipping and inland waterways from 6% to 12%.\no GOl aims at increasing operational waterways more than twofold.\n\n* Other themes:\no Offer Maritime Professional Services in areas like maritime law, finance etc.\n\nWorld-class education, research & training.\n\nMaritime Cluster Development for Streamlining the supply chain.\n\nDedicated IMO cell in India for Global Maritime Presence.\n\nEfficiency Enhancement through a technology-driven innovation ecosystem.\n\noo000\n\n9.7.1. GREEN PORT GUIDELINES 2023\n\nWhy in the news?\nMinistry of Ports, Shipping & Waterways (MoPSW) launched ‘Harit Sagar’ the Green Port Guidelines 2023.\nObjectives of the guidelines\n\n« Harit Sagar Guidelines - 2023 envisages ecosystem dynamics in port development, operation and\nmaintenance while aligning with 'Working with Nature’ concept and minimizing impact on biotic\ncomponents of harbor ecosystem.\n\n« It lays emphasis on use of Clean/Green energy in Port operation, developing Port capabilities for\nstorage, handling and bunkering Greener Fuels viz. Green Hydrogen, Green Ammonia, Green Methanol /\nEthanoletc.\n\nHighlights of the guidelines\n\nPorts must meet at least 60% of electricity needs via renewables by 2030 and 90% by 2047.\nPorts must have at least one LNG bunkering station by 2030.\n\nSetting up electric vehicle charging stations in and around port areas by 2025.\n\nProvisions for adopting global Green Reporting Initiative (GRI) standard.\n\nAspects of the National Green Hydrogen Mission pertaining to ports.\n\nGreen Port Initiatives\n\nao\n\nProject Green Ports with National Centre of Pilot project in india Draft Green Ports Policy\ntwo verticals-Green Ports Excellence forGreen Port under the IMO Green\n\nInitiative and Swachh & Shipping (NCoEGPS) Voyage 2050 project\n\nBharat Abhiyaan\n\n9.8. RAILWAY SAFETY IN INDIA\n\nWhy in the news?\nThe recent train accident in the Balasore district of Odisha brought to the fore the issue of railway safety in India.\nIndian Railways\n\n* Indian Railways is the World’s 4\" largest railway network, after the US, China, and Russia, with the entire\ntrack covering a route length of more than 67,000 km.\n\n\nRailway Safety Ecosystem in India |\n\nOperational Level: Administrative level:\n\n* Fire Extinguishers * Commission of Railway Safety\n\n* Track Management System * Railway’s Depreciation Reserve Fund\n* Kavach ¢ Rashtriya Rail Sanraksha Kosh\n\n* HOTS-3X for track safety * Railway Protection Force (RPF)\n\n* Track Recording Car\n\n* Bridge Management System (BMS)\n\n* Electronic Interlocking and Ultrasonic Flaw Detection\n\nIssues in Railway Safety in India\n\n* Deterioration in the Operating Ratio limits spending capacity on upgradation and safety\no The operating ratio (i.e., the ratio of working expenses to traffic earnings) was 107.4% in 2021-22. This\nimplies Indian Railways spent Rs 107 to earn Rs 100 from traffic operations.\n* Derailments: According to CAG, 69% of railway accidents in FY18- FY21, were because of derailments.\n* Congestion of tracks: Capacity utilisation on about 10,000 km of the Railway’s trunk routes exceeds\n125%.\n\nCommission of Railway Safety (CRS)\n* Genesis: earlier, it was Railway Inspectorate. It was re-designated as the Commission of Railway\nSafety in 1961.\n* HQ: Lucknow, Uttar Pradesh\n© Ministry: Ministry of Civil Aviation\no  Therationale of keeping it under administrative control of Ministry of Civil Aviation is, to keep the CRS\ninsulated from the influence of railway establishment and prevent conflicts of interest.\n* Mandate:\no Deals with matters related to safety of rail travel and operations.\n© Has statutory functions - inspectorial, investigatory, and advisory - under Railways Act, 1989.\nco Investigates serious train accidents\n\nSteps Taken for Railway Safety\n\n« Rashtriya Rail Sanraksha Kosh (RRSK): It was a dedicated fund created in 2017-18 to clear the backlog\nof critical safety and related works of railways.\n« Faster deployment of Linke Hofmann Busch (LHB) coaches: LHB coaches are considered far safer than\nthe older Integral Coach Factory (ICF) coaches.\no Advantages of LHB coaches include higher carrying capacity, lower haulage cost, higher speed, low\ncorrosion, low maintenance, higher passenger comfort, better safety etc.\n« Bridge Management System (BMS): A web-based IT application developed to facilitate 24x7 availability of\ninformation.\n* Electronic Interlocking: Interlocking is a system meant to ensure that conflicting signals are not sent to\ntrains.\n« Introduction of Kavach system: It is one of the safety devices introduced to eliminate trains colliding with\neach other. (See box for details)\n\nAbout Kavach\n\n* Kavach is India’s automatic protection system in development since 2012, under the name Train\nCollision Avoidance System (TCAS), which got rechristened to Kavach or “armour”.\n\n« It is an indigenously developed by the Research Design and Standards Organisation (RDSO) in\ncollaboration with the Indian industry.\n\n* tis a state-of-the-art electronic system with Safety Integrity Level-4 (SIL-4) standards.\n\n* Key features:\n© Provides protection by preventing trains to pass the signal at Red (which marks danger).\n\n°\n\nActivates the train’s braking system automatically if the driver fails to control the train as per\nspeed restrictions.\n\nPrevents the collision between two locomotives equipped with functional Kavach systems.\nRelays SoS messages during emergency situations.\n\nHas centralised live monitoring of train movements through the Network Monitor System.\n\nIn Kavach, the probability of error is 1 in 10,000 years.\n\n9.9. BHARAT NEW CAR ASSESSMENT PROGRAM (BHARAT NCAP)\n\nWhy in the news?\n\nooo°o\n\ng\n\nThe Ministry of Road Transport and Comparison with Global Standards\n\nHighways (MoRTH) has rolled out an ( Criteria (New } f Global\nindigenous _ star-rating system for NCAP NCAP\nvehicles to assess their safety in cases of 7)\ncollision.\n\nEuro\nNCAP\n\nLC\nlam’\nLy\n\nFrontal Impact test\n\nMore on the news Side impact test\n\nld\nuly\n\ne It will enable Indian auto\nmanufacturers to get their vehicles (@) Pole side impact test\ntested and evaluated on a five-star\nrating scale as per Automotive\nIndustry Standard (AIS) 197.\n\no AIS 197 contains the overall\nassessment method, vehicle\nselection procedure, various\n\n4s\n\n0}\n\nill\n\nERNE\n\ntests and their assessment cop\nprotocols.\n* It is modelled on the Global New @ ) aaa oat\ntechnologies\nCar Assessment Programme\n(Global NCAP) that promotes the Pedestrian Occupant\nuniversal adoption of the United safety\n\nNation’s motor vehicle safety\nstandards worldwide. @} eee reetection\no Global NCAP is a major project\n\nof the Towards Zero Foundation,\nwhich is a UK-registered charity.\n\nFNAME\nSCS iche\n\nFeatures of the Bharat NCAP\n\n* Applicability: To passenger vehicles with not more than eight seats in addition to the driver’s seat (8+1)\nwith gross vehicle weight not exceeding 3,500 kg, which are either manufactured or sold in India.\no Combustion engine vehicles, as well as CNG and Electric vehicles, can be tested under the program.\n« Testing protocol: It will evaluate Adult Occupant Protection (AOP), Child Occupant Protection (COP) and\nfitment of Safety Assist Technologies.\no For this, three tests will be conducted: a frontal impact test, a side impact test, and a side pole impact\ntest.\nco Based on the assessment, two separate star ratings will be awarded for AOP and COP.\no The pole impact test will only be conducted for cars securing 3 stars and above.\n« Format of testing: Testing will be voluntary, and carmakers will be encouraged to offer their models for\ntesting as per the AIS 197.\no Bharat NCAP team will pick a base variant of the model offered through random sampling.\no The Automotive Research Association of India (ARAI) is mandated with testing the vehicles under the\nscheme at its laboratories in Pune and Chakan.\n\nRelated news ri\nNational Highways Authority of India (NHA!) ie Blackspots\nhas issued guidelines for rectification of\naccident-prone spots on the National\n\n= Blackspots: A Road Accident Black spot is a 500m\nstretch on a National Highway where\n\nHighways. + ei . sah\n\neither 5 road accidents with fatalities/grievous\nKey highlights of the guidelines injuries occurred in the past 3 years or\n* NHAI Project Directors can undertake + there were 10 fatalities in total in past 3 years\n\nrectification of accident-prone spots\nto the tune of up to Rs. 10 lakh per spot.\n© Such accident-prone spots are identified and recommended by the respective State Police Chief or\nby the District Road Safety Committee.\n\n* Short-term measures costing more than Rs.10 lakhs and up to Rs. 25 lakhs have been delegated to\nthe concerned Regional Office.\n\n* Short Term Measures include installation of pedestrian facilities like zebra crossings with advance\nwarning signs, Crash barriers & railings, solar lights/ blinkers, etc.\n\nDakar Declaration\n\n*  Ithas been adopted in principle by 21 African countries after the first African sub-regional conference\non implementing Global Plan for Road Safety.\n\n*  Itis a guiding document to support the implementation of Decade of Action for road safety 2021-2030.\n\n* _ It sets the ambitious target of preventing at least 50% of road traffic deaths and injuries by 2030.\n\n9.10. FUNCTIONING OF MAJOR PORTS IN INDIA\n\nWhy in the news?\n\nx)\n\nMajor Ports in India\nRecently, the Department- © Kandia Port (Deendayal Port)\n\nrelated Parliamentary , eapee\nStanding Committee on\nTransport, Tourism and\nCulture presented the :\n352nd Report on © 1. Mumbai Port Trust\n‘Functioning of Major Ports 2\n\nin the Country’. Visakhapatnam Bay of Bengal\n\nPorts in India Mormugoo\n\n* Ports in India are Arabian\nbroadly categorized into Sea } Ennore (Kamerajer Port)\ntwo types based on @ New Mangalore ‘Chena\ntraffic they handle.\no Major Ports: They\nare under the direct Cochin 6\nadministrative\ncontrol of the Tot senor Port Text\nCentral bev\nGovernment and fall\nin the Union List in\nthe 7th Schedule of the Constitution.\no Minor Ports: They fall under the jurisdiction of the respective State Maritime Board and fall in the\nConcurrent List.\n« There are 12 Government owned major ports (with 6 on the East Coast and 6 on the West Coast).\n* The Major Port Authorities Act, 2021 and the Indian Ports Act are the two principal statutes governing the\nfunctioning of Major Ports.\n\nParadip\n\n\nPerformance of Ports in India\n\n_--Do you know 2) ————e ~\n\n* Turn Around Time (TRT): Time spent byavesselattheport ,\nfrom its arrival to its departure across Indian ports has\nbeen consistently declining from 94 hours (FY13-14) to\n52 hours (FY23-24).\n\n> The Oldest major port of India is the\nKolkata Port, now called the Shyama\nPrasad Mookherjee Port (Only major\n\n\\\n' 1\n‘\n' '\n. . . ¥ Riverine port) i\n¢ = Traffic: Indian ports have witnessed a consistent rise in ; . i\ncontainer traffic from 555 million tonnes (FY13-14)to796 |” Marabea port i Ince es longest Natural '\nmillion tonnes (FY23-24). an ee ve, port. the Enon Port tml '\n\n. , iy! marajar Port or the Ennore Port in Tamil\n. Cargo: Cargo handling of the Major Ports has steadily | Nadu is the only con hel pare 4\nincreased over the years. ; ‘. registered as a company. Fa\n\n* Operating Ratio: The operating ratio, the rupee spent for ett Tastee nese ete Pee =\n\nevery rupee earned, has come down to Rs. 48 from Rs. 53 in 2020-21 (i.e., Rs. 48 is spent for every Rs. 100\nearned).\n\nEfforts that have been taken to improve the functioning of Ports\n\n* Overall Monitoring: The Sagarmanthan Dashboard was developed for regular monitoring of projects and\nthe financial and operational performance of the ports.\n\n« Real-Time Tracking: The Sagar Setu App has been launched to give real-time information on vessels for\nbetter traffic management.\n\n* Trade Facilitation: The National Logistics Portal (NLP) (Marine) is a national maritime single window\nplatform facilitating trade between importers, exporters, and service providers.\n\n* Monitoring of Port Performance Indicators: Sagar Unnati has been implemented as a Dashboard for\nmonitoring all Major Ports Key performance indicators like Turnaround Time.\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 10,
                "chapter_name": "10. SERVICES",
                "chapter_path": "./screenshots-images-2/chapter_10",
                "sections": [
                    {
                        "section_id": 10.1,
                        "section_name": "10. SERVICES",
                        "section_path": "./screenshots-images-2/chapter_10/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_10/section_1/5c21509c-0e4f-4edb-89f0-3c582ac09e6d.png",
                            "./screenshots-images-2/chapter_10/section_1/23b6ad80-d7cf-499d-b308-c4fa868c269a.png",
                            "./screenshots-images-2/chapter_10/section_1/26af6c07-b7dc-447c-b747-81c17b974aac.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "10.1. INSURANCE SECTOR\n\nWhy in the news?\n\nInsurance Regulatory and Development Authority of India (IRDAI) is working to introduce a plan termed “Bima\nTrinity”.\n\nMore on the news\n\nBima Trinity will include following three components -\n\nBimaSugam | Platform to integrate insurers and distributors on to one platform.\n\n* Acts as one-stop shop for customers, who ata later stage can pursue service requests\nand settlement of claims through the same portal.\n\nBima Vistar * Abundled risk cover for life, health, property and casualties or accidents,\n\nWill have defined benefits for each risk that can be paid out faster than usual without\nthe need for surveyors.\n\nBima Vahaks | * Women-centric workforce in each Gram Sabha that will meet the women heads of\n(carriers) each household to convince them about benefits of composite insurance product.\n\nCurrent Status of the Insurance Sector in India\n\nTotal Premium: In terms of total premium volumes, itis the 10th largest market globally, with an estimated\nmarket share of 1.9%.\nInsurance Density: In India, it has increased from $ 11.1 in 2001 to $91 in 2021.\n\n© Insurance density refers to the ratio of total insurance premiums to whole population of a given\n\ncountry in a given year.\nInsurance Penetration: In India, it has been steadily increasing (from 2.7% in 2000 to 4.2% in 2021).\nco Insurance penetration refers to the ratio of total insurance premiums to gross domestic product in\na given year.\noc Insurance penetration in the life insurance sector was 3.2% in 2021 -twice more than emerging markets\nand slightly above the global average.\n\nRelated news\nNational Insurance Academy (NIA) released a report exploring the Indian insurance landscape.\nKey highlights of the report\n\nIndia is grappling with a Health Protection Gap of 73%, leaving over 40 crore individuals without health\n\ninsurance (accounting for over 31% of the country’s population).\n\no HPG is defined as the difference between the level of healthcare costs which would be required to\nmeet consumer needs, versus the amount that would be available to cover those costs.\n\nProtection Gap: The report found an 87% Life Insurance Protection Gap and a Mortality Protection\n\nGap exceeding 90% in 26-35 age group across the country.\n\no MPG is the difference between the cover typically required by a family and the resources they have\navailable should a wage-earner pass away suddenly.\n\nNatural catastrophe insurance: Almost 95% of the country's population does not have natural\n\ncatastrophe insurance.\n\nCrop insurance: Insured area and sum insured for crop insurance in India have decreased,\n\naccompanied by a decline in the number of insured farmers.\n\n\n/10.1.1. INSURANCE REGULATORY AND DEVELOPMENT AUTHORITY OF INDIA\n| GRDAI)\n\nWhy in the news?\n\nIRDAI has relaxed norms for 'surety bonds’ to expand the surety insurance market by increasing the\navailability of such products.\n\nAbout Insurance Surety bonds\n\n«  Itis a three-party contract by which one party (the surety) guarantees the performance or obligations of a\nsecond party (the principal) to a third party (the obligee).\n\n« It act as a security arrangement for infrastructure projects and insulate the contractor as well as the\nprincipal.\n\n« Insurance Surety Bonds (ISB), allowed by Insurance Regulatory and Development Authority in April\n2022, has been brought as a replacement of bank guarantees.\n\nInsurance Regulatory and Development Authority of India (IRDAI)\n« Genesis: Formed as a statutory body under an Act of Parliament, i.\ne HQ: Hyderabad, Telengana\n« Ministry: Ministry Of Finance, Department of Financial Services.\n* Mandate\n© Togrant licenses to (re) Insurance companies and Insurance intermediaries.\n© To protect interests of policyholders.\n© Toregulate investment of funds by Insurance companies, professional organisations connected with\nthe (re) Insurance business\no Toundertake inspection of, conduct enquiries and investigations of the entities connected with the\nInsurance business;\n« Entities regulated by IRDAI:\no Life Insurance Companies - Both public and private sector Companies\nGeneral Insurance Companies - Both public and private sector Companies.\nRe-Insurance Companies\nAgency Channel\nIntermediaries like Corporate Agents, Brokers etc.\n\n10.2. MEDICAL AND WELLNESS TOURISM\n\nWhy in the news?\n\neo0o°0\n\nThe Ministry of Home Affairs recently notified the creation of a new category of AYUSH visa for foreign\n\nnationals for treatment under AYUSH systems of medicine.\n\nMore about News a Ad\na\n\n« Anew chapter, i.e. Ayush Visa, has been g Data Bank 1\n\nincorporated under the Medical Visa of . h\nthe Visa Manual 2019, which deals with > 7\" ranked with 56 million trips in wellness\n\ntreatment under the Indian systems of tourism (As per Global Wellness Tourism)\nmedicine. .\n\n* This will boost Medical Value Travel in r $70 billion estimated to grow of\nIndia and strengthen our endeavour to Ayush-based healthcare & Wellness by 2025.\nmake Indian traditional medicine a\nglobal phenomenon.\n\n« AYUSH is an acronym for Ayurveda, Yoga and Naturopathy, Unani, Siddha and Homeopathy; however, it\nalso includes other traditional and non-conventional health care systems such as Sowa Rigpa, etc.\n\nAbout Medical and Wellness Tourism\n\nMedical tourism is a term used to describe the rapidly growing practice of travelling across international\nbor\nWellness Tourism is a travel associated with maintaining or enhancing one’s well-being.\n\nThe Ministry of Tourism has formulated a National Strategy and Roadmap for Medical and Wellness\nTourism.\n\no Aims to provide an institutional framework, strengthening the ecosystem for medical and wellness\n\n'$ to seek healthcare services.\n\ntourism, developing a brand and ensuring quality assurance.\n\no Strategy key pillars include:\n\nv Enabling digitalisation by setting up an Online Medical Value Travel (MVT) Portal.\nv Enhancement of accessibility for MVT, etc.\n\no Constituted National Medical and Wellness Tourism Promotion Board for Institutional framework.\n\nRelated News\nFirst WHO Traditional Medicine Global Summit\n\nRecently, the World Health Organization (WHO) and Ministry of AYUSH organized the First WHO\nTraditional Medicine Global Summit “Towards health and well-being for all” in Gandhinagar, Gujarat.\nSummit aimed to harness the potential of the evidence-based traditional, complementary, and\nintegrative medicine (TCIM).\n\nWHO released the outcome document of first WHO Traditional Medicine Global Summit 2023 in form\nof “Gujarat Declaration”.\n\n10.3. OPEN NETWORK FOR DIGITAL COMMERCE (ONDC)\n\nWhy in the news?\nNetwork Operations and Compliance System (NOCS) platform was launched for ONDCs.\n\nMore on the news\n\nNPCI Bharat BillPay Ltd (NBBL) has launched NOCS platform will provide reconciliation and settlement\nservices for transactions undertaken on ONDC network.\no NOCS, developed under guidance of RBI, will enable smooth, secure, and timely transfer of funds\n\nto network participants.\n\nco Itis integrated with banks, fintechs and e-commerce players and will soon go live.\n\nAbout ONDC\nCo\na, |\nSf WHAT Is ONDC? fir WHAT IS ONDC NOT?\n® Market and Community-led initiative ® A Government Regulatory Body\n® An open network ® An application or a platform.\n® Eliminates the need for a central ® Acentral intermediary\nintermediary ®» Amedium to help digitize businesses\n\n® An enabler for massive digital\n\ncommerce expansion\n\n® An enabler for broad-based innovation\n\nONDC was launched by Department for Promotion of Industry and Internal Trade (DPIIT), Ministry of\nCommerce and Industry to control digital monopolies.\nco It promotes open networks for all aspects of exchange of goods and services over digital or\n\nelectronic networks.\n\no Task to integrate e-commerce platforms on ONDC has been assigned to Quality Council of India.\no ONDC does not require the use of same platform/application by buyer and seller to do a business\n\ntransaction.\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 11,
                "chapter_name": "11. ENERGY",
                "chapter_path": "./screenshots-images-2/chapter_11",
                "sections": [
                    {
                        "section_id": 11.1,
                        "section_name": "11. ENERGY",
                        "section_path": "./screenshots-images-2/chapter_11/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_11/section_1/e3d780ea-1eb1-41c1-821c-1e31f2196cdc.png",
                            "./screenshots-images-2/chapter_11/section_1/dee7f8c0-db34-442c-b23b-e87353c53941.png",
                            "./screenshots-images-2/chapter_11/section_1/8ad5e4f9-258a-449f-9d52-c0d43ebb6ea2.png",
                            "./screenshots-images-2/chapter_11/section_1/a05edfeb-55bc-4d74-b1f1-f391ea59c2df.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "11.1. NATIONAL ELECTRICITY PLAN (NEP)\n\nWhy in the news?\n\nRecently, the Central Electricity Authority has notified the National Electricity Plan for 2022-32.\nMore about the news\n\n« As per the Electricity Act 2003, CEA is required to prepare an NEP in accordance with the National\nElectricity Policy and notify such Plan once in five years.\n\n« NEP includes the review of the last five years (2017-22), a detailed plan for the next five years (2022-27)\nand a prospective plan for 2027-32. (The first NEP was notified in 2007.)\n\nKey highlights of NEP\n\n« Rising energy demand: India has witnessed electricity demand incre:\nthe last decade.\n\n« Installed capacity: Likely installed capacity for the year 2026-27 will be around 610 GW with around 57.4%\nnon-fossil-based capacity (from around 40% as of March 2022).\n\n* Carbon emission: Average CO2 emission rate from coal-based stations has been on a declining trend.\n\n* Contribution of Renewable Energy (RE) sources: Installed capacity of RE sources is expected to contribute\naround 35% to the total energy mix by 2026-27.\n\n« Energy efficiency and conservation: India has achieved a reduction in the emission intensity of GDP by\n24% over the period 2005-2016 and is now committed to reducing emission intensity by 45 % in 2030\nagainst the levels of the year 2005.\n\no Emissions intensity is the level of GHG emissions per unit of economic activity, usually measured at the\nnational level as GDP.\n\nat CAGR of around 4.1 % during\n\nALL INDIA INSTALLED CAPACITY AS ON 31.03.2022 ALL INDIA RE INSTALLED CAPACITY (MW)\n(ALL VALUES ARE IN MW) ASON31.03.2022\nB torgerydro, —\\ I” easensa len\nI RES, 156607.90 (39%) ton) — / (ax)\n\nCoal, 2040\n(1%) g¢——\nSmall Hydro,\n\n4939.39 Mw\n\n[\n\nJ {Vt (x) |\n| | 1B Wind, 40357.58 Mw\nI Biomass, (26%)\n\n10682.36 Mw (7%)\n\n=\nLignite, 6620.00 (2%)\n\nNuclear, 6780 (2%) eas, 24899,51 (6%)\n\nMbiesel, 509.71, 0% TOTAL: 156607.90 MW\n\nCentral Electricity Authority (CEA)\ne About: Statutory Organization under Electricity Act, 2003. It works under the Ministry of Power.\n* Genesis: Originally constituted under section 3(1) of repealed Electricity (supply) Act, 1948.\no In 1951 established as part time body and made full time body in 1975.\no Superseded by section 70 of Electricity Act, 2003.\n* Objective: To regulate and oversee the development of the electricity sector in the country.\no Toensure reliable 24*7 power supply of adequate quality to all consumers in the country.\nComposition: Not more than 14 members (including its chairperson).\no Notmore than the 8 full time members to be appointed by the central\n\n\n* Function & Responsibilities:\no Advice the central government on National Electricity Policy.\nSpecify the technical standards for electrical plants and lines.\nSpecify the conditions for installation of meters.\nPromote measures for advancing the skill of persons engaged in the electricity industry.\nPromote and assist in the timely completion of schemes and projects.\n\n|11.1.1. INTER-STATE TRANSMISSION SYSTEM (ISTS) CHARGES\n\neooo°o\n\nWhy in the news?\n\nMinistry of Power waives Inter-State Transmission System (ISTS) charges on offshore wind, green hydrogen,\nammonia projects for 25 years.\n\nMore on the news\n\n« Earlier, government had ordered waiver of ISTS charges on transmission of electricity generated from\nnew hydro-power projects.\n\n« OWP is the use of wind farms constructed in bodies of water, usually in ocean on continental shelf, to\nharvest wind energy to generate electricity.\n\n* Green Hydrogen is hydrogen produced from water using RE sources.\n\n« Green ammonia is a derivative of green hydrogen and is used as energy in transport and storage\nvectors, shipping fuel, and as a fertilizer.\n\nKey decisions\n\n* Complete waiver of ISTS charges has been given for Off-shore Wind Power (OWP) projects commissioned\non or before 31 Dec 2032 (for 25 years from date of commissioning).\no However, projects commissioned from 1st January 2033 would be given graded ISTS charges.\n« Complete waiver for Green Hydrogen/Green Ammonia production units, using Renewable Energy (RE),\nPumped or Battery Storage System or any hybrid combination.\no Projects commissioned on or before 31st Dec 2030 will be eligible for this waiver. Projects after\nDecember 31, 2030, will attract graded transmission charges thereafter.\n\n11.1.2. OTHER INITIATIVES IN THE POWER SECTOR\n\nN THE POWER SECTOR\n\n« The Ministry of\nFinance has allowed\n\nstates additional\nborrowing ranging Mandatory reforms for\nfrom 0.25% to 0.5% of fulfilling the bility\n\nthe Gross State by the states\n\nDomestic Product\n\n(GSDP) annually in lieu [ | | . l -\nof reforms in the power | Progressive assumption| | Transparency in | Timely rendition of | | Compliance with\nsector (refer to the of responsibility for the reporting of financial and legal and\ninfographics). losses of public sector | | financial offairs of energy accounts regulatory\n\ne The initiative was DISCOMs by the State power sector and timely audit. requirements.\n\n: +\nannounced in Union oem\n\nBudget 2021-22 for a °\nfour-year period from (() 2;\n2021-22 to 2024-25.\n\n\n1.1.2.2. MARKET COUPLING\n\n«The Union Ministry of Power has directed the Central Electricity Regulatory Commission (CERC) to initiate\nthe process of “market coupling” of power exchanges, in order to have uniform prices across multiple\nexchanges.\n\n* Market coupling refers to the forming of a single power trading entity owned by the government.\n\no Under it, buy and sell bids from all power exchanges in the country will be aggregated and matched\nto discover a uniform power price or market clearing price (MCP).\n\no At present, MCPs are different in three power exchanges that India has - Indian Energy Exchange\nLimited (IEX), Power Exchange India Limited (PXIL) and Hindustan Power Exchange Limited (HPX).\n\no 1&X currently enjoys a monopoly status with almost 90% share in the electricity market.\n\n* Market coupling will pave the way for\n\no “One Nation, One Grid, One Frequency, One Price” framework by implementing the Market-Based\nEconomic Dispatch (MBED) mechanism.\n¥ MBED mechanism envisages centralised scheduling for dispatching the entire yearly\n\nconsumption of electricity, both at the inter-state and intra-state levels.\n\n1.1.2.3. ELECTRICITY (RIGHTS OF CONSUMERS) AMENDMENT RULES, 2023\n\n« Central Government amended Electricity (Rights of Consumers) Rules, 2020 which were notified by the\ngovernment to provide reliable services and quality electricity to consumers.\n\n* Rules seek to ensure that-\no Newelectricity connections, refunds and other services are given in a time-bound manner.\no Willful disregard for consumer rights results in levying of penalties on service providers and\n\npayment of compensation to consumers.\n\n* Ministry of Power has now introduced Electricity (Rights of Consumers) Amendment Rules, 2023 to bring\n\nfollowing changes:\n\nChanges | About\n\nIntroduction of « Rather than being charged for electricity at same rate at all times of the day,\n\nTime of Day (ToD) price for electricity will vary according to the time of day.\n\nTariff o Power Tariff to be 20% less during Solar Hours (duration of eight hours in a\nday as specified by State Electricity Regulatory Commission), 10%-20%\nHigher during Peak Hours.\n\n«  Itwillenable consumers to reduce electricity bills and will help power system to\nuse resources more efficiently.\n\nAmendment made | « Post installation of a smart meter, no penal charges will be imposed on a\nin smart metering consumer based on maximum demand recorded by the smart meter for the\nprovision period before installation date.\n\n* PUShP portal was launched by Ministry of Power to ensure greater availability of power during peak\ndemand season.\no Power Distribution Companies (DISCOMS) will be able to indicate their surplus power in block\ntimes / days / months on portal.\no Those DISCOMs who need power will be able to requisition the surplus power.\nco. This will reduce the fixed cost burden on DISCOMs and enable the available generation capacity to\nbe utilise.\n\n11.2. NATIONAL GAS GRID\n\nWhy in the news?\n\nThe Bihar portion of the Barauni - Guwahati pipeline which connects Bihar to the National Gas Grid has been\ncompleted.\n\nAbout Natural Gas\n\n« Natural gas is a mixture of gases which are rich in hydrocarbons consisting of methane, nitrogen, carbon\ndioxide etc.\n\n« Natural gas reserves are deep inside the earth near other solid & liquid hydrocarbon beds like coal and\ncrude oil.\n\n*  Itis not used in its pure form; it is processed and converted into cleaner fuel for consumption.\n\n« India has targeted to increase the share of natural gas in primary energy mix in India from current 6.5% to\n15% by 2030.\n\n« The subjects of Petroleum & Natural Gas fall under the Union list.\n\nNational Gas Grid\n\n«  Itis a 33,764 Km long, Natural Gas pipeline network that aims to connect all major supply and demand\ncentres in the country.\n«  Itis under the purview of the Petroleum and Natural Gas Regulatory Board (PNGRB).\n\nAbout Petroleum and Natural Gas Regulatory Board (PNGRB)\n\n*  Itwas established under The Petroleum and Natural Gas Regulatory Board Act, 2006.\n\n*  Itaims to protect the interests of consumers and entities engaged in specified activities relating to\npetroleum, petroleum products and natural gas and to promote competitive markets.\n\n*  Italso oversees a Gas Exchange for the trading of Natural Gas in India.\n\n*  Itis the authority to grant authorization to the entities for the development of City Gas Distribution\n(CGD) network in Geographical Areas (GAs).\n\n* tis under Ministry of Petroleum & Natural Gas.\n\n",
                        "extracted-code": ""
                    }
                ]
            },
            {
                "chapter_id": 12,
                "chapter_name": "12. BUSINESS, INNOVATION AND\nENTREPRENEURSHIP",
                "chapter_path": "./screenshots-images-2/chapter_12",
                "sections": [
                    {
                        "section_id": 12.1,
                        "section_name": "12. BUSINESS, INNOVATION AND\nENTREPRENEURSHIP",
                        "section_path": "./screenshots-images-2/chapter_12/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_12/section_1/d33ec484-9995-477b-9929-96a331fc1de2.png",
                            "./screenshots-images-2/chapter_12/section_1/7046b325-a359-417d-a0b4-35e0fd5beb73.png",
                            "./screenshots-images-2/chapter_12/section_1/2a1100ee-1028-4eba-9006-73062bb8de24.png",
                            "./screenshots-images-2/chapter_12/section_1/44463350-60d3-4902-a38e-3d7781413773.png",
                            "./screenshots-images-2/chapter_12/section_1/cecdffd8-2569-4c89-bb6f-15e51d767c15.png",
                            "./screenshots-images-2/chapter_12/section_1/e87141b0-4d2f-44a1-8fd5-dcde7ef07cc7.png",
                            "./screenshots-images-2/chapter_12/section_1/4625c6a8-df6f-48b3-a171-ace5ace1a6bf.png",
                            "./screenshots-images-2/chapter_12/section_1/d5e20e4a-ac15-4bbb-bcbd-16083fdd2ae0.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "12.1. CORPORATE SOCIAL RESPONSIBILITY (CSR)\n\nWhy in the news? o\n\nRecently, Ministry of Corporate Affairs (MCA) in its monthly CSRis applicable to\nnewsletter had highlighted various insights about CSR. Companies with\n\n* Government provides the broad framework of CSR more\nthrough:\no Section 135 of the Companies Act, 2013 enumerates (GA) Net worth of. 500 core)\nthe provisions regarding CSR. or more\no Schedule VII of the Companies Act, 2013 indicates the Turnover of Rs. 1000 crore or\nactivities to be undertaken by the company under CSR. Ge Rarover of 1000 corer)\n* Companies need to spend a minimum 2% of its average\n\nnet profit for its preceding three financial years’ amount on\nCSR activities.\n\n« CSR mandated companies are required to file details of CSR activities annually in MCA21 registry.\n\n* Non Compliance of CSR provisions have been notified as a civil wrong w.e.f. from 22”° January 2021.\n\n* Contribution to following Funds shall be admissible as CSR expenditure: Swachh Bharat Kosh,Clean\nGanga Fund, Prime Minister's National Relief Fund(PMNRF), PM Citizen Assistance and Relief in Emergency\nSituations Fund (PM CARES fund).\n\neo\n.\nTrends in CSR Spending\n150% increase from CSR Rs. 26,000 crore has 29.5% and 24.5% of the total\nspending from 2014-15. been invested by more than spending was done in Health and\n| 18,000 companies. Education sector respectively.\nDoubling of spending in the Increased spending on Less than 0.1% spending\nEnvironment sector due to sanitation through the Clean towards technology\nIndia's global climatic Gange fund, Drinking water, and incubators since the\ncommitments. Slum area development inception of CSR\n\nCompanies (CSR Policy) Amendment Rules, 2021\n\n* Impact assessment by an independent agency for companies spending Rs. 10 Crore or more in the three\nimmediately preceding financial years under CSR.\n\n* Mandatory transfer of unspent CSR amount is required.\n\n« Administrative overheads shall not exceed 5% of total CSR expenditure of the company for the financial\nyear.\n\n* “Ongoing Project” means a multi-year project shall not exceed 3 years (excluding the FY in which it was\ncommenced)\n\nCompanies (CSR Policy) Amendment Rules, 2022\n\n* CSR committee establishment for unspent CSR amount.\n« Cost of social impact assessments, which can be considered as CSR spending, cannot be greater than\n2% of all CSR expenditures for the applicable financial year or Rupees 50 lakh, whichever is higher.\n\nFramework of Corporate Governance in India\n\n* The Companies Act, 2013: Mandates the constitution of board and meetings, audit committees,\ndisclosure requirements in financial statements etc.\n\n* Securities and Exchange Board of India (SEBI): Monitors and regulates the corporate governance of\nlisted companies.\n\n* Institute of Chartered Accountants of India (ICAI): For issuing guidelines and standards, thereby\ndirecting the pathway of disclosing financial data.\n\n« Institute of Company Secretaries of India (ICSI): Issues the secretarial standards primarily in terms of\n“Board of Directors Meetings” and “General Meetings”.\n\n* Ministry of Corporate Affairs: Regulates the functioning of the corporate sector in accordance with law.\n\n|12.1.1. INDIAN COMPANIES ON INTERNATIONAL FINANCIAL SERVICES CENTRE\n(IFSC)\n\nWhy in the news?\n\nRecently, the Finance Minister said that Indian companies can list directly on International Financial Services\nCentre (IFSC).\n\nMore on the news\n\n« Presently, Indian companies cannot directly list their securities abroad without getting themselves listed\nin domestic stock exchanges\no In 2020, Centre amended Companies Act, allowing direct listing of Indian companies on foreign\nstock exchanges\n* Currently, Indian companies can raise money abroad through American Depository Receipts (ADR) and\nGlobal Depository Receipts (GDR).\no Depositary Receipt (DR) is an instrument used by domestic companies to raise money outside the\ncountry. These shares are held by a foreign bank that provides DRs to companies in return for shares.\no Both GDR and ADR are used to raise funds from foreign market.\nv However, ADRs are traded on US stock exchanges while GDRs are traded mostly on European\nExchanges.\n\nAbout IFSC\n\n« An IFSC caters to customers outside the jurisdiction of the domestic economy. Such centres deal with\nflows of finance, financial products and services across borders.\n\ne It can provide several services including fund-raising, Asset management and global portfolio\ndiversification, wealth management etc.\n\n¢ Establishment: IFSCA has been established in 2020 under the International Financial Services Centres\nAuthority Act, 2019.\nco Itis headquartered at GIFT City, Gandhinagar in Gujarat.\n\n* Role of IFSCA:\no The IFSCA is a unified authority for the development and regulation of financial products, financial\n\nservices and financial institutions in the IFSC in India.\n\no Atpresent, the GIFT IFSC is the maiden international financial services centre in India.\n\n12.2. COMPETITION (AMENDMENT) ACT 2023\n\nWhy in the news?\n\nThe Centre notified several provisions of the Competition (Amendment) Act (CAA) 2023, which amended the\nCompetition Act (CA), 2002.\nCompetition Act 2002\n* Itreplaced the Monopolies and Restrictive Trade Practices (MRTP) Act, 1969.\n* It provided for the establishment of the Competition Commission of India (CCI).\n* The Act forbids anti-competitive agreements, corporate abuse of dominant positions, and\ncombinations (including acquisitions, takeovers of control, and mergers and acquisitions) that have or\nare likely to have a materially negative impact on competition in India.\n\nAmended definitions in the Act\n\n* Definition of Combination: The CAA expands the definition of combinations (mergers, acquisitions, or\namalgamation of enterprises) to include transactions with a value above Rs 2,000 crore.\n\n* Reduction in the time limit for approval of combinations: From 210 days to 150 days.\n\n* The CCl is now required to form a prima facie opinion on a combination within 30 days, otherwise, the\ncombination shall be deemed to have been approved.\n\n* Expansion of Scope of Cartels to Include “Hub and Spoke Arrangements”: Companies which are not\nengaged in identical or similar business activities can also be held liable for an anti-competitive horizontal\nagreement (cartelization).\n\n« Wherever such companies participate or intend to participate in facilitating such an agreement.\n\nGrievance Redressal and Penalty provisions\n\n« Limitation Period for Filing Information: A complaint against anti-competitive conduct needs to be filed\nbefore the Competition Commission of India (CCl) within 3 years from the date on which the cause of action\narose. The CCl is empowered to condone delays.\n\n* Increased Penalty: For false statements/ omission of material information from % 1 crore to % 5 crore.\n\n* Penalty Based on Global Turnover: The penalties would be imposed based on the global turnover derived\nfrom all products and services by such person or an enterprise.\n\n* Compounding of Offences: CAA introduces a provision which allows the compounding of any offence\n(which does not entail imprisonment).\n\no Compounding an offence indicates that the individual with whom the crime has been perpetrated has\nacquired some compensation from the accused.\n\n« Decriminalisation of certain offences such as failure to comply with orders of CCI and directions of the\nDirector General concerning anti-competitive agreements and abuse of dominant position.\n\n« Leniency provision: Where a party implicated in a cartel investigation makes a true and vital disclosure of\nan alleged violation or another undisclosed cartel, CCI is empowered to also grant an additional lesser\npenalty for the cartel already being investigated.\n\nOther provisions of the CAA\n\n* Settlement and commitment mechanism: Under the CAA, CCl may initiate proceedings against\nenterprises on grounds of entering into anti-competitive agreements.\n\n« Appointment of Director General (DG): As per the CAA, the DG shall now be appointed by the CCI with\nprior approval of the Central Government as against the erstwhile power being vested with the Central\nGovernment.\n\nCompetition Commission of India\n¢ Genesis: It is a statutory body created via the Competition act, 2002.\n* Mandate:\no Eliminate practices having adverse effect on competition,\no Promote and sustain competition,\n\n\n* Ministry: Ministry of Corporate Affairs.\n* Composition: Chairperson and at least 2 to maximum 6 other members to be appointed by the\n\n* Powers: The commission can inquire into certain agreements, combinations and dominant position\n\n© Protect the interests of consumers and\no Ensure freedom of trade in the markets of India.\n\ncentral government.\no Term of office of chairperson and members is five years or the age of 65 years whichever is earlier.\n\nThey are eligible for reappointment.\n\nof enterprise.\n0 Itcan regulate its own procedure and amend its orders to rectify any mistakes.\nco Failure to follow commission orders or directions can result in fine or imprisonment.\n\nInternational Competition Network\n* The CCI became a member of the steering group of the ICN for the first time.\n* CCl membership will be for two years.\n« The ICN is a specialized yet informal network of 140 competition authorities.\n* The ICN's mission is to advocate the adoption of superior standards and procedures in competition\npolicy around the world.\n\n12.3. JAN VISHWAS (AMENDMENT OF PROVISIONS) ACT, 2023\n\nWhy in the news?\n\nRecently, the Jan Vishwas (Amendment of Provisions) Bill, 2023, received the President's assent. The Act aims\nto give a boost to ease of living and ease of doing business.\n\nKey highlights of the Act\n\nDecriminalises 183 provisions across 42 laws administered by 19 Ministries/Departments.\n\nConverts several fines into penalties, implying that judicial prosecution is not necessary to administer\npunishment.\n\nRemoves all offences and penalties under the Indian Post Office Act 1898.\n\nPeriodic revision (10% increase of the minimum amount every three years) of fines and penalties for various\noffences in specified Acts.\n\nChanges in grievance redress and appellate mechanisms and appointment of one or more\nadjudicating officers for determining penalties under acts such as the Cinematograph Act, 1952,\nEnvironment (Protection) Act, 1986, Merchant Shipping Act, 1958, etc.\n\n12.4. TRANSFER PRICING\n\nWhy in the news?\nSupreme Court altered the approach to resolving transfer pricing disputes in India.\n\nMore in the news\n\nSupreme Court set aside an earlier Karnataka High Court ruling which held that in transfer pricing\n\nmatters, the determination of the arm's length price (ALP) by the Income Tax Appellate Tribunal (ITAT) is final\n\nand cannot be subject to judicial scrutiny.\n\noc InIndia, Transfer Pricing and ALP provisions are contained in Chapter X of the Income-tax Act, 1961\nand arm's length price is determined by the Assessing Officer.\n\nThe apex court now held that any ALP determined outside the purview of relevant transfer pricing (TP)\n\nprovisions in the Income Tax Act can be considered as ‘perverse (unjust)’ and in such cases decision of\n\nthe tribunal is not final.\n\noc Insuch cases, both, the Indian Revenue Authorities (IRA) as well as taxpayers, can approach a HC after\na decision by the ITAT.\n\n« The SC ruling has restored TP issues to the same pedestal as other tax issues in India.\n\nAbout ITAT\n\n«  ITATis a quasi-judicial institution set up in 1941.\nIt specializes in dealing with appeals under the Direct Taxes Acts.\nThe orders passed by the ITAT are final, an appeal lies to the High Court only if a substantial question of\nlaw arises for determination.\n\n* Starting with three Benches at Dethi, Kolkata and Mumbai, the numbers of Benches have progressively\nincreased and presently ITAT has 63 Benches in 27 different stations.\n\nAbout Transfer Pricing Arm’s Length Transaction\n\n« Transfer pricing is an accounting practice that |\nallows for the establishment of prices for the\n\ngoods and services exchanged between It the price agreed between\ndivisions, subsidiaries or affiliates that are them is a fair Value, then\npart of the larger enterprise. Gin Arava lenght\n* Usually, Companies use transfer pricing to\nreduce the overall tax burden of the parent aac Inc, USA ABC Inc, the\ncompany. Netherlands\n\no This is done by charging a higher price to\nsubsidiaries in high-tax countries (reducing profit) while charging a lower price (increasing profits) for\nsubsidiaries in low-tax countries.\n\nAbout Arm’s Length Principle (ALP)\n\n«It means that the price a company pays to purchase goods or services from a related company entity\nshould be the same as if the two entities were unrelated (known as arm’s length price).\no There should be no price adjustment or special conditions for the transaction simply because the\nparties are related legal entities.\n* Its objective is to avoid the erosion of the tax base or the transfer of profits to low-tax jurisdictions.\n\n12.5. GLOBAL INNOVATION INDEX (GII) 2023\n\nWhy in the news?\n\nes\n: Criteria to Measure Innovation ~\nIndia maintains 40th Rank in the recently released GIl\n\n2023, by the World Intellectual Property Input pillars\nOrganization (WIPO).\nAbout GIl 2 Institutions ;\n\nHuman Capital & research\n« The Gilis a reliable tool for governments across Infrastructure\n\nthe world to assess the innovation-led social\n\nand economic changes in their respective Market Sophistication\ncountries. Business Sophistication\n\n«  Itis co-published annually by Cornell University,\n\nsees\n\nINSEAD Business School, and WIPO. Output pillars\nKey Findings 2 Knowledge and Technology Outputs\n«  Forthe 13th consecutive year, Switzerland ranks 2 Creative Outputs\n\nfirst in the Gil. __——————\n\n* Status of Innovation in India:\no India leads the lower middle-income group and is stable.\n0 India continues as a record holder by being an innovation over performer for a 13th consecutive year.\n\noc The ascent of India in terms of publication output (ranking 4th in 2022), overtaking the UK (Sth) and\nGermany (3rd).\nco India has 4 technology clusters among the top 100 clusters: Bengaluru, Delhi, Chennai and Mumbai.\n\nWorld International Property Organization (WIPO)\n* Genesis: Specialized Agency of UN, established in 1967.\n\nObjective: Developing a balanced and accessible international Intellectual Property (IP) system.\nMembership: It has 193 members (including India).\n\nOrganizational Structure: The General Assembly and the Coordination Committee.\n\nMajor Treaties (India is a member of all three):\n\no Paris Convention for the Protection of Industrial Property (1998).\n\no Berne Convention for the Protection of Literary and Artistic Works (1928).\n\n© Patent Cooperation Treaty (1998)\n\n12.6. STARTUPS IN INDIA\n\nWhy in the news?\n\neeee\n\nThe Parliamentary Standing Committee on Commerce recently released a report titled ‘Ecosystem of Startups\nto Benefit India’.\n\nKey pointers of the report\n\n* Access to funding: Investments in startups are cyclical in nature. They witness market corrections based\non various factors such as macroeconomic conditions, investor sentiments, and monetary policies.\n\n* Single implementation agency: 42 ministries/departments/bodies are overseeing the implementation of\nvarious schemes and initiatives related to startups.\n\n« Regulatory support: The Committee noted that easing regulatory/legal framework to facilitate direct\noverseas listing of unlisted Indian startups could give a boost to the ecosystem.\n\nStartups In India eC\n\nDefinition and Criteria\n\nA company or entity will be referred to as a startup if it fulfills certain criteria parameters given by Dept of\nPromotion of Industry and Internal Trade (DPIIT, Ministry of Commerce and Industry) under Start-Up India\nScheme.\n\n© company Oma a Annual @ Original A Innovative\nAge Type Turnover Entity & Scalable\n\nPeriod of Incorporated as a|| Should have an Entity should not Should work towards\nexistence and Private Limited annual turnover have been formed development or\noperations should Company a not exceeding Rs__ by splitting up or | improvement of a product\nnot exceeding 10 Registered 100 crore for any —_ reconstructing an || process or service and/or\nyears from the Partnership Firm of the financial already existing have scalable business\nDate of or a Limited years since its business model with high potential\nIncorporation Liability Incorporation for creation of wealth &\nPartnership employment\n\n* DPIIT recognition grants tax exemptions for 3 years to startups\nRegulation of Startup Ecosystem in India\n\n* Ministry of Corporate Affairs (MCA) has defined “start-up” through an executive order under the\nCompanies Act 2013 and gives few operational and compliance relaxations for a “start-up company”.\n* The Securities and Exchange Board of India (SEB!) notifies rules for listing start-ups.\n\n« Reserve Bank of India (RBI) created a dedicated helpline for start-ups in India to offer\nguidance/assistance for undertaking cross-border transactions within the ambit of the regulatory\nframework.\n\nIssues/Challenges in the Startup Ecosystem of India\n\n* Less focus on Agriculture: Out of the total recognised startups, only 5.18% are in the agriculture sector.\n\n« Low Intellectual Property Rights (IPR): Only 11% of the patent applications filed by startups have been\ngranted patents.\n\n« Flipping (Registering in a foreign country): The Economic Survey 2022-23 highlighted the flipping trend\ndue to more access to overseas debt, eliminating the risk of angel tax, better IP protection, etc.\n\n12.7. BUREAU OF INDIAN STANDARDS (BIS)\n\nWhy in the News?\n\nThe Union Minister of Consumer Affairs, Food and Public Distribution informed that the Bureau of Indian\nStandards (BIS) nod must for an additional 115 categories of product from 2024.\n\nMore on News\n\n* Ceiling fans, stainless steel cookware, wrought aluminum utensils; block boards and aluminum cans for\nbeverages will come under the mandatory quality norms notified by the BIS.\n\nBureau of Indian Standards (BIS)\n\n« Genesis: BIS is the National Standards Body of India, established under the BIS Act 1986, replacing the\nthen Indian Standards Institution (ISI) and later restructured by the BIS Act, 2016\nco Itworks under the aegis of Ministry Of Consumer Affairs, Food & Public Distribution (MoCA,F&PD)\n* Objectives:\no Tosatisfy the customer needs for quality\no Toachieve harmonious development of activities of standardization\no Toprovide thrust to standardization and quality control for growth and development.\n* Organizational Structure:\no AGoverning Council consists of 27 members:\nv President: Minister of MoCA, F&PD\nv Vice President: Minister of State of MoCA,\nF&PD\n* Functions:\n\nExisting products under Compulsory\ncertification (ISI) in India\n\nAround 560 Products falls under compulsory\ncertification requirement, which are clubbed\nunder major heads like\n\no Formulation of Standards through a consultative Cement (Any variety)\nmechanism and technical committees. ere Cen ee ea\nFood and Related Products\n\no Review of standards every in five years.\n\nHarmonize Indian standards and publish them.\n\no Certification of products, foreign manufacturers\nand Hallmarking of Gold and Silver jewellery etc.\n\nAutomobile Accessories\n\nMedical equipment\n\nSteel and Iron products\n\nAir Conditioner and its parts\n\nDomestic gas stoves and pressure cookers\nElectric and Non-electric toys etc...\n\n°\n\nMajor Achievements of BIS\n\n« BlShas awarded the Product certification (Voluntary)\nto more than 1000 products in the country.\n\n* BIS has developed an online consignment portal (Manakonline) for foreign licensees through which the\nconformity to Indian Standards can be easily checked.\n\n«  Itunveiled the Standards National Action Plan (2022- 27) to serve as foundation for standardization in the\ncountry.\n\n*  Self-marking rights of the BIS standards mark (ISI mark) is provided to the manufacturer of a particular\nproduct, except for a list of 211 products.\n\nooo eee eee\n\n\nDifferent Certification Marksinindia\n\nIcon of Name of\ncertification certification Detail\nmark mark\n+\n‘ich Isl Mark Issued by BIS for consumer durable goods, electronic\nI)! items, kitchen appliances, etc.\nIssued by Directorate of Marketing & Inspection\non (DMI), Department of Agriculture for agricultural\ncommodities and livestock products.\na BIS Hallmark _ Issued by BIS for gold jewellery.\n© Woolmark _—_Signifies 100% pure wool.\nY) ECO MARK Issued by BIS for environmental friendly products.\nIssued by Food Safety and Standards Authority of\nFeO MARS India (FSSAI) for food products.\nom, India Issued by Agricultural and Processed Food Products\nvv : Organic Export Development Authority for organically farmed\n\nfood products.\n\n",
                        "extracted-code": ""
                    }
                ]
            }
        ]
    }
}