{
    "New item": {
        "chapters": [
            {
                "chapter_name": "1. MINISTRY OF AGRICULTURE &\nFARMERS WELFARE",
                "chapter_path": "./screenshots-images-2/chapter_1",
                "sections": [
                    {
                        "section_name": "Bis. AGRICULTURE INFRASTRUCTURE FUND (AIF)",
                        "section_path": "./screenshots-images-2/chapter_1/section_1",
                        "images": [
                            "./screenshots-images-2/chapter_1/section_1/fb35d182-8566-4dbe-b9da-1139ef7f3c49.png",
                            "./screenshots-images-2/chapter_1/section_1/99ff9f9c-bf85-4dd3-b3bc-87c81954ab9f.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "@) Quick Facts\n\nType: Central Sector Scheme\n\nove ©\n\nTenure: Upto 2032- 33\n\nTo mobilize a medium to long term debt financing facility for investment in viable projects for post-harvest\n\nmanagement Infrastructure and community farming assets.\n\n> Salient Features\n\nBackground: AIF was launched as part of\n\nthe Atmanirbhar Bharat Abhiyan (Self-\n\nReliant India Campaign) announced by\n\nthe Centre in May 2020.\n\nFinancial assistance\n\n+ Provision of Rs. 1 Lakh Crore by banks\nand financial institutions as loans with\ninterest subvention of 3% per annum\nand\n\n« Credits guarantee coverage under\nCredit Guarantee Fund Trust for Micro\nand Small Enterprises (CGTMSE) for\nloans up to Rs. 2 Crores.\n\n* Eligible community assets project\n\n°\n\n?\n\n* Projects identified for providing supply chain infrastructure for clusters of crops including export\n\nclusters.\n\nFarmers\nco\n\nPrimary\n\n~\n\n~ Cen\n\nAgricultural\nCredit Societies\n(Pacs) /\n\nSome key\n\nBeneficiaries\n\np\n\n|| & \\\n| rarmer\n/ Producers\nOrganisations\n\nPurpose: To address the existing infrastructure gaps and mobilize investmentin agriculture infrastructure.\n\nImplementing Agency: NABARD (National Bank for Agriculture and Rural Development)\n\nSelf Help\nGroups\n(sHG)\n1g]\nState\nAgencies/\nAPMCs\n\n« Projects promoted by Central/State/Local Governments or their agencies under PPP.\n\n* Organic inputs production; Bio stimulant production units; Infrastructure for smart and precision\n\nagriculture.\n\n\n® Management and monitoring\n+ Through an online Management Information System (MIS) platform.\n+ National, State and District level Monitoring Committees will ensure real-time monitoring and effective\nfeedback.\n* BHARAT campaign: Banks Heralding Accelerated Rural & Agriculture Transformation (BHARAT) campaign\nwas launched to:\n+ Provide maximum benefits to the people\n+ Create a competitive spirit among the Banks and lending institutions to mobilize agriculture\ninfrastructure projects loan at a faster pace.\n\n",
                        "extracted-code": "",
                        "gpt-text-processed": "In the vibrant tapestry of India’s agricultural landscape, a transformative initiative emerged as a ray of hope for farmers and rural communities. This initiative is the Agriculture Infrastructure Fund (AIF), a Central Sector Scheme designed to enhance post-harvest management infrastructure and community farming assets. Launched in May 2020 under the Atmanirbhar Bharat Abhiyan, or the Self-Reliant India Campaign, AIF stands as a testament to the government’s commitment to uplift the agricultural sector and ensure its sustainability.\n\nThe journey of the AIF commenced with a bold vision: to mobilize much-needed financial assistance for viable agricultural projects that could bridge existing infrastructure gaps. With a tenure extending until 2032-33, this ambitious program aims to create a medium to long-term debt financing facility for investments in the agricultural domain, especially focusing on post-harvest technologies that could revolutionize the way farmers manage their produce.\n\nAt the heart of AIF lies its financial framework, which promises a staggering provision of Rs. 1 Lakh Crore in loans made available by banks and financial institutions. This funding is not only substantial but is made even more appealing with an interest subvention of 3% per annum, significantly reducing the financial burden on borrowers. Additionally, the initiative offers credit guarantee coverage under the Credit Guarantee Fund Trust for Micro and Small Enterprises (CGTMSE) for loans up to Rs. 2 Crores, further securing the financial support needed to kickstart community projects.\n\nThe scope of AIF is broad and inclusive, catering to a diverse array of stakeholders in the agricultural sector. Key beneficiaries include farmers, Agricultural Credit Societies (PACS), Farmer Producers Organizations (FPOs), Self Help Groups (SHGs), and various State Agencies, thereby ensuring that the grassroots level reaps the benefits of this scheme. The projects supported under this fund include the production of organic inputs, bio-stimulant production units, and the establishment of infrastructure for smart and precision agriculture. This wide-ranging support is aimed at fostering innovation and enhancing productivity in the agricultural sector.\n\nAn essential aspect of the AIF program is its emphasis on supply chain infrastructure, particularly for clusters of crops that showcase export potential. By focusing on these clusters, the fund not only empowers local farmers but also positions them to tap into global markets, boosting the Indian economy.\n\nTo effectively manage and monitor the progress of projects funded by AIF, an online Management Information System (MIS) platform has been established. This digital framework allows for real-time tracking, evaluation, and feedback, ensuring that projects remain on course and objectives are met. Moreover, National, State, and District-level Monitoring Committees are tasked with overseeing the implementation, ensuring that any challenges faced are promptly identified and addressed.\n\nA distinguishing feature of the AIF initiative is the BHARAT campaign, which stands for Banks Heralding Accelerated Rural & Agriculture Transformation. Launched to galvanize the banking sector into action, this campaign fosters a competitive spirit among banks and lending institutions, encouraging them to swiftly mobilize loans for agriculture infrastructure projects. This not only enhances access to financing for rural farmers but also drives the overall growth of the agricultural infrastructure in the country.\n\nIn conclusion, the Agriculture Infrastructure Fund represents a systemic and strategic approach to transform agriculture in India. By addressing key challenges related to infrastructure development, this initiative holds the promise of fostering an empowered farming community, ultimately leading to a more sustainable and self-reliant agricultural sector. Through collaboration among various stakeholders and robust financial support, AIF paves the way towards a prosperous future for India’s farmers, ushering in an era of agricultural innovation and growth."
                    },
                    {
                        "section_name": "1.2. FORMATION AND PROMOTION OF 10,000 NEW\nFARMER PRODUCER ORGANIZATIONS (FPOS)",
                        "section_path": "./screenshots-images-2/chapter_1/section_2",
                        "images": [
                            "./screenshots-images-2/chapter_1/section_2/fcc84f4a-1ade-49c0-8213-eb059480c0e7.png",
                            "./screenshots-images-2/chapter_1/section_2/51bec85d-db4f-4a4a-9f0e-2e92f8132fdb.png"
                        ],
                        "code_images": [],
                        "status": "images tested ok",
                        "errors": [],
                        "extracted-text": "Quick Facts\n\nType: Central Sector Scheme\nPurpose: Leveraging economies of scale and improving market access for members\n\nBeneficiaries: FPO with a minimum farmer-members’ size of 300 (in plains) and 100 in (North-Eastern and\nHilly areas)\n\nImplementing Agencies (IAs): 9 IAs will help forming FPOs\n\nQD Objective\n\nTo form and promote 10,000 new FPOs till\n2027-28.\n\n°\n\nSmall Farmers Agri:\nBusiness Consortium\n(sFac)\n\nSalient Features\n\n|\n\nNorth Eastern Regional\nAgricultural Marketing\nCorporation Limited\n\nFPO: FPO is a generic name, which\n(NERAMAC)\n\nmeans and includes FPOs incorporated/\nregistered either under Companies Act or\nunder Co-operative Societies Act of the\nconcerned States. Agriculture and Rural\n+ They are formed for the purpose (naar)\n\nof leveraging collectives through\n\neconomies of scale in production and National Agricultural\n\nketing of ‘icultural and allied <7 Cooperative\nsector. \"8 oar wes e fete) Marketing Federation\n\nof India (NAFED)\n\nge, National Cooperative\n\n{@9 Development\n\n—* Corporation (NCDC) Foundation for\n\nDevelopment of Rural Value\n\n~\nNational Bank for ® Chains (FDRVC)- Ministry of\n\nRural Development (MoRD)\n\nWatershed Development\nDepartment (WDD)-\nKarnataka\n\n\nApproach: The formation and promotion of FPO is based on Produce Cluster Area approach and\n\nspecialized commodity-based approach.\n\n« While adopting cluster-based approach, formation of FPOs will be focused on “One District One\nProduct” for development of product specialization.\n\nFinancial assistance to the FPOs: FPOs will be provided:\n\n+ Financial assistance upto Rs 18.00 lakh per FPO for a period of 3 years.\n\n* matching equity grant upto Rs. 2,000 per farmer member of FPO with a limit of Rs. 15.00 lakh per FPO\nand\n\n* acredit guarantee facility upto Rs. 2 crore of project loan per FPO from eligible lending institution to\nensure institutional credit accessibility to FPOs.\n\nHandholding to the FPOs\n\n+ Implementing Agencies (As) will engage Cluster Based Business Organizations (CBBOs) to aggregate,\nregister & provide professional handholding support to each FPO for a period of 5 years.\n\nTraining & skill development of FPOs\n\n+ Key organizations chosen as the lead training institutes for capacity development & trainings of FPOs:\n¢ Bankers Institute of Rural Development (BIRD), Lucknow.\n\nLaxmanrao Inamdar National Academy for Co-operative Research & Development (LINAC), Gurugram.\n\ninstitutional framework\n\n* National Project Management Agency (NPMA): for providing overall project guidance, coordination,\ncompilation of information relating to FPOs, maintenance of MIS and monitoring purpose.\n\n* District Level Monitoring Committee (D-MC): Under the Chairmanship of District Collector/ CEO/ Zila\nParishad for overall coordination & monitoring the implementation of scheme in the district\n",
                        "extracted-code": "",
                        "gpt-text-processed": "### A New Dawn for Farmers: The Formation and Promotion of 10,000 New Farmer Producer Organizations (FPOs)\n\nIn the heart of India, where agriculture stands as a pillar of the economy, a transformative initiative is emerging through the Ministry of Agriculture and Farmers Welfare. This initiative, aimed at the establishment and promotion of 10,000 new Farmer Producer Organizations (FPOs) by 2027-28, seeks to elevate the status of farmers, improve their market access, and ensure that they benefit from economies of scale. \n\n#### The Vision Behind the Scheme\n\nThe FPO scheme is a Central Sector Scheme designed explicitly to harness the collective power of farmers. It recognizes that, traditionally, farmers have faced numerous challenges in marketing their produce, gaining access to resources, and competing in a fragmented market. The goal is straightforward yet profound: to provide farmers with the means to come together, form organizations with a minimum of 300 members in plains and 100 in challenging terrains like the North-Eastern states and hilly regions, and collectively navigate the agricultural landscape.\n\nNine implementing agencies (IAs), including prominent organizations like the National Agricultural Cooperative Marketing Federation of India (NAFED) and the National Cooperative Development Corporation (NCDC), will spearhead the formation of these FPOs. Each agency plays a unique role in bringing farmers together, offering resources, guidance, and support necessary for these organizations to thrive.\n\n#### The Concept of FPOs\n\nFPOs, essentially cooperative bodies of farmers, can be registered either under the Companies Act or the Co-operative Societies Act, depending on the region. By pooling their resources and talents, farmers can leverage economies of scale in production, marketing, and distribution, leading to enhanced profitability and sustainability in their operations. This model reflects a shift in the agricultural paradigm, where collective strength is emphasized over individual struggle.\n\nThe overarching strategy focuses on a \"Produce Cluster Area\" approach, concentrating on the concept of \"One District One Product.\" This strategy aims to foster specialization and enhance local economies by promoting specific agricultural products that are most suited to regions across the country. \n\n#### Financial Support: A Key Ingredient\n\nUnderstanding the financial challenges faced by farmers, the scheme offers substantial support. Each FPO can receive financial assistance of up to Rs 18.00 lakh over three years, along with a matching equity grant of up to Rs 2,000 per farmer member, capped at Rs 15 lakh per FPO. Furthermore, a credit guarantee facility of up to Rs 2 crore in project loans from eligible lending institutions ensures that financial resources are accessible to these organizations. This financial backing paves the way for innovation, local entrepreneurship, and growth within the agricultural sector.\n\n#### Continued Support and Development\n\nRecognizing that the establishment of FPOs is only the first step, the implementing agencies will engage Cluster Based Business Organizations (CBBOs) to provide essential handholding support for the crucial initial five years. This support will encompass aggregate registration, professional guidance, and capacity building, ensuring that FPOs do not just exist but flourish.\n\nTraining and skill development will also be integral to the success of the FPOs. Leading training institutions, such as the Bankers Institute of Rural Development (BIRD) in Lucknow and the Laxmanrao Inamdar National Academy for Co-operative Research & Development (LINAC) in Gurugram, have been tasked with equipping farmers with the skills and knowledge necessary to excel in their endeavors. From financial literacy to the latest agricultural practices, these training initiatives will arm farmers with the tools they need to thrive in today's competitive market.\n\n#### Monitoring for Success\n\nTo ensure that these initiatives are implemented effectively, an institutional framework has been established. The National Project Management Agency (NPMA) will oversee overall project guidance and maintain a robust information system for monitoring and evaluation. Additionally, a District Level Monitoring Committee (D-MC), chaired by the District Collector, will ensure that the scheme's execution is smooth and aligned with local needs.\n\nIn conclusion, the formation and promotion of 10,000 new FPOs is not merely a scheme; it represents a larger vision for India's agricultural future. By empowering farmers, facilitating their access to resources, and enabling them to work collectively, this initiative aims to redefine the narrative surrounding agriculture in India. It envisions a future where farmers thrive, not just survive, and where the spirit of collaboration drives sustainable growth in the agricultural sector. As we move forward, the potential of FPOs stands as a beacon of hope for rural development, economic resilience, and the upliftment of farming communities across the nation."
                    }
                ]
            }
        ]
    }
}